/* automatically generated by rust-bindgen 0.70.1 */

pub type WGPUAdapter = *const crate::WGPUAdapterImpl;
pub type WGPUBindGroup = *const crate::WGPUBindGroupImpl;
pub type WGPUBindGroupLayout = *const crate::WGPUBindGroupLayoutImpl;
pub type WGPUBuffer = *const crate::WGPUBufferImpl;
pub type WGPUCommandBuffer = *const crate::WGPUCommandBufferImpl;
pub type WGPUCommandEncoder = *const crate::WGPUCommandEncoderImpl;
pub type WGPUComputePassEncoder = *const crate::WGPUComputePassEncoderImpl;
pub type WGPUComputePipeline = *const crate::WGPUComputePipelineImpl;
pub type WGPUDevice = *const crate::WGPUDeviceImpl;
pub type WGPUInstance = *const crate::WGPUInstanceImpl;
pub type WGPUPipelineLayout = *const crate::WGPUPipelineLayoutImpl;
pub type WGPUQuerySet = *const crate::WGPUQuerySetImpl;
pub type WGPUQueue = *const crate::WGPUQueueImpl;
pub type WGPURenderBundle = *const crate::WGPURenderBundleImpl;
pub type WGPURenderBundleEncoder = *const crate::WGPURenderBundleEncoderImpl;
pub type WGPURenderPassEncoder = *const crate::WGPURenderPassEncoderImpl;
pub type WGPURenderPipeline = *const crate::WGPURenderPipelineImpl;
pub type WGPUSampler = *const crate::WGPUSamplerImpl;
pub type WGPUShaderModule = *const crate::WGPUShaderModuleImpl;
pub type WGPUSurface = *const crate::WGPUSurfaceImpl;
pub type WGPUTexture = *const crate::WGPUTextureImpl;
pub type WGPUTextureView = *const crate::WGPUTextureViewImpl;

pub const WGPU_ARRAY_LAYER_COUNT_UNDEFINED: u32 = 4294967295;
pub const WGPU_COPY_STRIDE_UNDEFINED: u32 = 4294967295;
pub const WGPU_DEPTH_SLICE_UNDEFINED: u32 = 4294967295;
pub const WGPU_LIMIT_U32_UNDEFINED: u32 = 4294967295;
pub const WGPU_MIP_LEVEL_COUNT_UNDEFINED: u32 = 4294967295;
pub const WGPU_QUERY_SET_INDEX_UNDEFINED: u32 = 4294967295;
#[doc = " \\defgroup UtilityTypes Utility Types\n\n @{"]
pub type WGPUFlags = u64;
pub type WGPUBool = u32;
#[doc = " Nullable value defining a pointer+length view into a UTF-8 encoded string.\n\n Values passed into the API may use the special length value @ref WGPU_STRLEN\n to indicate a null-terminated string.\n Non-null values passed out of the API (for example as callback arguments)\n always provide an explicit length and **may or may not be null-terminated**.\n\n Some inputs to the API accept null values. Those which do not accept null\n values \"default\" to the empty string when null values are passed.\n\n Values are encoded as follows:\n - `{NULL, WGPU_STRLEN}`: the null value.\n - `{non_null_pointer, WGPU_STRLEN}`: a null-terminated string view.\n - `{any, 0}`: the empty string.\n - `{NULL, non_zero_length}`: not allowed (null dereference).\n - `{non_null_pointer, non_zero_length}`: an explictly-sized string view with\n   size `non_zero_length` (in bytes).\n\n For info on how this is used in various places, see \\ref Strings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStringView {
    pub data: *const ::std::os::raw::c_char,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStringView"][::std::mem::size_of::<WGPUStringView>() - 16usize];
    ["Alignment of WGPUStringView"][::std::mem::align_of::<WGPUStringView>() - 8usize];
    ["Offset of field: WGPUStringView::data"]
        [::std::mem::offset_of!(WGPUStringView, data) - 0usize];
    ["Offset of field: WGPUStringView::length"]
        [::std::mem::offset_of!(WGPUStringView, length) - 8usize];
};
pub const WGPUAdapterType_DiscreteGPU: WGPUAdapterType = 1;
pub const WGPUAdapterType_IntegratedGPU: WGPUAdapterType = 2;
pub const WGPUAdapterType_CPU: WGPUAdapterType = 3;
pub const WGPUAdapterType_Unknown: WGPUAdapterType = 4;
pub const WGPUAdapterType_Force32: WGPUAdapterType = 2147483647;
#[doc = " \\defgroup Enumerations\n \\brief Enums.\n\n @{"]
pub type WGPUAdapterType = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUAddressMode_Undefined: WGPUAddressMode = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUAddressMode_ClampToEdge: WGPUAddressMode = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUAddressMode_Repeat: WGPUAddressMode = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUAddressMode_MirrorRepeat: WGPUAddressMode = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUAddressMode_Force32: WGPUAddressMode = 2147483647;
pub type WGPUAddressMode = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_Undefined: WGPUBackendType = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_Null: WGPUBackendType = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_WebGPU: WGPUBackendType = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_D3D11: WGPUBackendType = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_D3D12: WGPUBackendType = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_Metal: WGPUBackendType = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_Vulkan: WGPUBackendType = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_OpenGL: WGPUBackendType = 7;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_OpenGLES: WGPUBackendType = 8;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBackendType_Force32: WGPUBackendType = 2147483647;
pub type WGPUBackendType = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Undefined: WGPUBlendFactor = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Zero: WGPUBlendFactor = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_One: WGPUBlendFactor = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Src: WGPUBlendFactor = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusSrc: WGPUBlendFactor = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_SrcAlpha: WGPUBlendFactor = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusSrcAlpha: WGPUBlendFactor = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Dst: WGPUBlendFactor = 7;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusDst: WGPUBlendFactor = 8;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_DstAlpha: WGPUBlendFactor = 9;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusDstAlpha: WGPUBlendFactor = 10;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_SrcAlphaSaturated: WGPUBlendFactor = 11;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Constant: WGPUBlendFactor = 12;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusConstant: WGPUBlendFactor = 13;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Src1: WGPUBlendFactor = 14;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusSrc1: WGPUBlendFactor = 15;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Src1Alpha: WGPUBlendFactor = 16;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_OneMinusSrc1Alpha: WGPUBlendFactor = 17;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendFactor_Force32: WGPUBlendFactor = 2147483647;
pub type WGPUBlendFactor = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Undefined: WGPUBlendOperation = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Add: WGPUBlendOperation = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Subtract: WGPUBlendOperation = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_ReverseSubtract: WGPUBlendOperation = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Min: WGPUBlendOperation = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Max: WGPUBlendOperation = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBlendOperation_Force32: WGPUBlendOperation = 2147483647;
pub type WGPUBlendOperation = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates that this @ref WGPUBufferBindingLayout member of\n its parent @ref WGPUBindGroupLayoutEntry is not used.\n (See also @ref SentinelValues.)"]
pub const WGPUBufferBindingType_BindingNotUsed: WGPUBufferBindingType = 0;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBufferBindingType_Undefined: WGPUBufferBindingType = 1;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBufferBindingType_Uniform: WGPUBufferBindingType = 2;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBufferBindingType_Storage: WGPUBufferBindingType = 3;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBufferBindingType_ReadOnlyStorage: WGPUBufferBindingType = 4;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUBufferBindingType_Force32: WGPUBufferBindingType = 2147483647;
pub type WGPUBufferBindingType = ::std::os::raw::c_uint;
pub const WGPUBufferMapState_Unmapped: WGPUBufferMapState = 1;
pub const WGPUBufferMapState_Pending: WGPUBufferMapState = 2;
pub const WGPUBufferMapState_Mapped: WGPUBufferMapState = 3;
pub const WGPUBufferMapState_Force32: WGPUBufferMapState = 2147483647;
pub type WGPUBufferMapState = ::std::os::raw::c_uint;
#[doc = " `0x00000001`.\n Callbacks created with `WGPUCallbackMode_WaitAnyOnly`:\n - fire when the asynchronous operation's future is passed to a call to `::wgpuInstanceWaitAny`\n   AND the operation has already completed or it completes inside the call to `::wgpuInstanceWaitAny`."]
pub const WGPUCallbackMode_WaitAnyOnly: WGPUCallbackMode = 1;
#[doc = " `0x00000002`.\n Callbacks created with `WGPUCallbackMode_AllowProcessEvents`:\n - fire for the same reasons as callbacks created with `WGPUCallbackMode_WaitAnyOnly`\n - fire inside a call to `::wgpuInstanceProcessEvents` if the asynchronous operation is complete."]
pub const WGPUCallbackMode_AllowProcessEvents: WGPUCallbackMode = 2;
#[doc = " `0x00000003`.\n Callbacks created with `WGPUCallbackMode_AllowSpontaneous`:\n - fire for the same reasons as callbacks created with `WGPUCallbackMode_AllowProcessEvents`\n - **may** fire spontaneously on an arbitrary or application thread, when the WebGPU implementations discovers that the asynchronous operation is complete.\n\n   Implementations _should_ fire spontaneous callbacks as soon as possible.\n\n @note Because spontaneous callbacks may fire at an arbitrary time on an arbitrary thread, applications should take extra care when acquiring locks or mutating state inside the callback. It undefined behavior to re-entrantly call into the webgpu.h API if the callback fires while inside the callstack of another webgpu.h function that is not `wgpuInstanceWaitAny` or `wgpuInstanceProcessEvents`."]
pub const WGPUCallbackMode_AllowSpontaneous: WGPUCallbackMode = 3;
#[doc = " `0x00000003`.\n Callbacks created with `WGPUCallbackMode_AllowSpontaneous`:\n - fire for the same reasons as callbacks created with `WGPUCallbackMode_AllowProcessEvents`\n - **may** fire spontaneously on an arbitrary or application thread, when the WebGPU implementations discovers that the asynchronous operation is complete.\n\n   Implementations _should_ fire spontaneous callbacks as soon as possible.\n\n @note Because spontaneous callbacks may fire at an arbitrary time on an arbitrary thread, applications should take extra care when acquiring locks or mutating state inside the callback. It undefined behavior to re-entrantly call into the webgpu.h API if the callback fires while inside the callstack of another webgpu.h function that is not `wgpuInstanceWaitAny` or `wgpuInstanceProcessEvents`."]
pub const WGPUCallbackMode_Force32: WGPUCallbackMode = 2147483647;
#[doc = " The callback mode controls how a callback for an asynchronous operation may be fired. See @ref Asynchronous-Operations for how these are used."]
pub type WGPUCallbackMode = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Undefined: WGPUCompareFunction = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Never: WGPUCompareFunction = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Less: WGPUCompareFunction = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Equal: WGPUCompareFunction = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_LessEqual: WGPUCompareFunction = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Greater: WGPUCompareFunction = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_NotEqual: WGPUCompareFunction = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_GreaterEqual: WGPUCompareFunction = 7;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Always: WGPUCompareFunction = 8;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCompareFunction_Force32: WGPUCompareFunction = 2147483647;
pub type WGPUCompareFunction = ::std::os::raw::c_uint;
pub const WGPUCompilationInfoRequestStatus_Success: WGPUCompilationInfoRequestStatus = 1;
pub const WGPUCompilationInfoRequestStatus_InstanceDropped: WGPUCompilationInfoRequestStatus = 2;
pub const WGPUCompilationInfoRequestStatus_Error: WGPUCompilationInfoRequestStatus = 3;
pub const WGPUCompilationInfoRequestStatus_Unknown: WGPUCompilationInfoRequestStatus = 4;
pub const WGPUCompilationInfoRequestStatus_Force32: WGPUCompilationInfoRequestStatus = 2147483647;
pub type WGPUCompilationInfoRequestStatus = ::std::os::raw::c_uint;
pub const WGPUCompilationMessageType_Error: WGPUCompilationMessageType = 1;
pub const WGPUCompilationMessageType_Warning: WGPUCompilationMessageType = 2;
pub const WGPUCompilationMessageType_Info: WGPUCompilationMessageType = 3;
pub const WGPUCompilationMessageType_Force32: WGPUCompilationMessageType = 2147483647;
pub type WGPUCompilationMessageType = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Lets the WebGPU implementation choose the best mode (supported, and with the best performance) between @ref WGPUCompositeAlphaMode_Opaque or @ref WGPUCompositeAlphaMode_Inherit."]
pub const WGPUCompositeAlphaMode_Auto: WGPUCompositeAlphaMode = 0;
#[doc = " `0x00000001`.\n The alpha component of the image is ignored and teated as if it is always 1.0."]
pub const WGPUCompositeAlphaMode_Opaque: WGPUCompositeAlphaMode = 1;
#[doc = " `0x00000002`.\n The alpha component is respected and non-alpha components are assumed to be already multiplied with the alpha component. For example, (0.5, 0, 0, 0.5) is semi-transparent bright red."]
pub const WGPUCompositeAlphaMode_Premultiplied: WGPUCompositeAlphaMode = 2;
#[doc = " `0x00000003`.\n The alpha component is respected and non-alpha components are assumed to NOT be already multiplied with the alpha component. For example, (1.0, 0, 0, 0.5) is semi-transparent bright red."]
pub const WGPUCompositeAlphaMode_Unpremultiplied: WGPUCompositeAlphaMode = 3;
#[doc = " `0x00000004`.\n The handling of the alpha component is unknown to WebGPU and should be handled by the application using system-specific APIs. This mode may be unavailable (for example on Wasm)."]
pub const WGPUCompositeAlphaMode_Inherit: WGPUCompositeAlphaMode = 4;
#[doc = " `0x00000004`.\n The handling of the alpha component is unknown to WebGPU and should be handled by the application using system-specific APIs. This mode may be unavailable (for example on Wasm)."]
pub const WGPUCompositeAlphaMode_Force32: WGPUCompositeAlphaMode = 2147483647;
#[doc = " Describes how frames are composited with other contents on the screen when `::wgpuSurfacePresent` is called."]
pub type WGPUCompositeAlphaMode = ::std::os::raw::c_uint;
pub const WGPUCreatePipelineAsyncStatus_Success: WGPUCreatePipelineAsyncStatus = 1;
pub const WGPUCreatePipelineAsyncStatus_InstanceDropped: WGPUCreatePipelineAsyncStatus = 2;
pub const WGPUCreatePipelineAsyncStatus_ValidationError: WGPUCreatePipelineAsyncStatus = 3;
pub const WGPUCreatePipelineAsyncStatus_InternalError: WGPUCreatePipelineAsyncStatus = 4;
pub const WGPUCreatePipelineAsyncStatus_Unknown: WGPUCreatePipelineAsyncStatus = 5;
pub const WGPUCreatePipelineAsyncStatus_Force32: WGPUCreatePipelineAsyncStatus = 2147483647;
pub type WGPUCreatePipelineAsyncStatus = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCullMode_Undefined: WGPUCullMode = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCullMode_None: WGPUCullMode = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCullMode_Front: WGPUCullMode = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCullMode_Back: WGPUCullMode = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUCullMode_Force32: WGPUCullMode = 2147483647;
pub type WGPUCullMode = ::std::os::raw::c_uint;
pub const WGPUDeviceLostReason_Unknown: WGPUDeviceLostReason = 1;
pub const WGPUDeviceLostReason_Destroyed: WGPUDeviceLostReason = 2;
pub const WGPUDeviceLostReason_InstanceDropped: WGPUDeviceLostReason = 3;
pub const WGPUDeviceLostReason_FailedCreation: WGPUDeviceLostReason = 4;
pub const WGPUDeviceLostReason_Force32: WGPUDeviceLostReason = 2147483647;
pub type WGPUDeviceLostReason = ::std::os::raw::c_uint;
pub const WGPUErrorFilter_Validation: WGPUErrorFilter = 1;
pub const WGPUErrorFilter_OutOfMemory: WGPUErrorFilter = 2;
pub const WGPUErrorFilter_Internal: WGPUErrorFilter = 3;
pub const WGPUErrorFilter_Force32: WGPUErrorFilter = 2147483647;
pub type WGPUErrorFilter = ::std::os::raw::c_uint;
pub const WGPUErrorType_NoError: WGPUErrorType = 1;
pub const WGPUErrorType_Validation: WGPUErrorType = 2;
pub const WGPUErrorType_OutOfMemory: WGPUErrorType = 3;
pub const WGPUErrorType_Internal: WGPUErrorType = 4;
pub const WGPUErrorType_Unknown: WGPUErrorType = 5;
pub const WGPUErrorType_Force32: WGPUErrorType = 2147483647;
pub type WGPUErrorType = ::std::os::raw::c_uint;
#[doc = " `0x00000001`.\n \"Compatibility\" profile which can be supported on OpenGL ES 3.1."]
pub const WGPUFeatureLevel_Compatibility: WGPUFeatureLevel = 1;
#[doc = " `0x00000002`.\n \"Core\" profile which can be supported on Vulkan/Metal/D3D12."]
pub const WGPUFeatureLevel_Core: WGPUFeatureLevel = 2;
#[doc = " `0x00000002`.\n \"Core\" profile which can be supported on Vulkan/Metal/D3D12."]
pub const WGPUFeatureLevel_Force32: WGPUFeatureLevel = 2147483647;
#[doc = " See @ref WGPURequestAdapterOptions::featureLevel."]
pub type WGPUFeatureLevel = ::std::os::raw::c_uint;
pub const WGPUFeatureName_Undefined: WGPUFeatureName = 0;
pub const WGPUFeatureName_DepthClipControl: WGPUFeatureName = 1;
pub const WGPUFeatureName_Depth32FloatStencil8: WGPUFeatureName = 2;
pub const WGPUFeatureName_TimestampQuery: WGPUFeatureName = 3;
pub const WGPUFeatureName_TextureCompressionBC: WGPUFeatureName = 4;
pub const WGPUFeatureName_TextureCompressionBCSliced3D: WGPUFeatureName = 5;
pub const WGPUFeatureName_TextureCompressionETC2: WGPUFeatureName = 6;
pub const WGPUFeatureName_TextureCompressionASTC: WGPUFeatureName = 7;
pub const WGPUFeatureName_TextureCompressionASTCSliced3D: WGPUFeatureName = 8;
pub const WGPUFeatureName_IndirectFirstInstance: WGPUFeatureName = 9;
pub const WGPUFeatureName_ShaderF16: WGPUFeatureName = 10;
pub const WGPUFeatureName_RG11B10UfloatRenderable: WGPUFeatureName = 11;
pub const WGPUFeatureName_BGRA8UnormStorage: WGPUFeatureName = 12;
pub const WGPUFeatureName_Float32Filterable: WGPUFeatureName = 13;
pub const WGPUFeatureName_Float32Blendable: WGPUFeatureName = 14;
pub const WGPUFeatureName_ClipDistances: WGPUFeatureName = 15;
pub const WGPUFeatureName_DualSourceBlending: WGPUFeatureName = 16;
pub const WGPUFeatureName_Force32: WGPUFeatureName = 2147483647;
pub type WGPUFeatureName = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFilterMode_Undefined: WGPUFilterMode = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFilterMode_Nearest: WGPUFilterMode = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFilterMode_Linear: WGPUFilterMode = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFilterMode_Force32: WGPUFilterMode = 2147483647;
pub type WGPUFilterMode = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFrontFace_Undefined: WGPUFrontFace = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFrontFace_CCW: WGPUFrontFace = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFrontFace_CW: WGPUFrontFace = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUFrontFace_Force32: WGPUFrontFace = 2147483647;
pub type WGPUFrontFace = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUIndexFormat_Undefined: WGPUIndexFormat = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUIndexFormat_Uint16: WGPUIndexFormat = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUIndexFormat_Uint32: WGPUIndexFormat = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUIndexFormat_Force32: WGPUIndexFormat = 2147483647;
pub type WGPUIndexFormat = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPULoadOp_Undefined: WGPULoadOp = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPULoadOp_Load: WGPULoadOp = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPULoadOp_Clear: WGPULoadOp = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPULoadOp_Force32: WGPULoadOp = 2147483647;
pub type WGPULoadOp = ::std::os::raw::c_uint;
pub const WGPUMapAsyncStatus_Success: WGPUMapAsyncStatus = 1;
pub const WGPUMapAsyncStatus_InstanceDropped: WGPUMapAsyncStatus = 2;
pub const WGPUMapAsyncStatus_Error: WGPUMapAsyncStatus = 3;
pub const WGPUMapAsyncStatus_Aborted: WGPUMapAsyncStatus = 4;
pub const WGPUMapAsyncStatus_Unknown: WGPUMapAsyncStatus = 5;
pub const WGPUMapAsyncStatus_Force32: WGPUMapAsyncStatus = 2147483647;
pub type WGPUMapAsyncStatus = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUMipmapFilterMode_Undefined: WGPUMipmapFilterMode = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUMipmapFilterMode_Nearest: WGPUMipmapFilterMode = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUMipmapFilterMode_Linear: WGPUMipmapFilterMode = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUMipmapFilterMode_Force32: WGPUMipmapFilterMode = 2147483647;
pub type WGPUMipmapFilterMode = ::std::os::raw::c_uint;
pub const WGPUOptionalBool_False: WGPUOptionalBool = 0;
pub const WGPUOptionalBool_True: WGPUOptionalBool = 1;
pub const WGPUOptionalBool_Undefined: WGPUOptionalBool = 2;
pub const WGPUOptionalBool_Force32: WGPUOptionalBool = 2147483647;
pub type WGPUOptionalBool = ::std::os::raw::c_uint;
#[doc = " `0x00000001`.\n The error scope stack was successfully popped and a result was reported."]
pub const WGPUPopErrorScopeStatus_Success: WGPUPopErrorScopeStatus = 1;
#[doc = " `0x00000001`.\n The error scope stack was successfully popped and a result was reported."]
pub const WGPUPopErrorScopeStatus_InstanceDropped: WGPUPopErrorScopeStatus = 2;
#[doc = " `0x00000003`.\n The error scope stack could not be popped, because it was empty."]
pub const WGPUPopErrorScopeStatus_EmptyStack: WGPUPopErrorScopeStatus = 3;
#[doc = " `0x00000003`.\n The error scope stack could not be popped, because it was empty."]
pub const WGPUPopErrorScopeStatus_Force32: WGPUPopErrorScopeStatus = 2147483647;
pub type WGPUPopErrorScopeStatus = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n No preference. (See also @ref SentinelValues.)"]
pub const WGPUPowerPreference_Undefined: WGPUPowerPreference = 0;
#[doc = " `0x00000000`.\n No preference. (See also @ref SentinelValues.)"]
pub const WGPUPowerPreference_LowPower: WGPUPowerPreference = 1;
#[doc = " `0x00000000`.\n No preference. (See also @ref SentinelValues.)"]
pub const WGPUPowerPreference_HighPerformance: WGPUPowerPreference = 2;
#[doc = " `0x00000000`.\n No preference. (See also @ref SentinelValues.)"]
pub const WGPUPowerPreference_Force32: WGPUPowerPreference = 2147483647;
pub type WGPUPowerPreference = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Present mode is not specified. Use the default."]
pub const WGPUPresentMode_Undefined: WGPUPresentMode = 0;
#[doc = " `0x00000001`.\n The presentation of the image to the user waits for the next vertical blanking period to update in a first-in, first-out manner.\n Tearing cannot be observed and frame-loop will be limited to the display's refresh rate.\n This is the only mode that's always available."]
pub const WGPUPresentMode_Fifo: WGPUPresentMode = 1;
#[doc = " `0x00000002`.\n The presentation of the image to the user tries to wait for the next vertical blanking period but may decide to not wait if a frame is presented late.\n Tearing can sometimes be observed but late-frame don't produce a full-frame stutter in the presentation.\n This is still a first-in, first-out mechanism so a frame-loop will be limited to the display's refresh rate."]
pub const WGPUPresentMode_FifoRelaxed: WGPUPresentMode = 2;
#[doc = " `0x00000003`.\n The presentation of the image to the user is updated immediately without waiting for a vertical blank.\n Tearing can be observed but latency is minimized."]
pub const WGPUPresentMode_Immediate: WGPUPresentMode = 3;
#[doc = " `0x00000004`.\n The presentation of the image to the user waits for the next vertical blanking period to update to the latest provided image.\n Tearing cannot be observed and a frame-loop is not limited to the display's refresh rate."]
pub const WGPUPresentMode_Mailbox: WGPUPresentMode = 4;
#[doc = " `0x00000004`.\n The presentation of the image to the user waits for the next vertical blanking period to update to the latest provided image.\n Tearing cannot be observed and a frame-loop is not limited to the display's refresh rate."]
pub const WGPUPresentMode_Force32: WGPUPresentMode = 2147483647;
#[doc = " Describes when and in which order frames are presented on the screen when `::wgpuSurfacePresent` is called."]
pub type WGPUPresentMode = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_Undefined: WGPUPrimitiveTopology = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_PointList: WGPUPrimitiveTopology = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_LineList: WGPUPrimitiveTopology = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_LineStrip: WGPUPrimitiveTopology = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_TriangleList: WGPUPrimitiveTopology = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_TriangleStrip: WGPUPrimitiveTopology = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUPrimitiveTopology_Force32: WGPUPrimitiveTopology = 2147483647;
pub type WGPUPrimitiveTopology = ::std::os::raw::c_uint;
pub const WGPUQueryType_Occlusion: WGPUQueryType = 1;
pub const WGPUQueryType_Timestamp: WGPUQueryType = 2;
pub const WGPUQueryType_Force32: WGPUQueryType = 2147483647;
pub type WGPUQueryType = ::std::os::raw::c_uint;
pub const WGPUQueueWorkDoneStatus_Success: WGPUQueueWorkDoneStatus = 1;
pub const WGPUQueueWorkDoneStatus_InstanceDropped: WGPUQueueWorkDoneStatus = 2;
pub const WGPUQueueWorkDoneStatus_Error: WGPUQueueWorkDoneStatus = 3;
pub const WGPUQueueWorkDoneStatus_Unknown: WGPUQueueWorkDoneStatus = 4;
pub const WGPUQueueWorkDoneStatus_Force32: WGPUQueueWorkDoneStatus = 2147483647;
pub type WGPUQueueWorkDoneStatus = ::std::os::raw::c_uint;
pub const WGPURequestAdapterStatus_Success: WGPURequestAdapterStatus = 1;
pub const WGPURequestAdapterStatus_InstanceDropped: WGPURequestAdapterStatus = 2;
pub const WGPURequestAdapterStatus_Unavailable: WGPURequestAdapterStatus = 3;
pub const WGPURequestAdapterStatus_Error: WGPURequestAdapterStatus = 4;
pub const WGPURequestAdapterStatus_Unknown: WGPURequestAdapterStatus = 5;
pub const WGPURequestAdapterStatus_Force32: WGPURequestAdapterStatus = 2147483647;
pub type WGPURequestAdapterStatus = ::std::os::raw::c_uint;
pub const WGPURequestDeviceStatus_Success: WGPURequestDeviceStatus = 1;
pub const WGPURequestDeviceStatus_InstanceDropped: WGPURequestDeviceStatus = 2;
pub const WGPURequestDeviceStatus_Error: WGPURequestDeviceStatus = 3;
pub const WGPURequestDeviceStatus_Unknown: WGPURequestDeviceStatus = 4;
pub const WGPURequestDeviceStatus_Force32: WGPURequestDeviceStatus = 2147483647;
pub type WGPURequestDeviceStatus = ::std::os::raw::c_uint;
pub const WGPUSType_ShaderSourceSPIRV: WGPUSType = 1;
pub const WGPUSType_ShaderSourceWGSL: WGPUSType = 2;
pub const WGPUSType_RenderPassMaxDrawCount: WGPUSType = 3;
pub const WGPUSType_SurfaceSourceMetalLayer: WGPUSType = 4;
pub const WGPUSType_SurfaceSourceWindowsHWND: WGPUSType = 5;
pub const WGPUSType_SurfaceSourceXlibWindow: WGPUSType = 6;
pub const WGPUSType_SurfaceSourceWaylandSurface: WGPUSType = 7;
pub const WGPUSType_SurfaceSourceAndroidNativeWindow: WGPUSType = 8;
pub const WGPUSType_SurfaceSourceXCBWindow: WGPUSType = 9;
pub const WGPUSType_Force32: WGPUSType = 2147483647;
pub type WGPUSType = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates that this @ref WGPUSamplerBindingLayout member of\n its parent @ref WGPUBindGroupLayoutEntry is not used.\n (See also @ref SentinelValues.)"]
pub const WGPUSamplerBindingType_BindingNotUsed: WGPUSamplerBindingType = 0;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUSamplerBindingType_Undefined: WGPUSamplerBindingType = 1;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUSamplerBindingType_Filtering: WGPUSamplerBindingType = 2;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUSamplerBindingType_NonFiltering: WGPUSamplerBindingType = 3;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUSamplerBindingType_Comparison: WGPUSamplerBindingType = 4;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUSamplerBindingType_Force32: WGPUSamplerBindingType = 2147483647;
pub type WGPUSamplerBindingType = ::std::os::raw::c_uint;
pub const WGPUStatus_Success: WGPUStatus = 1;
pub const WGPUStatus_Error: WGPUStatus = 2;
pub const WGPUStatus_Force32: WGPUStatus = 2147483647;
#[doc = " Status code returned (synchronously) from many operations. Generally\n indicates an invalid input like an unknown enum value or @ref OutStructChainError.\n Read the function's documentation for specific error conditions."]
pub type WGPUStatus = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Undefined: WGPUStencilOperation = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Keep: WGPUStencilOperation = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Zero: WGPUStencilOperation = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Replace: WGPUStencilOperation = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Invert: WGPUStencilOperation = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_IncrementClamp: WGPUStencilOperation = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_DecrementClamp: WGPUStencilOperation = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_IncrementWrap: WGPUStencilOperation = 7;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_DecrementWrap: WGPUStencilOperation = 8;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStencilOperation_Force32: WGPUStencilOperation = 2147483647;
pub type WGPUStencilOperation = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates that this @ref WGPUStorageTextureBindingLayout member of\n its parent @ref WGPUBindGroupLayoutEntry is not used.\n (See also @ref SentinelValues.)"]
pub const WGPUStorageTextureAccess_BindingNotUsed: WGPUStorageTextureAccess = 0;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStorageTextureAccess_Undefined: WGPUStorageTextureAccess = 1;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStorageTextureAccess_WriteOnly: WGPUStorageTextureAccess = 2;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStorageTextureAccess_ReadOnly: WGPUStorageTextureAccess = 3;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStorageTextureAccess_ReadWrite: WGPUStorageTextureAccess = 4;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStorageTextureAccess_Force32: WGPUStorageTextureAccess = 2147483647;
pub type WGPUStorageTextureAccess = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStoreOp_Undefined: WGPUStoreOp = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStoreOp_Store: WGPUStoreOp = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStoreOp_Discard: WGPUStoreOp = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUStoreOp_Force32: WGPUStoreOp = 2147483647;
pub type WGPUStoreOp = ::std::os::raw::c_uint;
#[doc = " `0x00000001`.\n Yay! Everything is good and we can render this frame."]
pub const WGPUSurfaceGetCurrentTextureStatus_SuccessOptimal: WGPUSurfaceGetCurrentTextureStatus = 1;
#[doc = " `0x00000002`.\n Still OK - the surface can present the frame, but in a suboptimal way. The surface may need reconfiguration."]
pub const WGPUSurfaceGetCurrentTextureStatus_SuccessSuboptimal: WGPUSurfaceGetCurrentTextureStatus =
    2;
#[doc = " `0x00000003`.\n Some operation timed out while trying to acquire the frame."]
pub const WGPUSurfaceGetCurrentTextureStatus_Timeout: WGPUSurfaceGetCurrentTextureStatus = 3;
#[doc = " `0x00000004`.\n The surface is too different to be used, compared to when it was originally created."]
pub const WGPUSurfaceGetCurrentTextureStatus_Outdated: WGPUSurfaceGetCurrentTextureStatus = 4;
#[doc = " `0x00000005`.\n The connection to whatever owns the surface was lost."]
pub const WGPUSurfaceGetCurrentTextureStatus_Lost: WGPUSurfaceGetCurrentTextureStatus = 5;
#[doc = " `0x00000006`.\n The system ran out of memory."]
pub const WGPUSurfaceGetCurrentTextureStatus_OutOfMemory: WGPUSurfaceGetCurrentTextureStatus = 6;
#[doc = " `0x00000007`.\n The @ref WGPUDevice configured on the @ref WGPUSurface was lost."]
pub const WGPUSurfaceGetCurrentTextureStatus_DeviceLost: WGPUSurfaceGetCurrentTextureStatus = 7;
#[doc = " `0x00000008`.\n The surface is not configured, or there was an @ref OutStructChainError."]
pub const WGPUSurfaceGetCurrentTextureStatus_Error: WGPUSurfaceGetCurrentTextureStatus = 8;
#[doc = " `0x00000008`.\n The surface is not configured, or there was an @ref OutStructChainError."]
pub const WGPUSurfaceGetCurrentTextureStatus_Force32: WGPUSurfaceGetCurrentTextureStatus =
    2147483647;
#[doc = " The status enum for `::wgpuSurfaceGetCurrentTexture`."]
pub type WGPUSurfaceGetCurrentTextureStatus = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureAspect_Undefined: WGPUTextureAspect = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureAspect_All: WGPUTextureAspect = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureAspect_StencilOnly: WGPUTextureAspect = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureAspect_DepthOnly: WGPUTextureAspect = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureAspect_Force32: WGPUTextureAspect = 2147483647;
pub type WGPUTextureAspect = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureDimension_Undefined: WGPUTextureDimension = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureDimension_1D: WGPUTextureDimension = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureDimension_2D: WGPUTextureDimension = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureDimension_3D: WGPUTextureDimension = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureDimension_Force32: WGPUTextureDimension = 2147483647;
pub type WGPUTextureDimension = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Undefined: WGPUTextureFormat = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R8Unorm: WGPUTextureFormat = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R8Snorm: WGPUTextureFormat = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R8Uint: WGPUTextureFormat = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R8Sint: WGPUTextureFormat = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R16Uint: WGPUTextureFormat = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R16Sint: WGPUTextureFormat = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R16Float: WGPUTextureFormat = 7;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG8Unorm: WGPUTextureFormat = 8;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG8Snorm: WGPUTextureFormat = 9;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG8Uint: WGPUTextureFormat = 10;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG8Sint: WGPUTextureFormat = 11;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R32Float: WGPUTextureFormat = 12;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R32Uint: WGPUTextureFormat = 13;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_R32Sint: WGPUTextureFormat = 14;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG16Uint: WGPUTextureFormat = 15;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG16Sint: WGPUTextureFormat = 16;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG16Float: WGPUTextureFormat = 17;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA8Unorm: WGPUTextureFormat = 18;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA8UnormSrgb: WGPUTextureFormat = 19;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA8Snorm: WGPUTextureFormat = 20;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA8Uint: WGPUTextureFormat = 21;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA8Sint: WGPUTextureFormat = 22;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BGRA8Unorm: WGPUTextureFormat = 23;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BGRA8UnormSrgb: WGPUTextureFormat = 24;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGB10A2Uint: WGPUTextureFormat = 25;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGB10A2Unorm: WGPUTextureFormat = 26;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG11B10Ufloat: WGPUTextureFormat = 27;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGB9E5Ufloat: WGPUTextureFormat = 28;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG32Float: WGPUTextureFormat = 29;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG32Uint: WGPUTextureFormat = 30;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RG32Sint: WGPUTextureFormat = 31;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA16Uint: WGPUTextureFormat = 32;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA16Sint: WGPUTextureFormat = 33;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA16Float: WGPUTextureFormat = 34;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA32Float: WGPUTextureFormat = 35;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA32Uint: WGPUTextureFormat = 36;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_RGBA32Sint: WGPUTextureFormat = 37;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Stencil8: WGPUTextureFormat = 38;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Depth16Unorm: WGPUTextureFormat = 39;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Depth24Plus: WGPUTextureFormat = 40;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Depth24PlusStencil8: WGPUTextureFormat = 41;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Depth32Float: WGPUTextureFormat = 42;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Depth32FloatStencil8: WGPUTextureFormat = 43;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC1RGBAUnorm: WGPUTextureFormat = 44;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC1RGBAUnormSrgb: WGPUTextureFormat = 45;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC2RGBAUnorm: WGPUTextureFormat = 46;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC2RGBAUnormSrgb: WGPUTextureFormat = 47;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC3RGBAUnorm: WGPUTextureFormat = 48;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC3RGBAUnormSrgb: WGPUTextureFormat = 49;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC4RUnorm: WGPUTextureFormat = 50;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC4RSnorm: WGPUTextureFormat = 51;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC5RGUnorm: WGPUTextureFormat = 52;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC5RGSnorm: WGPUTextureFormat = 53;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC6HRGBUfloat: WGPUTextureFormat = 54;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC6HRGBFloat: WGPUTextureFormat = 55;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC7RGBAUnorm: WGPUTextureFormat = 56;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_BC7RGBAUnormSrgb: WGPUTextureFormat = 57;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGB8Unorm: WGPUTextureFormat = 58;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGB8UnormSrgb: WGPUTextureFormat = 59;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGB8A1Unorm: WGPUTextureFormat = 60;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGB8A1UnormSrgb: WGPUTextureFormat = 61;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGBA8Unorm: WGPUTextureFormat = 62;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ETC2RGBA8UnormSrgb: WGPUTextureFormat = 63;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_EACR11Unorm: WGPUTextureFormat = 64;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_EACR11Snorm: WGPUTextureFormat = 65;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_EACRG11Unorm: WGPUTextureFormat = 66;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_EACRG11Snorm: WGPUTextureFormat = 67;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC4x4Unorm: WGPUTextureFormat = 68;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC4x4UnormSrgb: WGPUTextureFormat = 69;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC5x4Unorm: WGPUTextureFormat = 70;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC5x4UnormSrgb: WGPUTextureFormat = 71;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC5x5Unorm: WGPUTextureFormat = 72;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC5x5UnormSrgb: WGPUTextureFormat = 73;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC6x5Unorm: WGPUTextureFormat = 74;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC6x5UnormSrgb: WGPUTextureFormat = 75;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC6x6Unorm: WGPUTextureFormat = 76;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC6x6UnormSrgb: WGPUTextureFormat = 77;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x5Unorm: WGPUTextureFormat = 78;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x5UnormSrgb: WGPUTextureFormat = 79;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x6Unorm: WGPUTextureFormat = 80;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x6UnormSrgb: WGPUTextureFormat = 81;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x8Unorm: WGPUTextureFormat = 82;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC8x8UnormSrgb: WGPUTextureFormat = 83;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x5Unorm: WGPUTextureFormat = 84;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x5UnormSrgb: WGPUTextureFormat = 85;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x6Unorm: WGPUTextureFormat = 86;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x6UnormSrgb: WGPUTextureFormat = 87;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x8Unorm: WGPUTextureFormat = 88;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x8UnormSrgb: WGPUTextureFormat = 89;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x10Unorm: WGPUTextureFormat = 90;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC10x10UnormSrgb: WGPUTextureFormat = 91;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC12x10Unorm: WGPUTextureFormat = 92;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC12x10UnormSrgb: WGPUTextureFormat = 93;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC12x12Unorm: WGPUTextureFormat = 94;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_ASTC12x12UnormSrgb: WGPUTextureFormat = 95;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureFormat_Force32: WGPUTextureFormat = 2147483647;
pub type WGPUTextureFormat = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates that this @ref WGPUTextureBindingLayout member of\n its parent @ref WGPUBindGroupLayoutEntry is not used.\n (See also @ref SentinelValues.)"]
pub const WGPUTextureSampleType_BindingNotUsed: WGPUTextureSampleType = 0;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Undefined: WGPUTextureSampleType = 1;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Float: WGPUTextureSampleType = 2;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_UnfilterableFloat: WGPUTextureSampleType = 3;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Depth: WGPUTextureSampleType = 4;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Sint: WGPUTextureSampleType = 5;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Uint: WGPUTextureSampleType = 6;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureSampleType_Force32: WGPUTextureSampleType = 2147483647;
pub type WGPUTextureSampleType = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_Undefined: WGPUTextureViewDimension = 0;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_1D: WGPUTextureViewDimension = 1;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_2D: WGPUTextureViewDimension = 2;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_2DArray: WGPUTextureViewDimension = 3;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_Cube: WGPUTextureViewDimension = 4;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_CubeArray: WGPUTextureViewDimension = 5;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_3D: WGPUTextureViewDimension = 6;
#[doc = " `0x00000000`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUTextureViewDimension_Force32: WGPUTextureViewDimension = 2147483647;
pub type WGPUTextureViewDimension = ::std::os::raw::c_uint;
pub const WGPUVertexFormat_Uint8: WGPUVertexFormat = 1;
pub const WGPUVertexFormat_Uint8x2: WGPUVertexFormat = 2;
pub const WGPUVertexFormat_Uint8x4: WGPUVertexFormat = 3;
pub const WGPUVertexFormat_Sint8: WGPUVertexFormat = 4;
pub const WGPUVertexFormat_Sint8x2: WGPUVertexFormat = 5;
pub const WGPUVertexFormat_Sint8x4: WGPUVertexFormat = 6;
pub const WGPUVertexFormat_Unorm8: WGPUVertexFormat = 7;
pub const WGPUVertexFormat_Unorm8x2: WGPUVertexFormat = 8;
pub const WGPUVertexFormat_Unorm8x4: WGPUVertexFormat = 9;
pub const WGPUVertexFormat_Snorm8: WGPUVertexFormat = 10;
pub const WGPUVertexFormat_Snorm8x2: WGPUVertexFormat = 11;
pub const WGPUVertexFormat_Snorm8x4: WGPUVertexFormat = 12;
pub const WGPUVertexFormat_Uint16: WGPUVertexFormat = 13;
pub const WGPUVertexFormat_Uint16x2: WGPUVertexFormat = 14;
pub const WGPUVertexFormat_Uint16x4: WGPUVertexFormat = 15;
pub const WGPUVertexFormat_Sint16: WGPUVertexFormat = 16;
pub const WGPUVertexFormat_Sint16x2: WGPUVertexFormat = 17;
pub const WGPUVertexFormat_Sint16x4: WGPUVertexFormat = 18;
pub const WGPUVertexFormat_Unorm16: WGPUVertexFormat = 19;
pub const WGPUVertexFormat_Unorm16x2: WGPUVertexFormat = 20;
pub const WGPUVertexFormat_Unorm16x4: WGPUVertexFormat = 21;
pub const WGPUVertexFormat_Snorm16: WGPUVertexFormat = 22;
pub const WGPUVertexFormat_Snorm16x2: WGPUVertexFormat = 23;
pub const WGPUVertexFormat_Snorm16x4: WGPUVertexFormat = 24;
pub const WGPUVertexFormat_Float16: WGPUVertexFormat = 25;
pub const WGPUVertexFormat_Float16x2: WGPUVertexFormat = 26;
pub const WGPUVertexFormat_Float16x4: WGPUVertexFormat = 27;
pub const WGPUVertexFormat_Float32: WGPUVertexFormat = 28;
pub const WGPUVertexFormat_Float32x2: WGPUVertexFormat = 29;
pub const WGPUVertexFormat_Float32x3: WGPUVertexFormat = 30;
pub const WGPUVertexFormat_Float32x4: WGPUVertexFormat = 31;
pub const WGPUVertexFormat_Uint32: WGPUVertexFormat = 32;
pub const WGPUVertexFormat_Uint32x2: WGPUVertexFormat = 33;
pub const WGPUVertexFormat_Uint32x3: WGPUVertexFormat = 34;
pub const WGPUVertexFormat_Uint32x4: WGPUVertexFormat = 35;
pub const WGPUVertexFormat_Sint32: WGPUVertexFormat = 36;
pub const WGPUVertexFormat_Sint32x2: WGPUVertexFormat = 37;
pub const WGPUVertexFormat_Sint32x3: WGPUVertexFormat = 38;
pub const WGPUVertexFormat_Sint32x4: WGPUVertexFormat = 39;
pub const WGPUVertexFormat_Unorm10_10_10_2: WGPUVertexFormat = 40;
pub const WGPUVertexFormat_Unorm8x4BGRA: WGPUVertexFormat = 41;
pub const WGPUVertexFormat_Force32: WGPUVertexFormat = 2147483647;
pub type WGPUVertexFormat = ::std::os::raw::c_uint;
#[doc = " `0x00000000`.\n This @ref WGPUVertexBufferLayout is a \"hole\" in the @ref WGPUVertexState `buffers` array.\n (See also @ref SentinelValues.)"]
pub const WGPUVertexStepMode_VertexBufferNotUsed: WGPUVertexStepMode = 0;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUVertexStepMode_Undefined: WGPUVertexStepMode = 1;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUVertexStepMode_Vertex: WGPUVertexStepMode = 2;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUVertexStepMode_Instance: WGPUVertexStepMode = 3;
#[doc = " `0x00000001`.\n Indicates no value is passed for this argument. See @ref SentinelValues."]
pub const WGPUVertexStepMode_Force32: WGPUVertexStepMode = 2147483647;
pub type WGPUVertexStepMode = ::std::os::raw::c_uint;
pub const WGPUWGSLLanguageFeatureName_ReadonlyAndReadwriteStorageTextures:
    WGPUWGSLLanguageFeatureName = 1;
pub const WGPUWGSLLanguageFeatureName_Packed4x8IntegerDotProduct: WGPUWGSLLanguageFeatureName = 2;
pub const WGPUWGSLLanguageFeatureName_UnrestrictedPointerParameters: WGPUWGSLLanguageFeatureName =
    3;
pub const WGPUWGSLLanguageFeatureName_PointerCompositeAccess: WGPUWGSLLanguageFeatureName = 4;
pub const WGPUWGSLLanguageFeatureName_Force32: WGPUWGSLLanguageFeatureName = 2147483647;
pub type WGPUWGSLLanguageFeatureName = ::std::os::raw::c_uint;
#[doc = " `0x00000001`.\n At least one WGPUFuture completed successfully."]
pub const WGPUWaitStatus_Success: WGPUWaitStatus = 1;
#[doc = " `0x00000002`.\n No WGPUFutures completed within the timeout."]
pub const WGPUWaitStatus_TimedOut: WGPUWaitStatus = 2;
#[doc = " `0x00000003`.\n A @ref Timed-Wait was performed when WGPUInstanceFeatures::timedWaitAnyEnable is false."]
pub const WGPUWaitStatus_UnsupportedTimeout: WGPUWaitStatus = 3;
#[doc = " `0x00000004`.\n The number of futures waited on in a @ref Timed-Wait is greater than the supported WGPUInstanceFeatures::timedWaitAnyMaxCount."]
pub const WGPUWaitStatus_UnsupportedCount: WGPUWaitStatus = 4;
#[doc = " `0x00000005`.\n An invalid wait was performed with @ref Mixed-Sources."]
pub const WGPUWaitStatus_UnsupportedMixedSources: WGPUWaitStatus = 5;
#[doc = " `0x00000005`.\n An invalid wait was performed with @ref Mixed-Sources."]
pub const WGPUWaitStatus_Force32: WGPUWaitStatus = 2147483647;
#[doc = " Status returned from a call to ::wgpuInstanceWaitAny."]
pub type WGPUWaitStatus = ::std::os::raw::c_uint;
#[doc = " \\defgroup Bitflags\n \\brief Type and constant definitions for bitflag types.\n\n @{"]
pub type WGPUBufferUsage = WGPUFlags;
pub const WGPUBufferUsage_None: WGPUBufferUsage = 0;
pub const WGPUBufferUsage_MapRead: WGPUBufferUsage = 1;
pub const WGPUBufferUsage_MapWrite: WGPUBufferUsage = 2;
pub const WGPUBufferUsage_CopySrc: WGPUBufferUsage = 4;
pub const WGPUBufferUsage_CopyDst: WGPUBufferUsage = 8;
pub const WGPUBufferUsage_Index: WGPUBufferUsage = 16;
pub const WGPUBufferUsage_Vertex: WGPUBufferUsage = 32;
pub const WGPUBufferUsage_Uniform: WGPUBufferUsage = 64;
pub const WGPUBufferUsage_Storage: WGPUBufferUsage = 128;
pub const WGPUBufferUsage_Indirect: WGPUBufferUsage = 256;
pub const WGPUBufferUsage_QueryResolve: WGPUBufferUsage = 512;
pub type WGPUColorWriteMask = WGPUFlags;
pub const WGPUColorWriteMask_None: WGPUColorWriteMask = 0;
pub const WGPUColorWriteMask_Red: WGPUColorWriteMask = 1;
pub const WGPUColorWriteMask_Green: WGPUColorWriteMask = 2;
pub const WGPUColorWriteMask_Blue: WGPUColorWriteMask = 4;
pub const WGPUColorWriteMask_Alpha: WGPUColorWriteMask = 8;
pub const WGPUColorWriteMask_All: WGPUColorWriteMask = 15;
pub type WGPUMapMode = WGPUFlags;
pub const WGPUMapMode_None: WGPUMapMode = 0;
pub const WGPUMapMode_Read: WGPUMapMode = 1;
pub const WGPUMapMode_Write: WGPUMapMode = 2;
pub type WGPUShaderStage = WGPUFlags;
pub const WGPUShaderStage_None: WGPUShaderStage = 0;
pub const WGPUShaderStage_Vertex: WGPUShaderStage = 1;
pub const WGPUShaderStage_Fragment: WGPUShaderStage = 2;
pub const WGPUShaderStage_Compute: WGPUShaderStage = 4;
pub type WGPUTextureUsage = WGPUFlags;
pub const WGPUTextureUsage_None: WGPUTextureUsage = 0;
pub const WGPUTextureUsage_CopySrc: WGPUTextureUsage = 1;
pub const WGPUTextureUsage_CopyDst: WGPUTextureUsage = 2;
pub const WGPUTextureUsage_TextureBinding: WGPUTextureUsage = 4;
pub const WGPUTextureUsage_StorageBinding: WGPUTextureUsage = 8;
pub const WGPUTextureUsage_RenderAttachment: WGPUTextureUsage = 16;
#[doc = " @}"]
pub type WGPUProc = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " \\defgroup Callbacks\n \\brief Callbacks through which asynchronous functions return.\n\n @{\n/\n/**\n @param message\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPUBufferMapCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUMapAsyncStatus,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param compilationInfo\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPUCompilationInfoCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUCompilationInfoRequestStatus,
        compilationInfo: *const WGPUCompilationInfo,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param pipeline\n This parameter is @ref PassedWithOwnership."]
pub type WGPUCreateComputePipelineAsyncCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUCreatePipelineAsyncStatus,
        pipeline: WGPUComputePipeline,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param pipeline\n This parameter is @ref PassedWithOwnership."]
pub type WGPUCreateRenderPipelineAsyncCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUCreatePipelineAsyncStatus,
        pipeline: WGPURenderPipeline,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param device\n Reference to the device which was lost. If, and only if, the `reason` is @ref WGPUDeviceLostReason_FailedCreation, this is a non-null pointer to a null @ref WGPUDevice.\n This parameter is @ref PassedWithoutOwnership.\n\n @param message\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPUDeviceLostCallback = ::std::option::Option<
    unsafe extern "C" fn(
        device: *const WGPUDevice,
        reason: WGPUDeviceLostReason,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param status\n See @ref WGPUPopErrorScopeStatus.\n\n @param type\n The type of the error caught by the scope, or @ref WGPUErrorType_NoError if there was none.\n If the `status` is not @ref WGPUPopErrorScopeStatus_Success, this is @ref WGPUErrorType_NoError.\n\n @param message\n If the `type` is not @ref WGPUErrorType_NoError, this is a non-empty @ref LocalizableHumanReadableMessageString;\n otherwise, this is an empty string.\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPUPopErrorScopeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUPopErrorScopeStatus,
        type_: WGPUErrorType,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
pub type WGPUQueueWorkDoneCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPUQueueWorkDoneStatus,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param adapter\n This parameter is @ref PassedWithOwnership.\n\n @param message\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPURequestAdapterCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPURequestAdapterStatus,
        adapter: WGPUAdapter,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param device\n This parameter is @ref PassedWithOwnership.\n\n @param message\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPURequestDeviceCallback = ::std::option::Option<
    unsafe extern "C" fn(
        status: WGPURequestDeviceStatus,
        device: WGPUDevice,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @param device\n This parameter is @ref PassedWithoutOwnership.\n\n @param message\n This parameter is @ref PassedWithoutOwnership."]
pub type WGPUUncapturedErrorCallback = ::std::option::Option<
    unsafe extern "C" fn(
        device: *const WGPUDevice,
        type_: WGPUErrorType,
        message: WGPUStringView,
        userdata1: *mut ::std::os::raw::c_void,
        userdata2: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @} */\n/**\n \\defgroup ChainedStructures Chained Structures\n \\brief Structures used to extend descriptors.\n\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUChainedStruct {
    pub next: *const WGPUChainedStruct,
    pub sType: WGPUSType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUChainedStruct"][::std::mem::size_of::<WGPUChainedStruct>() - 16usize];
    ["Alignment of WGPUChainedStruct"][::std::mem::align_of::<WGPUChainedStruct>() - 8usize];
    ["Offset of field: WGPUChainedStruct::next"]
        [::std::mem::offset_of!(WGPUChainedStruct, next) - 0usize];
    ["Offset of field: WGPUChainedStruct::sType"]
        [::std::mem::offset_of!(WGPUChainedStruct, sType) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUChainedStructOut {
    pub next: *mut WGPUChainedStructOut,
    pub sType: WGPUSType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUChainedStructOut"][::std::mem::size_of::<WGPUChainedStructOut>() - 16usize];
    ["Alignment of WGPUChainedStructOut"][::std::mem::align_of::<WGPUChainedStructOut>() - 8usize];
    ["Offset of field: WGPUChainedStructOut::next"]
        [::std::mem::offset_of!(WGPUChainedStructOut, next) - 0usize];
    ["Offset of field: WGPUChainedStructOut::sType"]
        [::std::mem::offset_of!(WGPUChainedStructOut, sType) - 8usize];
};
#[doc = " \\defgroup WGPUCallbackInfo\n \\brief Callback info structures that are used in asynchronous functions.\n\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferMapCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUBufferMapCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferMapCallbackInfo"]
        [::std::mem::size_of::<WGPUBufferMapCallbackInfo>() - 40usize];
    ["Alignment of WGPUBufferMapCallbackInfo"]
        [::std::mem::align_of::<WGPUBufferMapCallbackInfo>() - 8usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUBufferMapCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUBufferMapCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUBufferMapCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUBufferMapCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUBufferMapCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUBufferMapCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompilationInfoCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCompilationInfoCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompilationInfoCallbackInfo"]
        [::std::mem::size_of::<WGPUCompilationInfoCallbackInfo>() - 40usize];
    ["Alignment of WGPUCompilationInfoCallbackInfo"]
        [::std::mem::align_of::<WGPUCompilationInfoCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUCompilationInfoCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUCompilationInfoCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUCompilationInfoCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUCompilationInfoCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCompilationInfoCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUCompilationInfoCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCreateComputePipelineAsyncCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCreateComputePipelineAsyncCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCreateComputePipelineAsyncCallbackInfo"]
        [::std::mem::size_of::<WGPUCreateComputePipelineAsyncCallbackInfo>() - 40usize];
    ["Alignment of WGPUCreateComputePipelineAsyncCallbackInfo"]
        [::std::mem::align_of::<WGPUCreateComputePipelineAsyncCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCreateComputePipelineAsyncCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUCreateComputePipelineAsyncCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCreateRenderPipelineAsyncCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUCreateRenderPipelineAsyncCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCreateRenderPipelineAsyncCallbackInfo"]
        [::std::mem::size_of::<WGPUCreateRenderPipelineAsyncCallbackInfo>() - 40usize];
    ["Alignment of WGPUCreateRenderPipelineAsyncCallbackInfo"]
        [::std::mem::align_of::<WGPUCreateRenderPipelineAsyncCallbackInfo>() - 8usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUCreateRenderPipelineAsyncCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUCreateRenderPipelineAsyncCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceLostCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUDeviceLostCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDeviceLostCallbackInfo"]
        [::std::mem::size_of::<WGPUDeviceLostCallbackInfo>() - 40usize];
    ["Alignment of WGPUDeviceLostCallbackInfo"]
        [::std::mem::align_of::<WGPUDeviceLostCallbackInfo>() - 8usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUDeviceLostCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUDeviceLostCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUDeviceLostCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUDeviceLostCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUDeviceLostCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUDeviceLostCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPopErrorScopeCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUPopErrorScopeCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPopErrorScopeCallbackInfo"]
        [::std::mem::size_of::<WGPUPopErrorScopeCallbackInfo>() - 40usize];
    ["Alignment of WGPUPopErrorScopeCallbackInfo"]
        [::std::mem::align_of::<WGPUPopErrorScopeCallbackInfo>() - 8usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUPopErrorScopeCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUPopErrorScopeCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQueueWorkDoneCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPUQueueWorkDoneCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQueueWorkDoneCallbackInfo"]
        [::std::mem::size_of::<WGPUQueueWorkDoneCallbackInfo>() - 40usize];
    ["Alignment of WGPUQueueWorkDoneCallbackInfo"]
        [::std::mem::align_of::<WGPUQueueWorkDoneCallbackInfo>() - 8usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPUQueueWorkDoneCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUQueueWorkDoneCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestAdapterCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPURequestAdapterCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterCallbackInfo"]
        [::std::mem::size_of::<WGPURequestAdapterCallbackInfo>() - 40usize];
    ["Alignment of WGPURequestAdapterCallbackInfo"]
        [::std::mem::align_of::<WGPURequestAdapterCallbackInfo>() - 8usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPURequestAdapterCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPURequestAdapterCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPURequestAdapterCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPURequestAdapterCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPURequestAdapterCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPURequestAdapterCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURequestDeviceCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub mode: WGPUCallbackMode,
    pub callback: WGPURequestDeviceCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestDeviceCallbackInfo"]
        [::std::mem::size_of::<WGPURequestDeviceCallbackInfo>() - 40usize];
    ["Alignment of WGPURequestDeviceCallbackInfo"]
        [::std::mem::align_of::<WGPURequestDeviceCallbackInfo>() - 8usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPURequestDeviceCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::mode"]
        [::std::mem::offset_of!(WGPURequestDeviceCallbackInfo, mode) - 8usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPURequestDeviceCallbackInfo, callback) - 16usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPURequestDeviceCallbackInfo, userdata1) - 24usize];
    ["Offset of field: WGPURequestDeviceCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPURequestDeviceCallbackInfo, userdata2) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUUncapturedErrorCallbackInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub callback: WGPUUncapturedErrorCallback,
    pub userdata1: *mut ::std::os::raw::c_void,
    pub userdata2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUUncapturedErrorCallbackInfo"]
        [::std::mem::size_of::<WGPUUncapturedErrorCallbackInfo>() - 32usize];
    ["Alignment of WGPUUncapturedErrorCallbackInfo"]
        [::std::mem::align_of::<WGPUUncapturedErrorCallbackInfo>() - 8usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::callback"]
        [::std::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, callback) - 8usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::userdata1"]
        [::std::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, userdata1) - 16usize];
    ["Offset of field: WGPUUncapturedErrorCallbackInfo::userdata2"]
        [::std::mem::offset_of!(WGPUUncapturedErrorCallbackInfo, userdata2) - 24usize];
};
#[doc = " @}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterInfo {
    pub nextInChain: *mut WGPUChainedStructOut,
    #[doc = " This is an \\ref OutputString."]
    pub vendor: WGPUStringView,
    #[doc = " This is an \\ref OutputString."]
    pub architecture: WGPUStringView,
    #[doc = " This is an \\ref OutputString."]
    pub device: WGPUStringView,
    #[doc = " This is an \\ref OutputString."]
    pub description: WGPUStringView,
    pub backendType: WGPUBackendType,
    pub adapterType: WGPUAdapterType,
    pub vendorID: u32,
    pub deviceID: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUAdapterInfo"][::std::mem::size_of::<WGPUAdapterInfo>() - 88usize];
    ["Alignment of WGPUAdapterInfo"][::std::mem::align_of::<WGPUAdapterInfo>() - 8usize];
    ["Offset of field: WGPUAdapterInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUAdapterInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUAdapterInfo::vendor"]
        [::std::mem::offset_of!(WGPUAdapterInfo, vendor) - 8usize];
    ["Offset of field: WGPUAdapterInfo::architecture"]
        [::std::mem::offset_of!(WGPUAdapterInfo, architecture) - 24usize];
    ["Offset of field: WGPUAdapterInfo::device"]
        [::std::mem::offset_of!(WGPUAdapterInfo, device) - 40usize];
    ["Offset of field: WGPUAdapterInfo::description"]
        [::std::mem::offset_of!(WGPUAdapterInfo, description) - 56usize];
    ["Offset of field: WGPUAdapterInfo::backendType"]
        [::std::mem::offset_of!(WGPUAdapterInfo, backendType) - 72usize];
    ["Offset of field: WGPUAdapterInfo::adapterType"]
        [::std::mem::offset_of!(WGPUAdapterInfo, adapterType) - 76usize];
    ["Offset of field: WGPUAdapterInfo::vendorID"]
        [::std::mem::offset_of!(WGPUAdapterInfo, vendorID) - 80usize];
    ["Offset of field: WGPUAdapterInfo::deviceID"]
        [::std::mem::offset_of!(WGPUAdapterInfo, deviceID) - 84usize];
};
#[repr(C)]
pub struct WGPUBindGroupEntry {
    pub nextInChain: *const WGPUChainedStruct,
    pub binding: u32,
    pub buffer: WGPUBuffer,
    pub offset: u64,
    pub size: u64,
    pub sampler: WGPUSampler,
    pub textureView: WGPUTextureView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupEntry"][::std::mem::size_of::<WGPUBindGroupEntry>() - 56usize];
    ["Alignment of WGPUBindGroupEntry"][::std::mem::align_of::<WGPUBindGroupEntry>() - 8usize];
    ["Offset of field: WGPUBindGroupEntry::nextInChain"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupEntry::binding"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, binding) - 8usize];
    ["Offset of field: WGPUBindGroupEntry::buffer"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, buffer) - 16usize];
    ["Offset of field: WGPUBindGroupEntry::offset"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, offset) - 24usize];
    ["Offset of field: WGPUBindGroupEntry::size"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, size) - 32usize];
    ["Offset of field: WGPUBindGroupEntry::sampler"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, sampler) - 40usize];
    ["Offset of field: WGPUBindGroupEntry::textureView"]
        [::std::mem::offset_of!(WGPUBindGroupEntry, textureView) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBlendComponent {
    pub operation: WGPUBlendOperation,
    pub srcFactor: WGPUBlendFactor,
    pub dstFactor: WGPUBlendFactor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBlendComponent"][::std::mem::size_of::<WGPUBlendComponent>() - 12usize];
    ["Alignment of WGPUBlendComponent"][::std::mem::align_of::<WGPUBlendComponent>() - 4usize];
    ["Offset of field: WGPUBlendComponent::operation"]
        [::std::mem::offset_of!(WGPUBlendComponent, operation) - 0usize];
    ["Offset of field: WGPUBlendComponent::srcFactor"]
        [::std::mem::offset_of!(WGPUBlendComponent, srcFactor) - 4usize];
    ["Offset of field: WGPUBlendComponent::dstFactor"]
        [::std::mem::offset_of!(WGPUBlendComponent, dstFactor) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferBindingLayout {
    pub nextInChain: *const WGPUChainedStruct,
    pub type_: WGPUBufferBindingType,
    pub hasDynamicOffset: WGPUBool,
    pub minBindingSize: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferBindingLayout"][::std::mem::size_of::<WGPUBufferBindingLayout>() - 24usize];
    ["Alignment of WGPUBufferBindingLayout"]
        [::std::mem::align_of::<WGPUBufferBindingLayout>() - 8usize];
    ["Offset of field: WGPUBufferBindingLayout::nextInChain"]
        [::std::mem::offset_of!(WGPUBufferBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferBindingLayout::type_"]
        [::std::mem::offset_of!(WGPUBufferBindingLayout, type_) - 8usize];
    ["Offset of field: WGPUBufferBindingLayout::hasDynamicOffset"]
        [::std::mem::offset_of!(WGPUBufferBindingLayout, hasDynamicOffset) - 12usize];
    ["Offset of field: WGPUBufferBindingLayout::minBindingSize"]
        [::std::mem::offset_of!(WGPUBufferBindingLayout, minBindingSize) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub usage: WGPUBufferUsage,
    pub size: u64,
    pub mappedAtCreation: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBufferDescriptor"][::std::mem::size_of::<WGPUBufferDescriptor>() - 48usize];
    ["Alignment of WGPUBufferDescriptor"][::std::mem::align_of::<WGPUBufferDescriptor>() - 8usize];
    ["Offset of field: WGPUBufferDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUBufferDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUBufferDescriptor::label"]
        [::std::mem::offset_of!(WGPUBufferDescriptor, label) - 8usize];
    ["Offset of field: WGPUBufferDescriptor::usage"]
        [::std::mem::offset_of!(WGPUBufferDescriptor, usage) - 24usize];
    ["Offset of field: WGPUBufferDescriptor::size"]
        [::std::mem::offset_of!(WGPUBufferDescriptor, size) - 32usize];
    ["Offset of field: WGPUBufferDescriptor::mappedAtCreation"]
        [::std::mem::offset_of!(WGPUBufferDescriptor, mappedAtCreation) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColor {
    pub r: f64,
    pub g: f64,
    pub b: f64,
    pub a: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUColor"][::std::mem::size_of::<WGPUColor>() - 32usize];
    ["Alignment of WGPUColor"][::std::mem::align_of::<WGPUColor>() - 8usize];
    ["Offset of field: WGPUColor::r"][::std::mem::offset_of!(WGPUColor, r) - 0usize];
    ["Offset of field: WGPUColor::g"][::std::mem::offset_of!(WGPUColor, g) - 8usize];
    ["Offset of field: WGPUColor::b"][::std::mem::offset_of!(WGPUColor, b) - 16usize];
    ["Offset of field: WGPUColor::a"][::std::mem::offset_of!(WGPUColor, a) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandBufferDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCommandBufferDescriptor"]
        [::std::mem::size_of::<WGPUCommandBufferDescriptor>() - 24usize];
    ["Alignment of WGPUCommandBufferDescriptor"]
        [::std::mem::align_of::<WGPUCommandBufferDescriptor>() - 8usize];
    ["Offset of field: WGPUCommandBufferDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUCommandBufferDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUCommandBufferDescriptor::label"]
        [::std::mem::offset_of!(WGPUCommandBufferDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandEncoderDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCommandEncoderDescriptor"]
        [::std::mem::size_of::<WGPUCommandEncoderDescriptor>() - 24usize];
    ["Alignment of WGPUCommandEncoderDescriptor"]
        [::std::mem::align_of::<WGPUCommandEncoderDescriptor>() - 8usize];
    ["Offset of field: WGPUCommandEncoderDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUCommandEncoderDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUCommandEncoderDescriptor::label"]
        [::std::mem::offset_of!(WGPUCommandEncoderDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompilationMessage {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " A @ref LocalizableHumanReadableMessageString.\n\n This is an \\ref OutputString."]
    pub message: WGPUStringView,
    #[doc = " Severity level of the message."]
    pub type_: WGPUCompilationMessageType,
    #[doc = " Line number where the message is attached, starting at 1."]
    pub lineNum: u64,
    #[doc = " Offset in UTF-8 code units (bytes) from the beginning of the line, starting at 1."]
    pub linePos: u64,
    #[doc = " Offset in UTF-8 code units (bytes) from the beginning of the shader code, starting at 0."]
    pub offset: u64,
    #[doc = " Length in UTF-8 code units (bytes) of the span the message corresponds to."]
    pub length: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompilationMessage"][::std::mem::size_of::<WGPUCompilationMessage>() - 64usize];
    ["Alignment of WGPUCompilationMessage"]
        [::std::mem::align_of::<WGPUCompilationMessage>() - 8usize];
    ["Offset of field: WGPUCompilationMessage::nextInChain"]
        [::std::mem::offset_of!(WGPUCompilationMessage, nextInChain) - 0usize];
    ["Offset of field: WGPUCompilationMessage::message"]
        [::std::mem::offset_of!(WGPUCompilationMessage, message) - 8usize];
    ["Offset of field: WGPUCompilationMessage::type_"]
        [::std::mem::offset_of!(WGPUCompilationMessage, type_) - 24usize];
    ["Offset of field: WGPUCompilationMessage::lineNum"]
        [::std::mem::offset_of!(WGPUCompilationMessage, lineNum) - 32usize];
    ["Offset of field: WGPUCompilationMessage::linePos"]
        [::std::mem::offset_of!(WGPUCompilationMessage, linePos) - 40usize];
    ["Offset of field: WGPUCompilationMessage::offset"]
        [::std::mem::offset_of!(WGPUCompilationMessage, offset) - 48usize];
    ["Offset of field: WGPUCompilationMessage::length"]
        [::std::mem::offset_of!(WGPUCompilationMessage, length) - 56usize];
};
#[repr(C)]
pub struct WGPUComputePassTimestampWrites {
    pub querySet: WGPUQuerySet,
    pub beginningOfPassWriteIndex: u32,
    pub endOfPassWriteIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUComputePassTimestampWrites"]
        [::std::mem::size_of::<WGPUComputePassTimestampWrites>() - 16usize];
    ["Alignment of WGPUComputePassTimestampWrites"]
        [::std::mem::align_of::<WGPUComputePassTimestampWrites>() - 8usize];
    ["Offset of field: WGPUComputePassTimestampWrites::querySet"]
        [::std::mem::offset_of!(WGPUComputePassTimestampWrites, querySet) - 0usize];
    ["Offset of field: WGPUComputePassTimestampWrites::beginningOfPassWriteIndex"][::std::mem::offset_of!(
        WGPUComputePassTimestampWrites,
        beginningOfPassWriteIndex
    ) - 8usize];
    ["Offset of field: WGPUComputePassTimestampWrites::endOfPassWriteIndex"]
        [::std::mem::offset_of!(WGPUComputePassTimestampWrites, endOfPassWriteIndex) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUConstantEntry {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub key: WGPUStringView,
    pub value: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUConstantEntry"][::std::mem::size_of::<WGPUConstantEntry>() - 32usize];
    ["Alignment of WGPUConstantEntry"][::std::mem::align_of::<WGPUConstantEntry>() - 8usize];
    ["Offset of field: WGPUConstantEntry::nextInChain"]
        [::std::mem::offset_of!(WGPUConstantEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUConstantEntry::key"]
        [::std::mem::offset_of!(WGPUConstantEntry, key) - 8usize];
    ["Offset of field: WGPUConstantEntry::value"]
        [::std::mem::offset_of!(WGPUConstantEntry, value) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExtent3D {
    pub width: u32,
    pub height: u32,
    pub depthOrArrayLayers: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUExtent3D"][::std::mem::size_of::<WGPUExtent3D>() - 12usize];
    ["Alignment of WGPUExtent3D"][::std::mem::align_of::<WGPUExtent3D>() - 4usize];
    ["Offset of field: WGPUExtent3D::width"][::std::mem::offset_of!(WGPUExtent3D, width) - 0usize];
    ["Offset of field: WGPUExtent3D::height"]
        [::std::mem::offset_of!(WGPUExtent3D, height) - 4usize];
    ["Offset of field: WGPUExtent3D::depthOrArrayLayers"]
        [::std::mem::offset_of!(WGPUExtent3D, depthOrArrayLayers) - 8usize];
};
#[doc = " Opaque handle to an asynchronous operation. See @ref Asynchronous-Operations for more information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFuture {
    #[doc = " Opaque id of the @ref WGPUFuture"]
    pub id: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUFuture"][::std::mem::size_of::<WGPUFuture>() - 8usize];
    ["Alignment of WGPUFuture"][::std::mem::align_of::<WGPUFuture>() - 8usize];
    ["Offset of field: WGPUFuture::id"][::std::mem::offset_of!(WGPUFuture, id) - 0usize];
};
#[doc = " Features enabled on the WGPUInstance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceCapabilities {
    #[doc = " This struct chain is used as mutable in some places and immutable in others."]
    pub nextInChain: *mut WGPUChainedStructOut,
    #[doc = " Enable use of ::wgpuInstanceWaitAny with `timeoutNS > 0`."]
    pub timedWaitAnyEnable: WGPUBool,
    #[doc = " The maximum number @ref WGPUFutureWaitInfo supported in a call to ::wgpuInstanceWaitAny with `timeoutNS > 0`."]
    pub timedWaitAnyMaxCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceCapabilities"]
        [::std::mem::size_of::<WGPUInstanceCapabilities>() - 24usize];
    ["Alignment of WGPUInstanceCapabilities"]
        [::std::mem::align_of::<WGPUInstanceCapabilities>() - 8usize];
    ["Offset of field: WGPUInstanceCapabilities::nextInChain"]
        [::std::mem::offset_of!(WGPUInstanceCapabilities, nextInChain) - 0usize];
    ["Offset of field: WGPUInstanceCapabilities::timedWaitAnyEnable"]
        [::std::mem::offset_of!(WGPUInstanceCapabilities, timedWaitAnyEnable) - 8usize];
    ["Offset of field: WGPUInstanceCapabilities::timedWaitAnyMaxCount"]
        [::std::mem::offset_of!(WGPUInstanceCapabilities, timedWaitAnyMaxCount) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPULimits {
    #[doc = " This struct chain is used as mutable in some places and immutable in others."]
    pub nextInChain: *mut WGPUChainedStructOut,
    pub maxTextureDimension1D: u32,
    pub maxTextureDimension2D: u32,
    pub maxTextureDimension3D: u32,
    pub maxTextureArrayLayers: u32,
    pub maxBindGroups: u32,
    pub maxBindGroupsPlusVertexBuffers: u32,
    pub maxBindingsPerBindGroup: u32,
    pub maxDynamicUniformBuffersPerPipelineLayout: u32,
    pub maxDynamicStorageBuffersPerPipelineLayout: u32,
    pub maxSampledTexturesPerShaderStage: u32,
    pub maxSamplersPerShaderStage: u32,
    pub maxStorageBuffersPerShaderStage: u32,
    pub maxStorageTexturesPerShaderStage: u32,
    pub maxUniformBuffersPerShaderStage: u32,
    pub maxUniformBufferBindingSize: u64,
    pub maxStorageBufferBindingSize: u64,
    pub minUniformBufferOffsetAlignment: u32,
    pub minStorageBufferOffsetAlignment: u32,
    pub maxVertexBuffers: u32,
    pub maxBufferSize: u64,
    pub maxVertexAttributes: u32,
    pub maxVertexBufferArrayStride: u32,
    pub maxInterStageShaderVariables: u32,
    pub maxColorAttachments: u32,
    pub maxColorAttachmentBytesPerSample: u32,
    pub maxComputeWorkgroupStorageSize: u32,
    pub maxComputeInvocationsPerWorkgroup: u32,
    pub maxComputeWorkgroupSizeX: u32,
    pub maxComputeWorkgroupSizeY: u32,
    pub maxComputeWorkgroupSizeZ: u32,
    pub maxComputeWorkgroupsPerDimension: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPULimits"][::std::mem::size_of::<WGPULimits>() - 152usize];
    ["Alignment of WGPULimits"][::std::mem::align_of::<WGPULimits>() - 8usize];
    ["Offset of field: WGPULimits::nextInChain"]
        [::std::mem::offset_of!(WGPULimits, nextInChain) - 0usize];
    ["Offset of field: WGPULimits::maxTextureDimension1D"]
        [::std::mem::offset_of!(WGPULimits, maxTextureDimension1D) - 8usize];
    ["Offset of field: WGPULimits::maxTextureDimension2D"]
        [::std::mem::offset_of!(WGPULimits, maxTextureDimension2D) - 12usize];
    ["Offset of field: WGPULimits::maxTextureDimension3D"]
        [::std::mem::offset_of!(WGPULimits, maxTextureDimension3D) - 16usize];
    ["Offset of field: WGPULimits::maxTextureArrayLayers"]
        [::std::mem::offset_of!(WGPULimits, maxTextureArrayLayers) - 20usize];
    ["Offset of field: WGPULimits::maxBindGroups"]
        [::std::mem::offset_of!(WGPULimits, maxBindGroups) - 24usize];
    ["Offset of field: WGPULimits::maxBindGroupsPlusVertexBuffers"]
        [::std::mem::offset_of!(WGPULimits, maxBindGroupsPlusVertexBuffers) - 28usize];
    ["Offset of field: WGPULimits::maxBindingsPerBindGroup"]
        [::std::mem::offset_of!(WGPULimits, maxBindingsPerBindGroup) - 32usize];
    ["Offset of field: WGPULimits::maxDynamicUniformBuffersPerPipelineLayout"]
        [::std::mem::offset_of!(WGPULimits, maxDynamicUniformBuffersPerPipelineLayout) - 36usize];
    ["Offset of field: WGPULimits::maxDynamicStorageBuffersPerPipelineLayout"]
        [::std::mem::offset_of!(WGPULimits, maxDynamicStorageBuffersPerPipelineLayout) - 40usize];
    ["Offset of field: WGPULimits::maxSampledTexturesPerShaderStage"]
        [::std::mem::offset_of!(WGPULimits, maxSampledTexturesPerShaderStage) - 44usize];
    ["Offset of field: WGPULimits::maxSamplersPerShaderStage"]
        [::std::mem::offset_of!(WGPULimits, maxSamplersPerShaderStage) - 48usize];
    ["Offset of field: WGPULimits::maxStorageBuffersPerShaderStage"]
        [::std::mem::offset_of!(WGPULimits, maxStorageBuffersPerShaderStage) - 52usize];
    ["Offset of field: WGPULimits::maxStorageTexturesPerShaderStage"]
        [::std::mem::offset_of!(WGPULimits, maxStorageTexturesPerShaderStage) - 56usize];
    ["Offset of field: WGPULimits::maxUniformBuffersPerShaderStage"]
        [::std::mem::offset_of!(WGPULimits, maxUniformBuffersPerShaderStage) - 60usize];
    ["Offset of field: WGPULimits::maxUniformBufferBindingSize"]
        [::std::mem::offset_of!(WGPULimits, maxUniformBufferBindingSize) - 64usize];
    ["Offset of field: WGPULimits::maxStorageBufferBindingSize"]
        [::std::mem::offset_of!(WGPULimits, maxStorageBufferBindingSize) - 72usize];
    ["Offset of field: WGPULimits::minUniformBufferOffsetAlignment"]
        [::std::mem::offset_of!(WGPULimits, minUniformBufferOffsetAlignment) - 80usize];
    ["Offset of field: WGPULimits::minStorageBufferOffsetAlignment"]
        [::std::mem::offset_of!(WGPULimits, minStorageBufferOffsetAlignment) - 84usize];
    ["Offset of field: WGPULimits::maxVertexBuffers"]
        [::std::mem::offset_of!(WGPULimits, maxVertexBuffers) - 88usize];
    ["Offset of field: WGPULimits::maxBufferSize"]
        [::std::mem::offset_of!(WGPULimits, maxBufferSize) - 96usize];
    ["Offset of field: WGPULimits::maxVertexAttributes"]
        [::std::mem::offset_of!(WGPULimits, maxVertexAttributes) - 104usize];
    ["Offset of field: WGPULimits::maxVertexBufferArrayStride"]
        [::std::mem::offset_of!(WGPULimits, maxVertexBufferArrayStride) - 108usize];
    ["Offset of field: WGPULimits::maxInterStageShaderVariables"]
        [::std::mem::offset_of!(WGPULimits, maxInterStageShaderVariables) - 112usize];
    ["Offset of field: WGPULimits::maxColorAttachments"]
        [::std::mem::offset_of!(WGPULimits, maxColorAttachments) - 116usize];
    ["Offset of field: WGPULimits::maxColorAttachmentBytesPerSample"]
        [::std::mem::offset_of!(WGPULimits, maxColorAttachmentBytesPerSample) - 120usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupStorageSize"]
        [::std::mem::offset_of!(WGPULimits, maxComputeWorkgroupStorageSize) - 124usize];
    ["Offset of field: WGPULimits::maxComputeInvocationsPerWorkgroup"]
        [::std::mem::offset_of!(WGPULimits, maxComputeInvocationsPerWorkgroup) - 128usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeX"]
        [::std::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeX) - 132usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeY"]
        [::std::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeY) - 136usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupSizeZ"]
        [::std::mem::offset_of!(WGPULimits, maxComputeWorkgroupSizeZ) - 140usize];
    ["Offset of field: WGPULimits::maxComputeWorkgroupsPerDimension"]
        [::std::mem::offset_of!(WGPULimits, maxComputeWorkgroupsPerDimension) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUMultisampleState {
    pub nextInChain: *const WGPUChainedStruct,
    pub count: u32,
    pub mask: u32,
    pub alphaToCoverageEnabled: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUMultisampleState"][::std::mem::size_of::<WGPUMultisampleState>() - 24usize];
    ["Alignment of WGPUMultisampleState"][::std::mem::align_of::<WGPUMultisampleState>() - 8usize];
    ["Offset of field: WGPUMultisampleState::nextInChain"]
        [::std::mem::offset_of!(WGPUMultisampleState, nextInChain) - 0usize];
    ["Offset of field: WGPUMultisampleState::count"]
        [::std::mem::offset_of!(WGPUMultisampleState, count) - 8usize];
    ["Offset of field: WGPUMultisampleState::mask"]
        [::std::mem::offset_of!(WGPUMultisampleState, mask) - 12usize];
    ["Offset of field: WGPUMultisampleState::alphaToCoverageEnabled"]
        [::std::mem::offset_of!(WGPUMultisampleState, alphaToCoverageEnabled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUOrigin3D {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUOrigin3D"][::std::mem::size_of::<WGPUOrigin3D>() - 12usize];
    ["Alignment of WGPUOrigin3D"][::std::mem::align_of::<WGPUOrigin3D>() - 4usize];
    ["Offset of field: WGPUOrigin3D::x"][::std::mem::offset_of!(WGPUOrigin3D, x) - 0usize];
    ["Offset of field: WGPUOrigin3D::y"][::std::mem::offset_of!(WGPUOrigin3D, y) - 4usize];
    ["Offset of field: WGPUOrigin3D::z"][::std::mem::offset_of!(WGPUOrigin3D, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub bindGroupLayoutCount: usize,
    pub bindGroupLayouts: *const WGPUBindGroupLayout,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPipelineLayoutDescriptor"]
        [::std::mem::size_of::<WGPUPipelineLayoutDescriptor>() - 40usize];
    ["Alignment of WGPUPipelineLayoutDescriptor"]
        [::std::mem::align_of::<WGPUPipelineLayoutDescriptor>() - 8usize];
    ["Offset of field: WGPUPipelineLayoutDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUPipelineLayoutDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUPipelineLayoutDescriptor::label"]
        [::std::mem::offset_of!(WGPUPipelineLayoutDescriptor, label) - 8usize];
    ["Offset of field: WGPUPipelineLayoutDescriptor::bindGroupLayoutCount"]
        [::std::mem::offset_of!(WGPUPipelineLayoutDescriptor, bindGroupLayoutCount) - 24usize];
    ["Offset of field: WGPUPipelineLayoutDescriptor::bindGroupLayouts"]
        [::std::mem::offset_of!(WGPUPipelineLayoutDescriptor, bindGroupLayouts) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPrimitiveState {
    pub nextInChain: *const WGPUChainedStruct,
    pub topology: WGPUPrimitiveTopology,
    pub stripIndexFormat: WGPUIndexFormat,
    pub frontFace: WGPUFrontFace,
    pub cullMode: WGPUCullMode,
    pub unclippedDepth: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPrimitiveState"][::std::mem::size_of::<WGPUPrimitiveState>() - 32usize];
    ["Alignment of WGPUPrimitiveState"][::std::mem::align_of::<WGPUPrimitiveState>() - 8usize];
    ["Offset of field: WGPUPrimitiveState::nextInChain"]
        [::std::mem::offset_of!(WGPUPrimitiveState, nextInChain) - 0usize];
    ["Offset of field: WGPUPrimitiveState::topology"]
        [::std::mem::offset_of!(WGPUPrimitiveState, topology) - 8usize];
    ["Offset of field: WGPUPrimitiveState::stripIndexFormat"]
        [::std::mem::offset_of!(WGPUPrimitiveState, stripIndexFormat) - 12usize];
    ["Offset of field: WGPUPrimitiveState::frontFace"]
        [::std::mem::offset_of!(WGPUPrimitiveState, frontFace) - 16usize];
    ["Offset of field: WGPUPrimitiveState::cullMode"]
        [::std::mem::offset_of!(WGPUPrimitiveState, cullMode) - 20usize];
    ["Offset of field: WGPUPrimitiveState::unclippedDepth"]
        [::std::mem::offset_of!(WGPUPrimitiveState, unclippedDepth) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQuerySetDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub type_: WGPUQueryType,
    pub count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQuerySetDescriptor"][::std::mem::size_of::<WGPUQuerySetDescriptor>() - 32usize];
    ["Alignment of WGPUQuerySetDescriptor"]
        [::std::mem::align_of::<WGPUQuerySetDescriptor>() - 8usize];
    ["Offset of field: WGPUQuerySetDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUQuerySetDescriptor::label"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptor, label) - 8usize];
    ["Offset of field: WGPUQuerySetDescriptor::type_"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptor, type_) - 24usize];
    ["Offset of field: WGPUQuerySetDescriptor::count"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptor, count) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQueueDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQueueDescriptor"][::std::mem::size_of::<WGPUQueueDescriptor>() - 24usize];
    ["Alignment of WGPUQueueDescriptor"][::std::mem::align_of::<WGPUQueueDescriptor>() - 8usize];
    ["Offset of field: WGPUQueueDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUQueueDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUQueueDescriptor::label"]
        [::std::mem::offset_of!(WGPUQueueDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderBundleDescriptor"]
        [::std::mem::size_of::<WGPURenderBundleDescriptor>() - 24usize];
    ["Alignment of WGPURenderBundleDescriptor"]
        [::std::mem::align_of::<WGPURenderBundleDescriptor>() - 8usize];
    ["Offset of field: WGPURenderBundleDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPURenderBundleDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderBundleDescriptor::label"]
        [::std::mem::offset_of!(WGPURenderBundleDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleEncoderDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub colorFormatCount: usize,
    pub colorFormats: *const WGPUTextureFormat,
    pub depthStencilFormat: WGPUTextureFormat,
    pub sampleCount: u32,
    pub depthReadOnly: WGPUBool,
    pub stencilReadOnly: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderBundleEncoderDescriptor"]
        [::std::mem::size_of::<WGPURenderBundleEncoderDescriptor>() - 56usize];
    ["Alignment of WGPURenderBundleEncoderDescriptor"]
        [::std::mem::align_of::<WGPURenderBundleEncoderDescriptor>() - 8usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::label"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, label) - 8usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::colorFormatCount"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, colorFormatCount) - 24usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::colorFormats"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, colorFormats) - 32usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::depthStencilFormat"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, depthStencilFormat) - 40usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::sampleCount"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, sampleCount) - 44usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::depthReadOnly"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, depthReadOnly) - 48usize];
    ["Offset of field: WGPURenderBundleEncoderDescriptor::stencilReadOnly"]
        [::std::mem::offset_of!(WGPURenderBundleEncoderDescriptor, stencilReadOnly) - 52usize];
};
#[repr(C)]
pub struct WGPURenderPassDepthStencilAttachment {
    pub view: WGPUTextureView,
    pub depthLoadOp: WGPULoadOp,
    pub depthStoreOp: WGPUStoreOp,
    pub depthClearValue: f32,
    pub depthReadOnly: WGPUBool,
    pub stencilLoadOp: WGPULoadOp,
    pub stencilStoreOp: WGPUStoreOp,
    pub stencilClearValue: u32,
    pub stencilReadOnly: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassDepthStencilAttachment"]
        [::std::mem::size_of::<WGPURenderPassDepthStencilAttachment>() - 40usize];
    ["Alignment of WGPURenderPassDepthStencilAttachment"]
        [::std::mem::align_of::<WGPURenderPassDepthStencilAttachment>() - 8usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::view"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, view) - 0usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthLoadOp"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthLoadOp) - 8usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthStoreOp"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthStoreOp) - 12usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthClearValue"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthClearValue) - 16usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::depthReadOnly"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, depthReadOnly) - 20usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilLoadOp"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilLoadOp) - 24usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilStoreOp"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilStoreOp) - 28usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilClearValue"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilClearValue) - 32usize];
    ["Offset of field: WGPURenderPassDepthStencilAttachment::stencilReadOnly"]
        [::std::mem::offset_of!(WGPURenderPassDepthStencilAttachment, stencilReadOnly) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassMaxDrawCount {
    pub chain: WGPUChainedStruct,
    pub maxDrawCount: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassMaxDrawCount"]
        [::std::mem::size_of::<WGPURenderPassMaxDrawCount>() - 24usize];
    ["Alignment of WGPURenderPassMaxDrawCount"]
        [::std::mem::align_of::<WGPURenderPassMaxDrawCount>() - 8usize];
    ["Offset of field: WGPURenderPassMaxDrawCount::chain"]
        [::std::mem::offset_of!(WGPURenderPassMaxDrawCount, chain) - 0usize];
    ["Offset of field: WGPURenderPassMaxDrawCount::maxDrawCount"]
        [::std::mem::offset_of!(WGPURenderPassMaxDrawCount, maxDrawCount) - 16usize];
};
#[repr(C)]
pub struct WGPURenderPassTimestampWrites {
    pub querySet: WGPUQuerySet,
    pub beginningOfPassWriteIndex: u32,
    pub endOfPassWriteIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassTimestampWrites"]
        [::std::mem::size_of::<WGPURenderPassTimestampWrites>() - 16usize];
    ["Alignment of WGPURenderPassTimestampWrites"]
        [::std::mem::align_of::<WGPURenderPassTimestampWrites>() - 8usize];
    ["Offset of field: WGPURenderPassTimestampWrites::querySet"]
        [::std::mem::offset_of!(WGPURenderPassTimestampWrites, querySet) - 0usize];
    ["Offset of field: WGPURenderPassTimestampWrites::beginningOfPassWriteIndex"]
        [::std::mem::offset_of!(WGPURenderPassTimestampWrites, beginningOfPassWriteIndex) - 8usize];
    ["Offset of field: WGPURenderPassTimestampWrites::endOfPassWriteIndex"]
        [::std::mem::offset_of!(WGPURenderPassTimestampWrites, endOfPassWriteIndex) - 12usize];
};
#[repr(C)]
pub struct WGPURequestAdapterOptions {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " \"Feature level\" for the adapter request. If an adapter is returned, it must support the features and limits in the requested feature level.\n\n Implementations may ignore @ref WGPUFeatureLevel_Compatibility and provide @ref WGPUFeatureLevel_Core instead. @ref WGPUFeatureLevel_Core is the default in the JS API, but in C, this field is **required** (must not be undefined)."]
    pub featureLevel: WGPUFeatureLevel,
    pub powerPreference: WGPUPowerPreference,
    #[doc = " If true, requires the adapter to be a \"fallback\" adapter as defined by the JS spec.\n If this is not possible, the request returns null."]
    pub forceFallbackAdapter: WGPUBool,
    #[doc = " If set, requires the adapter to have a particular backend type.\n If this is not possible, the request returns null."]
    pub backendType: WGPUBackendType,
    #[doc = " If set, requires the adapter to be able to output to a particular surface.\n If this is not possible, the request returns null."]
    pub compatibleSurface: WGPUSurface,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURequestAdapterOptions"]
        [::std::mem::size_of::<WGPURequestAdapterOptions>() - 32usize];
    ["Alignment of WGPURequestAdapterOptions"]
        [::std::mem::align_of::<WGPURequestAdapterOptions>() - 8usize];
    ["Offset of field: WGPURequestAdapterOptions::nextInChain"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, nextInChain) - 0usize];
    ["Offset of field: WGPURequestAdapterOptions::featureLevel"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, featureLevel) - 8usize];
    ["Offset of field: WGPURequestAdapterOptions::powerPreference"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, powerPreference) - 12usize];
    ["Offset of field: WGPURequestAdapterOptions::forceFallbackAdapter"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, forceFallbackAdapter) - 16usize];
    ["Offset of field: WGPURequestAdapterOptions::backendType"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, backendType) - 20usize];
    ["Offset of field: WGPURequestAdapterOptions::compatibleSurface"]
        [::std::mem::offset_of!(WGPURequestAdapterOptions, compatibleSurface) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerBindingLayout {
    pub nextInChain: *const WGPUChainedStruct,
    pub type_: WGPUSamplerBindingType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSamplerBindingLayout"]
        [::std::mem::size_of::<WGPUSamplerBindingLayout>() - 16usize];
    ["Alignment of WGPUSamplerBindingLayout"]
        [::std::mem::align_of::<WGPUSamplerBindingLayout>() - 8usize];
    ["Offset of field: WGPUSamplerBindingLayout::nextInChain"]
        [::std::mem::offset_of!(WGPUSamplerBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUSamplerBindingLayout::type_"]
        [::std::mem::offset_of!(WGPUSamplerBindingLayout, type_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub addressModeU: WGPUAddressMode,
    pub addressModeV: WGPUAddressMode,
    pub addressModeW: WGPUAddressMode,
    pub magFilter: WGPUFilterMode,
    pub minFilter: WGPUFilterMode,
    pub mipmapFilter: WGPUMipmapFilterMode,
    pub lodMinClamp: f32,
    pub lodMaxClamp: f32,
    pub compare: WGPUCompareFunction,
    pub maxAnisotropy: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSamplerDescriptor"][::std::mem::size_of::<WGPUSamplerDescriptor>() - 64usize];
    ["Alignment of WGPUSamplerDescriptor"]
        [::std::mem::align_of::<WGPUSamplerDescriptor>() - 8usize];
    ["Offset of field: WGPUSamplerDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSamplerDescriptor::label"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, label) - 8usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeU"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, addressModeU) - 24usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeV"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, addressModeV) - 28usize];
    ["Offset of field: WGPUSamplerDescriptor::addressModeW"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, addressModeW) - 32usize];
    ["Offset of field: WGPUSamplerDescriptor::magFilter"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, magFilter) - 36usize];
    ["Offset of field: WGPUSamplerDescriptor::minFilter"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, minFilter) - 40usize];
    ["Offset of field: WGPUSamplerDescriptor::mipmapFilter"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, mipmapFilter) - 44usize];
    ["Offset of field: WGPUSamplerDescriptor::lodMinClamp"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, lodMinClamp) - 48usize];
    ["Offset of field: WGPUSamplerDescriptor::lodMaxClamp"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, lodMaxClamp) - 52usize];
    ["Offset of field: WGPUSamplerDescriptor::compare"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, compare) - 56usize];
    ["Offset of field: WGPUSamplerDescriptor::maxAnisotropy"]
        [::std::mem::offset_of!(WGPUSamplerDescriptor, maxAnisotropy) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderModuleDescriptor"]
        [::std::mem::size_of::<WGPUShaderModuleDescriptor>() - 24usize];
    ["Alignment of WGPUShaderModuleDescriptor"]
        [::std::mem::align_of::<WGPUShaderModuleDescriptor>() - 8usize];
    ["Offset of field: WGPUShaderModuleDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUShaderModuleDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUShaderModuleDescriptor::label"]
        [::std::mem::offset_of!(WGPUShaderModuleDescriptor, label) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderSourceSPIRV {
    pub chain: WGPUChainedStruct,
    pub codeSize: u32,
    pub code: *const u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderSourceSPIRV"][::std::mem::size_of::<WGPUShaderSourceSPIRV>() - 32usize];
    ["Alignment of WGPUShaderSourceSPIRV"]
        [::std::mem::align_of::<WGPUShaderSourceSPIRV>() - 8usize];
    ["Offset of field: WGPUShaderSourceSPIRV::chain"]
        [::std::mem::offset_of!(WGPUShaderSourceSPIRV, chain) - 0usize];
    ["Offset of field: WGPUShaderSourceSPIRV::codeSize"]
        [::std::mem::offset_of!(WGPUShaderSourceSPIRV, codeSize) - 16usize];
    ["Offset of field: WGPUShaderSourceSPIRV::code"]
        [::std::mem::offset_of!(WGPUShaderSourceSPIRV, code) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderSourceWGSL {
    pub chain: WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub code: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderSourceWGSL"][::std::mem::size_of::<WGPUShaderSourceWGSL>() - 32usize];
    ["Alignment of WGPUShaderSourceWGSL"][::std::mem::align_of::<WGPUShaderSourceWGSL>() - 8usize];
    ["Offset of field: WGPUShaderSourceWGSL::chain"]
        [::std::mem::offset_of!(WGPUShaderSourceWGSL, chain) - 0usize];
    ["Offset of field: WGPUShaderSourceWGSL::code"]
        [::std::mem::offset_of!(WGPUShaderSourceWGSL, code) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStencilFaceState {
    pub compare: WGPUCompareFunction,
    pub failOp: WGPUStencilOperation,
    pub depthFailOp: WGPUStencilOperation,
    pub passOp: WGPUStencilOperation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStencilFaceState"][::std::mem::size_of::<WGPUStencilFaceState>() - 16usize];
    ["Alignment of WGPUStencilFaceState"][::std::mem::align_of::<WGPUStencilFaceState>() - 4usize];
    ["Offset of field: WGPUStencilFaceState::compare"]
        [::std::mem::offset_of!(WGPUStencilFaceState, compare) - 0usize];
    ["Offset of field: WGPUStencilFaceState::failOp"]
        [::std::mem::offset_of!(WGPUStencilFaceState, failOp) - 4usize];
    ["Offset of field: WGPUStencilFaceState::depthFailOp"]
        [::std::mem::offset_of!(WGPUStencilFaceState, depthFailOp) - 8usize];
    ["Offset of field: WGPUStencilFaceState::passOp"]
        [::std::mem::offset_of!(WGPUStencilFaceState, passOp) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStorageTextureBindingLayout {
    pub nextInChain: *const WGPUChainedStruct,
    pub access: WGPUStorageTextureAccess,
    pub format: WGPUTextureFormat,
    pub viewDimension: WGPUTextureViewDimension,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUStorageTextureBindingLayout"]
        [::std::mem::size_of::<WGPUStorageTextureBindingLayout>() - 24usize];
    ["Alignment of WGPUStorageTextureBindingLayout"]
        [::std::mem::align_of::<WGPUStorageTextureBindingLayout>() - 8usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::nextInChain"]
        [::std::mem::offset_of!(WGPUStorageTextureBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::access"]
        [::std::mem::offset_of!(WGPUStorageTextureBindingLayout, access) - 8usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::format"]
        [::std::mem::offset_of!(WGPUStorageTextureBindingLayout, format) - 12usize];
    ["Offset of field: WGPUStorageTextureBindingLayout::viewDimension"]
        [::std::mem::offset_of!(WGPUStorageTextureBindingLayout, viewDimension) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSupportedFeatures {
    pub featureCount: usize,
    pub features: *const WGPUFeatureName,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSupportedFeatures"][::std::mem::size_of::<WGPUSupportedFeatures>() - 16usize];
    ["Alignment of WGPUSupportedFeatures"]
        [::std::mem::align_of::<WGPUSupportedFeatures>() - 8usize];
    ["Offset of field: WGPUSupportedFeatures::featureCount"]
        [::std::mem::offset_of!(WGPUSupportedFeatures, featureCount) - 0usize];
    ["Offset of field: WGPUSupportedFeatures::features"]
        [::std::mem::offset_of!(WGPUSupportedFeatures, features) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSupportedWGSLLanguageFeatures {
    pub featureCount: usize,
    pub features: *const WGPUWGSLLanguageFeatureName,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSupportedWGSLLanguageFeatures"]
        [::std::mem::size_of::<WGPUSupportedWGSLLanguageFeatures>() - 16usize];
    ["Alignment of WGPUSupportedWGSLLanguageFeatures"]
        [::std::mem::align_of::<WGPUSupportedWGSLLanguageFeatures>() - 8usize];
    ["Offset of field: WGPUSupportedWGSLLanguageFeatures::featureCount"]
        [::std::mem::offset_of!(WGPUSupportedWGSLLanguageFeatures, featureCount) - 0usize];
    ["Offset of field: WGPUSupportedWGSLLanguageFeatures::features"]
        [::std::mem::offset_of!(WGPUSupportedWGSLLanguageFeatures, features) - 8usize];
};
#[doc = " Filled by `::wgpuSurfaceGetCapabilities` with what's supported for `::wgpuSurfaceConfigure` for a pair of @ref WGPUSurface and @ref WGPUAdapter."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceCapabilities {
    pub nextInChain: *mut WGPUChainedStructOut,
    #[doc = " The bit set of supported @ref WGPUTextureUsage bits.\n Guaranteed to contain @ref WGPUTextureUsage_RenderAttachment."]
    pub usages: WGPUTextureUsage,
    #[doc = " A list of supported @ref WGPUTextureFormat values, in order of preference."]
    pub formatCount: usize,
    pub formats: *const WGPUTextureFormat,
    #[doc = " A list of supported @ref WGPUPresentMode values.\n Guaranteed to contain @ref WGPUPresentMode_Fifo."]
    pub presentModeCount: usize,
    pub presentModes: *const WGPUPresentMode,
    #[doc = " A list of supported @ref WGPUCompositeAlphaMode values.\n @ref WGPUCompositeAlphaMode_Auto will be an alias for the first element and will never be present in this array."]
    pub alphaModeCount: usize,
    pub alphaModes: *const WGPUCompositeAlphaMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceCapabilities"][::std::mem::size_of::<WGPUSurfaceCapabilities>() - 64usize];
    ["Alignment of WGPUSurfaceCapabilities"]
        [::std::mem::align_of::<WGPUSurfaceCapabilities>() - 8usize];
    ["Offset of field: WGPUSurfaceCapabilities::nextInChain"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceCapabilities::usages"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, usages) - 8usize];
    ["Offset of field: WGPUSurfaceCapabilities::formatCount"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, formatCount) - 16usize];
    ["Offset of field: WGPUSurfaceCapabilities::formats"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, formats) - 24usize];
    ["Offset of field: WGPUSurfaceCapabilities::presentModeCount"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, presentModeCount) - 32usize];
    ["Offset of field: WGPUSurfaceCapabilities::presentModes"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, presentModes) - 40usize];
    ["Offset of field: WGPUSurfaceCapabilities::alphaModeCount"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, alphaModeCount) - 48usize];
    ["Offset of field: WGPUSurfaceCapabilities::alphaModes"]
        [::std::mem::offset_of!(WGPUSurfaceCapabilities, alphaModes) - 56usize];
};
#[doc = " Options to `::wgpuSurfaceConfigure` for defining how a @ref WGPUSurface will be rendered to and presented to the user.\n See @ref Surface-Configuration for more details."]
#[repr(C)]
pub struct WGPUSurfaceConfiguration {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " The @ref WGPUDevice to use to render to surface's textures."]
    pub device: WGPUDevice,
    #[doc = " The @ref WGPUTextureFormat of the surface's textures."]
    pub format: WGPUTextureFormat,
    #[doc = " The @ref WGPUTextureUsage of the surface's textures."]
    pub usage: WGPUTextureUsage,
    #[doc = " The width of the surface's textures."]
    pub width: u32,
    #[doc = " The height of the surface's textures."]
    pub height: u32,
    #[doc = " The additional @ref WGPUTextureFormat for @ref WGPUTextureView format reinterpretation of the surface's textures."]
    pub viewFormatCount: usize,
    pub viewFormats: *const WGPUTextureFormat,
    #[doc = " How the surface's frames will be composited on the screen."]
    pub alphaMode: WGPUCompositeAlphaMode,
    #[doc = " When and in which order the surface's frames will be shown on the screen. Defaults to @ref WGPUPresentMode_Fifo."]
    pub presentMode: WGPUPresentMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceConfiguration"]
        [::std::mem::size_of::<WGPUSurfaceConfiguration>() - 64usize];
    ["Alignment of WGPUSurfaceConfiguration"]
        [::std::mem::align_of::<WGPUSurfaceConfiguration>() - 8usize];
    ["Offset of field: WGPUSurfaceConfiguration::nextInChain"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceConfiguration::device"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, device) - 8usize];
    ["Offset of field: WGPUSurfaceConfiguration::format"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, format) - 16usize];
    ["Offset of field: WGPUSurfaceConfiguration::usage"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, usage) - 24usize];
    ["Offset of field: WGPUSurfaceConfiguration::width"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, width) - 32usize];
    ["Offset of field: WGPUSurfaceConfiguration::height"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, height) - 36usize];
    ["Offset of field: WGPUSurfaceConfiguration::viewFormatCount"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, viewFormatCount) - 40usize];
    ["Offset of field: WGPUSurfaceConfiguration::viewFormats"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, viewFormats) - 48usize];
    ["Offset of field: WGPUSurfaceConfiguration::alphaMode"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, alphaMode) - 56usize];
    ["Offset of field: WGPUSurfaceConfiguration::presentMode"]
        [::std::mem::offset_of!(WGPUSurfaceConfiguration, presentMode) - 60usize];
};
#[doc = " The root descriptor for the creation of an @ref WGPUSurface with `::wgpuInstanceCreateSurface`.\n It isn't sufficient by itself and must have one of the `WGPUSurfaceSource*` in its chain.\n See @ref Surface-Creation for more details."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " Label used to refer to the object.\n\n This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceDescriptor"][::std::mem::size_of::<WGPUSurfaceDescriptor>() - 24usize];
    ["Alignment of WGPUSurfaceDescriptor"]
        [::std::mem::align_of::<WGPUSurfaceDescriptor>() - 8usize];
    ["Offset of field: WGPUSurfaceDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUSurfaceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceDescriptor::label"]
        [::std::mem::offset_of!(WGPUSurfaceDescriptor, label) - 8usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping an Android [`ANativeWindow`](https://developer.android.com/ndk/reference/group/a-native-window)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceAndroidNativeWindow {
    pub chain: WGPUChainedStruct,
    #[doc = " The pointer to the [`ANativeWindow`](https://developer.android.com/ndk/reference/group/a-native-window) that will be wrapped by the @ref WGPUSurface."]
    pub window: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceAndroidNativeWindow"]
        [::std::mem::size_of::<WGPUSurfaceSourceAndroidNativeWindow>() - 24usize];
    ["Alignment of WGPUSurfaceSourceAndroidNativeWindow"]
        [::std::mem::align_of::<WGPUSurfaceSourceAndroidNativeWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceAndroidNativeWindow::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceAndroidNativeWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceAndroidNativeWindow::window"]
        [::std::mem::offset_of!(WGPUSurfaceSourceAndroidNativeWindow, window) - 16usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping a [`CAMetalLayer`](https://developer.apple.com/documentation/quartzcore/cametallayer?language=objc)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceMetalLayer {
    pub chain: WGPUChainedStruct,
    #[doc = " The pointer to the [`CAMetalLayer`](https://developer.apple.com/documentation/quartzcore/cametallayer?language=objc) that will be wrapped by the @ref WGPUSurface."]
    pub layer: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceMetalLayer"]
        [::std::mem::size_of::<WGPUSurfaceSourceMetalLayer>() - 24usize];
    ["Alignment of WGPUSurfaceSourceMetalLayer"]
        [::std::mem::align_of::<WGPUSurfaceSourceMetalLayer>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceMetalLayer::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceMetalLayer, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceMetalLayer::layer"]
        [::std::mem::offset_of!(WGPUSurfaceSourceMetalLayer, layer) - 16usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping a [Wayland](https://wayland.freedesktop.org/) [`wl_surface`](https://wayland.freedesktop.org/docs/html/apa.html#protocol-spec-wl_surface)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceWaylandSurface {
    pub chain: WGPUChainedStruct,
    #[doc = " A [`wl_display`](https://wayland.freedesktop.org/docs/html/apa.html#protocol-spec-wl_display) for this Wayland instance."]
    pub display: *mut ::std::os::raw::c_void,
    #[doc = " A [`wl_surface`](https://wayland.freedesktop.org/docs/html/apa.html#protocol-spec-wl_surface) that will be wrapped by the @ref WGPUSurface"]
    pub surface: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceWaylandSurface"]
        [::std::mem::size_of::<WGPUSurfaceSourceWaylandSurface>() - 32usize];
    ["Alignment of WGPUSurfaceSourceWaylandSurface"]
        [::std::mem::align_of::<WGPUSurfaceSourceWaylandSurface>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::display"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, display) - 16usize];
    ["Offset of field: WGPUSurfaceSourceWaylandSurface::surface"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWaylandSurface, surface) - 24usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping a Windows [`HWND`](https://learn.microsoft.com/en-us/windows/apps/develop/ui-input/retrieve-hwnd)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceWindowsHWND {
    pub chain: WGPUChainedStruct,
    #[doc = " The [`HINSTANCE`](https://learn.microsoft.com/en-us/windows/win32/learnwin32/winmain--the-application-entry-point) for this application.\n Most commonly `GetModuleHandle(nullptr)`."]
    pub hinstance: *mut ::std::os::raw::c_void,
    #[doc = " The [`HWND`](https://learn.microsoft.com/en-us/windows/apps/develop/ui-input/retrieve-hwnd) that will be wrapped by the @ref WGPUSurface."]
    pub hwnd: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceWindowsHWND"]
        [::std::mem::size_of::<WGPUSurfaceSourceWindowsHWND>() - 32usize];
    ["Alignment of WGPUSurfaceSourceWindowsHWND"]
        [::std::mem::align_of::<WGPUSurfaceSourceWindowsHWND>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::hinstance"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, hinstance) - 16usize];
    ["Offset of field: WGPUSurfaceSourceWindowsHWND::hwnd"]
        [::std::mem::offset_of!(WGPUSurfaceSourceWindowsHWND, hwnd) - 24usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping an [XCB](https://xcb.freedesktop.org/) `xcb_window_t`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceXCBWindow {
    pub chain: WGPUChainedStruct,
    #[doc = " The `xcb_connection_t` for the connection to the X server."]
    pub connection: *mut ::std::os::raw::c_void,
    #[doc = " The `xcb_window_t` for the window that will be wrapped by the @ref WGPUSurface."]
    pub window: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceXCBWindow"]
        [::std::mem::size_of::<WGPUSurfaceSourceXCBWindow>() - 32usize];
    ["Alignment of WGPUSurfaceSourceXCBWindow"]
        [::std::mem::align_of::<WGPUSurfaceSourceXCBWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXCBWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::connection"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXCBWindow, connection) - 16usize];
    ["Offset of field: WGPUSurfaceSourceXCBWindow::window"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXCBWindow, window) - 24usize];
};
#[doc = " Chained in @ref WGPUSurfaceDescriptor to make an @ref WGPUSurface wrapping an [Xlib](https://www.x.org/releases/current/doc/libX11/libX11/libX11.html) `Window`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceSourceXlibWindow {
    pub chain: WGPUChainedStruct,
    #[doc = " A pointer to the [`Display`](https://www.x.org/releases/current/doc/libX11/libX11/libX11.html#Opening_the_Display) connected to the X server."]
    pub display: *mut ::std::os::raw::c_void,
    #[doc = " The [`Window`](https://www.x.org/releases/current/doc/libX11/libX11/libX11.html#Creating_Windows) that will be wrapped by the @ref WGPUSurface."]
    pub window: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceSourceXlibWindow"]
        [::std::mem::size_of::<WGPUSurfaceSourceXlibWindow>() - 32usize];
    ["Alignment of WGPUSurfaceSourceXlibWindow"]
        [::std::mem::align_of::<WGPUSurfaceSourceXlibWindow>() - 8usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::chain"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXlibWindow, chain) - 0usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::display"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXlibWindow, display) - 16usize];
    ["Offset of field: WGPUSurfaceSourceXlibWindow::window"]
        [::std::mem::offset_of!(WGPUSurfaceSourceXlibWindow, window) - 24usize];
};
#[doc = " Queried each frame from a @ref WGPUSurface to get a @ref WGPUTexture to render to along with some metadata.\n See @ref Surface-Presenting for more details."]
#[repr(C)]
pub struct WGPUSurfaceTexture {
    pub nextInChain: *mut WGPUChainedStructOut,
    #[doc = " The @ref WGPUTexture representing the frame that will be shown on the surface.\n It is @ref ReturnedWithOwnership from @ref wgpuSurfaceGetCurrentTexture."]
    pub texture: WGPUTexture,
    #[doc = " Whether the call to `::wgpuSurfaceGetCurrentTexture` succeeded and a hint as to why it might not have."]
    pub status: WGPUSurfaceGetCurrentTextureStatus,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceTexture"][::std::mem::size_of::<WGPUSurfaceTexture>() - 24usize];
    ["Alignment of WGPUSurfaceTexture"][::std::mem::align_of::<WGPUSurfaceTexture>() - 8usize];
    ["Offset of field: WGPUSurfaceTexture::nextInChain"]
        [::std::mem::offset_of!(WGPUSurfaceTexture, nextInChain) - 0usize];
    ["Offset of field: WGPUSurfaceTexture::texture"]
        [::std::mem::offset_of!(WGPUSurfaceTexture, texture) - 8usize];
    ["Offset of field: WGPUSurfaceTexture::status"]
        [::std::mem::offset_of!(WGPUSurfaceTexture, status) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTexelCopyBufferLayout {
    pub offset: u64,
    pub bytesPerRow: u32,
    pub rowsPerImage: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyBufferLayout"]
        [::std::mem::size_of::<WGPUTexelCopyBufferLayout>() - 16usize];
    ["Alignment of WGPUTexelCopyBufferLayout"]
        [::std::mem::align_of::<WGPUTexelCopyBufferLayout>() - 8usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::offset"]
        [::std::mem::offset_of!(WGPUTexelCopyBufferLayout, offset) - 0usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::bytesPerRow"]
        [::std::mem::offset_of!(WGPUTexelCopyBufferLayout, bytesPerRow) - 8usize];
    ["Offset of field: WGPUTexelCopyBufferLayout::rowsPerImage"]
        [::std::mem::offset_of!(WGPUTexelCopyBufferLayout, rowsPerImage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureBindingLayout {
    pub nextInChain: *const WGPUChainedStruct,
    pub sampleType: WGPUTextureSampleType,
    pub viewDimension: WGPUTextureViewDimension,
    pub multisampled: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureBindingLayout"]
        [::std::mem::size_of::<WGPUTextureBindingLayout>() - 24usize];
    ["Alignment of WGPUTextureBindingLayout"]
        [::std::mem::align_of::<WGPUTextureBindingLayout>() - 8usize];
    ["Offset of field: WGPUTextureBindingLayout::nextInChain"]
        [::std::mem::offset_of!(WGPUTextureBindingLayout, nextInChain) - 0usize];
    ["Offset of field: WGPUTextureBindingLayout::sampleType"]
        [::std::mem::offset_of!(WGPUTextureBindingLayout, sampleType) - 8usize];
    ["Offset of field: WGPUTextureBindingLayout::viewDimension"]
        [::std::mem::offset_of!(WGPUTextureBindingLayout, viewDimension) - 12usize];
    ["Offset of field: WGPUTextureBindingLayout::multisampled"]
        [::std::mem::offset_of!(WGPUTextureBindingLayout, multisampled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureViewDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub format: WGPUTextureFormat,
    pub dimension: WGPUTextureViewDimension,
    pub baseMipLevel: u32,
    pub mipLevelCount: u32,
    pub baseArrayLayer: u32,
    pub arrayLayerCount: u32,
    pub aspect: WGPUTextureAspect,
    pub usage: WGPUTextureUsage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureViewDescriptor"]
        [::std::mem::size_of::<WGPUTextureViewDescriptor>() - 64usize];
    ["Alignment of WGPUTextureViewDescriptor"]
        [::std::mem::align_of::<WGPUTextureViewDescriptor>() - 8usize];
    ["Offset of field: WGPUTextureViewDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUTextureViewDescriptor::label"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, label) - 8usize];
    ["Offset of field: WGPUTextureViewDescriptor::format"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, format) - 24usize];
    ["Offset of field: WGPUTextureViewDescriptor::dimension"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, dimension) - 28usize];
    ["Offset of field: WGPUTextureViewDescriptor::baseMipLevel"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, baseMipLevel) - 32usize];
    ["Offset of field: WGPUTextureViewDescriptor::mipLevelCount"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, mipLevelCount) - 36usize];
    ["Offset of field: WGPUTextureViewDescriptor::baseArrayLayer"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, baseArrayLayer) - 40usize];
    ["Offset of field: WGPUTextureViewDescriptor::arrayLayerCount"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, arrayLayerCount) - 44usize];
    ["Offset of field: WGPUTextureViewDescriptor::aspect"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, aspect) - 48usize];
    ["Offset of field: WGPUTextureViewDescriptor::usage"]
        [::std::mem::offset_of!(WGPUTextureViewDescriptor, usage) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexAttribute {
    pub format: WGPUVertexFormat,
    pub offset: u64,
    pub shaderLocation: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUVertexAttribute"][::std::mem::size_of::<WGPUVertexAttribute>() - 24usize];
    ["Alignment of WGPUVertexAttribute"][::std::mem::align_of::<WGPUVertexAttribute>() - 8usize];
    ["Offset of field: WGPUVertexAttribute::format"]
        [::std::mem::offset_of!(WGPUVertexAttribute, format) - 0usize];
    ["Offset of field: WGPUVertexAttribute::offset"]
        [::std::mem::offset_of!(WGPUVertexAttribute, offset) - 8usize];
    ["Offset of field: WGPUVertexAttribute::shaderLocation"]
        [::std::mem::offset_of!(WGPUVertexAttribute, shaderLocation) - 16usize];
};
#[repr(C)]
pub struct WGPUBindGroupDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub layout: WGPUBindGroupLayout,
    pub entryCount: usize,
    pub entries: *const WGPUBindGroupEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupDescriptor"][::std::mem::size_of::<WGPUBindGroupDescriptor>() - 48usize];
    ["Alignment of WGPUBindGroupDescriptor"]
        [::std::mem::align_of::<WGPUBindGroupDescriptor>() - 8usize];
    ["Offset of field: WGPUBindGroupDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUBindGroupDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupDescriptor::label"]
        [::std::mem::offset_of!(WGPUBindGroupDescriptor, label) - 8usize];
    ["Offset of field: WGPUBindGroupDescriptor::layout"]
        [::std::mem::offset_of!(WGPUBindGroupDescriptor, layout) - 24usize];
    ["Offset of field: WGPUBindGroupDescriptor::entryCount"]
        [::std::mem::offset_of!(WGPUBindGroupDescriptor, entryCount) - 32usize];
    ["Offset of field: WGPUBindGroupDescriptor::entries"]
        [::std::mem::offset_of!(WGPUBindGroupDescriptor, entries) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutEntry {
    pub nextInChain: *const WGPUChainedStruct,
    pub binding: u32,
    pub visibility: WGPUShaderStage,
    pub buffer: WGPUBufferBindingLayout,
    pub sampler: WGPUSamplerBindingLayout,
    pub texture: WGPUTextureBindingLayout,
    pub storageTexture: WGPUStorageTextureBindingLayout,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupLayoutEntry"]
        [::std::mem::size_of::<WGPUBindGroupLayoutEntry>() - 112usize];
    ["Alignment of WGPUBindGroupLayoutEntry"]
        [::std::mem::align_of::<WGPUBindGroupLayoutEntry>() - 8usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::nextInChain"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::binding"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, binding) - 8usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::visibility"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, visibility) - 16usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::buffer"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, buffer) - 24usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::sampler"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, sampler) - 48usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::texture"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, texture) - 64usize];
    ["Offset of field: WGPUBindGroupLayoutEntry::storageTexture"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntry, storageTexture) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBlendState {
    pub color: WGPUBlendComponent,
    pub alpha: WGPUBlendComponent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBlendState"][::std::mem::size_of::<WGPUBlendState>() - 24usize];
    ["Alignment of WGPUBlendState"][::std::mem::align_of::<WGPUBlendState>() - 4usize];
    ["Offset of field: WGPUBlendState::color"]
        [::std::mem::offset_of!(WGPUBlendState, color) - 0usize];
    ["Offset of field: WGPUBlendState::alpha"]
        [::std::mem::offset_of!(WGPUBlendState, alpha) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCompilationInfo {
    pub nextInChain: *const WGPUChainedStruct,
    pub messageCount: usize,
    pub messages: *const WGPUCompilationMessage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUCompilationInfo"][::std::mem::size_of::<WGPUCompilationInfo>() - 24usize];
    ["Alignment of WGPUCompilationInfo"][::std::mem::align_of::<WGPUCompilationInfo>() - 8usize];
    ["Offset of field: WGPUCompilationInfo::nextInChain"]
        [::std::mem::offset_of!(WGPUCompilationInfo, nextInChain) - 0usize];
    ["Offset of field: WGPUCompilationInfo::messageCount"]
        [::std::mem::offset_of!(WGPUCompilationInfo, messageCount) - 8usize];
    ["Offset of field: WGPUCompilationInfo::messages"]
        [::std::mem::offset_of!(WGPUCompilationInfo, messages) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePassDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub timestampWrites: *const WGPUComputePassTimestampWrites,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUComputePassDescriptor"]
        [::std::mem::size_of::<WGPUComputePassDescriptor>() - 32usize];
    ["Alignment of WGPUComputePassDescriptor"]
        [::std::mem::align_of::<WGPUComputePassDescriptor>() - 8usize];
    ["Offset of field: WGPUComputePassDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUComputePassDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUComputePassDescriptor::label"]
        [::std::mem::offset_of!(WGPUComputePassDescriptor, label) - 8usize];
    ["Offset of field: WGPUComputePassDescriptor::timestampWrites"]
        [::std::mem::offset_of!(WGPUComputePassDescriptor, timestampWrites) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDepthStencilState {
    pub nextInChain: *const WGPUChainedStruct,
    pub format: WGPUTextureFormat,
    pub depthWriteEnabled: WGPUOptionalBool,
    pub depthCompare: WGPUCompareFunction,
    pub stencilFront: WGPUStencilFaceState,
    pub stencilBack: WGPUStencilFaceState,
    pub stencilReadMask: u32,
    pub stencilWriteMask: u32,
    pub depthBias: i32,
    pub depthBiasSlopeScale: f32,
    pub depthBiasClamp: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDepthStencilState"][::std::mem::size_of::<WGPUDepthStencilState>() - 72usize];
    ["Alignment of WGPUDepthStencilState"]
        [::std::mem::align_of::<WGPUDepthStencilState>() - 8usize];
    ["Offset of field: WGPUDepthStencilState::nextInChain"]
        [::std::mem::offset_of!(WGPUDepthStencilState, nextInChain) - 0usize];
    ["Offset of field: WGPUDepthStencilState::format"]
        [::std::mem::offset_of!(WGPUDepthStencilState, format) - 8usize];
    ["Offset of field: WGPUDepthStencilState::depthWriteEnabled"]
        [::std::mem::offset_of!(WGPUDepthStencilState, depthWriteEnabled) - 12usize];
    ["Offset of field: WGPUDepthStencilState::depthCompare"]
        [::std::mem::offset_of!(WGPUDepthStencilState, depthCompare) - 16usize];
    ["Offset of field: WGPUDepthStencilState::stencilFront"]
        [::std::mem::offset_of!(WGPUDepthStencilState, stencilFront) - 20usize];
    ["Offset of field: WGPUDepthStencilState::stencilBack"]
        [::std::mem::offset_of!(WGPUDepthStencilState, stencilBack) - 36usize];
    ["Offset of field: WGPUDepthStencilState::stencilReadMask"]
        [::std::mem::offset_of!(WGPUDepthStencilState, stencilReadMask) - 52usize];
    ["Offset of field: WGPUDepthStencilState::stencilWriteMask"]
        [::std::mem::offset_of!(WGPUDepthStencilState, stencilWriteMask) - 56usize];
    ["Offset of field: WGPUDepthStencilState::depthBias"]
        [::std::mem::offset_of!(WGPUDepthStencilState, depthBias) - 60usize];
    ["Offset of field: WGPUDepthStencilState::depthBiasSlopeScale"]
        [::std::mem::offset_of!(WGPUDepthStencilState, depthBiasSlopeScale) - 64usize];
    ["Offset of field: WGPUDepthStencilState::depthBiasClamp"]
        [::std::mem::offset_of!(WGPUDepthStencilState, depthBiasClamp) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub requiredFeatureCount: usize,
    pub requiredFeatures: *const WGPUFeatureName,
    pub requiredLimits: *const WGPULimits,
    pub defaultQueue: WGPUQueueDescriptor,
    pub deviceLostCallbackInfo: WGPUDeviceLostCallbackInfo,
    pub uncapturedErrorCallbackInfo: WGPUUncapturedErrorCallbackInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDeviceDescriptor"][::std::mem::size_of::<WGPUDeviceDescriptor>() - 144usize];
    ["Alignment of WGPUDeviceDescriptor"][::std::mem::align_of::<WGPUDeviceDescriptor>() - 8usize];
    ["Offset of field: WGPUDeviceDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUDeviceDescriptor::label"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, label) - 8usize];
    ["Offset of field: WGPUDeviceDescriptor::requiredFeatureCount"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, requiredFeatureCount) - 24usize];
    ["Offset of field: WGPUDeviceDescriptor::requiredFeatures"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, requiredFeatures) - 32usize];
    ["Offset of field: WGPUDeviceDescriptor::requiredLimits"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, requiredLimits) - 40usize];
    ["Offset of field: WGPUDeviceDescriptor::defaultQueue"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, defaultQueue) - 48usize];
    ["Offset of field: WGPUDeviceDescriptor::deviceLostCallbackInfo"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, deviceLostCallbackInfo) - 72usize];
    ["Offset of field: WGPUDeviceDescriptor::uncapturedErrorCallbackInfo"]
        [::std::mem::offset_of!(WGPUDeviceDescriptor, uncapturedErrorCallbackInfo) - 112usize];
};
#[doc = " Struct holding a future to wait on, and a `completed` boolean flag."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFutureWaitInfo {
    #[doc = " The future to wait on."]
    pub future: WGPUFuture,
    #[doc = " Whether or not the future completed."]
    pub completed: WGPUBool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUFutureWaitInfo"][::std::mem::size_of::<WGPUFutureWaitInfo>() - 16usize];
    ["Alignment of WGPUFutureWaitInfo"][::std::mem::align_of::<WGPUFutureWaitInfo>() - 8usize];
    ["Offset of field: WGPUFutureWaitInfo::future"]
        [::std::mem::offset_of!(WGPUFutureWaitInfo, future) - 0usize];
    ["Offset of field: WGPUFutureWaitInfo::completed"]
        [::std::mem::offset_of!(WGPUFutureWaitInfo, completed) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " Instance features to enable"]
    pub features: WGPUInstanceCapabilities,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceDescriptor"][::std::mem::size_of::<WGPUInstanceDescriptor>() - 32usize];
    ["Alignment of WGPUInstanceDescriptor"]
        [::std::mem::align_of::<WGPUInstanceDescriptor>() - 8usize];
    ["Offset of field: WGPUInstanceDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUInstanceDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUInstanceDescriptor::features"]
        [::std::mem::offset_of!(WGPUInstanceDescriptor, features) - 8usize];
};
#[repr(C)]
pub struct WGPUProgrammableStageDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub module: WGPUShaderModule,
    #[doc = " This is a \\ref NullableInputString."]
    pub entryPoint: WGPUStringView,
    pub constantCount: usize,
    pub constants: *const WGPUConstantEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUProgrammableStageDescriptor"]
        [::std::mem::size_of::<WGPUProgrammableStageDescriptor>() - 48usize];
    ["Alignment of WGPUProgrammableStageDescriptor"]
        [::std::mem::align_of::<WGPUProgrammableStageDescriptor>() - 8usize];
    ["Offset of field: WGPUProgrammableStageDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUProgrammableStageDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUProgrammableStageDescriptor::module"]
        [::std::mem::offset_of!(WGPUProgrammableStageDescriptor, module) - 8usize];
    ["Offset of field: WGPUProgrammableStageDescriptor::entryPoint"]
        [::std::mem::offset_of!(WGPUProgrammableStageDescriptor, entryPoint) - 16usize];
    ["Offset of field: WGPUProgrammableStageDescriptor::constantCount"]
        [::std::mem::offset_of!(WGPUProgrammableStageDescriptor, constantCount) - 32usize];
    ["Offset of field: WGPUProgrammableStageDescriptor::constants"]
        [::std::mem::offset_of!(WGPUProgrammableStageDescriptor, constants) - 40usize];
};
#[repr(C)]
pub struct WGPURenderPassColorAttachment {
    pub nextInChain: *const WGPUChainedStruct,
    pub view: WGPUTextureView,
    pub depthSlice: u32,
    pub resolveTarget: WGPUTextureView,
    pub loadOp: WGPULoadOp,
    pub storeOp: WGPUStoreOp,
    pub clearValue: WGPUColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassColorAttachment"]
        [::std::mem::size_of::<WGPURenderPassColorAttachment>() - 72usize];
    ["Alignment of WGPURenderPassColorAttachment"]
        [::std::mem::align_of::<WGPURenderPassColorAttachment>() - 8usize];
    ["Offset of field: WGPURenderPassColorAttachment::nextInChain"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPassColorAttachment::view"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, view) - 8usize];
    ["Offset of field: WGPURenderPassColorAttachment::depthSlice"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, depthSlice) - 16usize];
    ["Offset of field: WGPURenderPassColorAttachment::resolveTarget"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, resolveTarget) - 24usize];
    ["Offset of field: WGPURenderPassColorAttachment::loadOp"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, loadOp) - 32usize];
    ["Offset of field: WGPURenderPassColorAttachment::storeOp"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, storeOp) - 36usize];
    ["Offset of field: WGPURenderPassColorAttachment::clearValue"]
        [::std::mem::offset_of!(WGPURenderPassColorAttachment, clearValue) - 40usize];
};
#[repr(C)]
pub struct WGPUTexelCopyBufferInfo {
    pub layout: WGPUTexelCopyBufferLayout,
    pub buffer: WGPUBuffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyBufferInfo"][::std::mem::size_of::<WGPUTexelCopyBufferInfo>() - 24usize];
    ["Alignment of WGPUTexelCopyBufferInfo"]
        [::std::mem::align_of::<WGPUTexelCopyBufferInfo>() - 8usize];
    ["Offset of field: WGPUTexelCopyBufferInfo::layout"]
        [::std::mem::offset_of!(WGPUTexelCopyBufferInfo, layout) - 0usize];
    ["Offset of field: WGPUTexelCopyBufferInfo::buffer"]
        [::std::mem::offset_of!(WGPUTexelCopyBufferInfo, buffer) - 16usize];
};
#[repr(C)]
pub struct WGPUTexelCopyTextureInfo {
    pub texture: WGPUTexture,
    pub mipLevel: u32,
    pub origin: WGPUOrigin3D,
    pub aspect: WGPUTextureAspect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTexelCopyTextureInfo"]
        [::std::mem::size_of::<WGPUTexelCopyTextureInfo>() - 32usize];
    ["Alignment of WGPUTexelCopyTextureInfo"]
        [::std::mem::align_of::<WGPUTexelCopyTextureInfo>() - 8usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::texture"]
        [::std::mem::offset_of!(WGPUTexelCopyTextureInfo, texture) - 0usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::mipLevel"]
        [::std::mem::offset_of!(WGPUTexelCopyTextureInfo, mipLevel) - 8usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::origin"]
        [::std::mem::offset_of!(WGPUTexelCopyTextureInfo, origin) - 12usize];
    ["Offset of field: WGPUTexelCopyTextureInfo::aspect"]
        [::std::mem::offset_of!(WGPUTexelCopyTextureInfo, aspect) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub usage: WGPUTextureUsage,
    pub dimension: WGPUTextureDimension,
    pub size: WGPUExtent3D,
    pub format: WGPUTextureFormat,
    pub mipLevelCount: u32,
    pub sampleCount: u32,
    pub viewFormatCount: usize,
    pub viewFormats: *const WGPUTextureFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureDescriptor"][::std::mem::size_of::<WGPUTextureDescriptor>() - 80usize];
    ["Alignment of WGPUTextureDescriptor"]
        [::std::mem::align_of::<WGPUTextureDescriptor>() - 8usize];
    ["Offset of field: WGPUTextureDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUTextureDescriptor::label"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, label) - 8usize];
    ["Offset of field: WGPUTextureDescriptor::usage"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, usage) - 24usize];
    ["Offset of field: WGPUTextureDescriptor::dimension"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, dimension) - 32usize];
    ["Offset of field: WGPUTextureDescriptor::size"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, size) - 36usize];
    ["Offset of field: WGPUTextureDescriptor::format"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, format) - 48usize];
    ["Offset of field: WGPUTextureDescriptor::mipLevelCount"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, mipLevelCount) - 52usize];
    ["Offset of field: WGPUTextureDescriptor::sampleCount"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, sampleCount) - 56usize];
    ["Offset of field: WGPUTextureDescriptor::viewFormatCount"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, viewFormatCount) - 64usize];
    ["Offset of field: WGPUTextureDescriptor::viewFormats"]
        [::std::mem::offset_of!(WGPUTextureDescriptor, viewFormats) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexBufferLayout {
    #[doc = " The step mode for the vertex buffer. If @ref WGPUVertexStepMode_VertexBufferNotUsed,\n indicates a \"hole\" in the parent @ref WGPUVertexState `buffers` array:\n the pipeline does not use a vertex buffer at this `location`."]
    pub stepMode: WGPUVertexStepMode,
    pub arrayStride: u64,
    pub attributeCount: usize,
    pub attributes: *const WGPUVertexAttribute,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUVertexBufferLayout"][::std::mem::size_of::<WGPUVertexBufferLayout>() - 32usize];
    ["Alignment of WGPUVertexBufferLayout"]
        [::std::mem::align_of::<WGPUVertexBufferLayout>() - 8usize];
    ["Offset of field: WGPUVertexBufferLayout::stepMode"]
        [::std::mem::offset_of!(WGPUVertexBufferLayout, stepMode) - 0usize];
    ["Offset of field: WGPUVertexBufferLayout::arrayStride"]
        [::std::mem::offset_of!(WGPUVertexBufferLayout, arrayStride) - 8usize];
    ["Offset of field: WGPUVertexBufferLayout::attributeCount"]
        [::std::mem::offset_of!(WGPUVertexBufferLayout, attributeCount) - 16usize];
    ["Offset of field: WGPUVertexBufferLayout::attributes"]
        [::std::mem::offset_of!(WGPUVertexBufferLayout, attributes) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub entryCount: usize,
    pub entries: *const WGPUBindGroupLayoutEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupLayoutDescriptor"]
        [::std::mem::size_of::<WGPUBindGroupLayoutDescriptor>() - 40usize];
    ["Alignment of WGPUBindGroupLayoutDescriptor"]
        [::std::mem::align_of::<WGPUBindGroupLayoutDescriptor>() - 8usize];
    ["Offset of field: WGPUBindGroupLayoutDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUBindGroupLayoutDescriptor::label"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutDescriptor, label) - 8usize];
    ["Offset of field: WGPUBindGroupLayoutDescriptor::entryCount"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutDescriptor, entryCount) - 24usize];
    ["Offset of field: WGPUBindGroupLayoutDescriptor::entries"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutDescriptor, entries) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColorTargetState {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " The texture format of the target. If @ref WGPUTextureFormat_Undefined,\n indicates a \"hole\" in the parent @ref WGPUFragmentState `targets` array:\n the pipeline does not output a value at this `location`."]
    pub format: WGPUTextureFormat,
    pub blend: *const WGPUBlendState,
    pub writeMask: WGPUColorWriteMask,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUColorTargetState"][::std::mem::size_of::<WGPUColorTargetState>() - 32usize];
    ["Alignment of WGPUColorTargetState"][::std::mem::align_of::<WGPUColorTargetState>() - 8usize];
    ["Offset of field: WGPUColorTargetState::nextInChain"]
        [::std::mem::offset_of!(WGPUColorTargetState, nextInChain) - 0usize];
    ["Offset of field: WGPUColorTargetState::format"]
        [::std::mem::offset_of!(WGPUColorTargetState, format) - 8usize];
    ["Offset of field: WGPUColorTargetState::blend"]
        [::std::mem::offset_of!(WGPUColorTargetState, blend) - 16usize];
    ["Offset of field: WGPUColorTargetState::writeMask"]
        [::std::mem::offset_of!(WGPUColorTargetState, writeMask) - 24usize];
};
#[repr(C)]
pub struct WGPUComputePipelineDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub layout: WGPUPipelineLayout,
    pub compute: WGPUProgrammableStageDescriptor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUComputePipelineDescriptor"]
        [::std::mem::size_of::<WGPUComputePipelineDescriptor>() - 80usize];
    ["Alignment of WGPUComputePipelineDescriptor"]
        [::std::mem::align_of::<WGPUComputePipelineDescriptor>() - 8usize];
    ["Offset of field: WGPUComputePipelineDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPUComputePipelineDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPUComputePipelineDescriptor::label"]
        [::std::mem::offset_of!(WGPUComputePipelineDescriptor, label) - 8usize];
    ["Offset of field: WGPUComputePipelineDescriptor::layout"]
        [::std::mem::offset_of!(WGPUComputePipelineDescriptor, layout) - 24usize];
    ["Offset of field: WGPUComputePipelineDescriptor::compute"]
        [::std::mem::offset_of!(WGPUComputePipelineDescriptor, compute) - 32usize];
};
#[repr(C)]
pub struct WGPURenderPassDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub colorAttachmentCount: usize,
    pub colorAttachments: *const WGPURenderPassColorAttachment,
    pub depthStencilAttachment: *const WGPURenderPassDepthStencilAttachment,
    pub occlusionQuerySet: WGPUQuerySet,
    pub timestampWrites: *const WGPURenderPassTimestampWrites,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPassDescriptor"]
        [::std::mem::size_of::<WGPURenderPassDescriptor>() - 64usize];
    ["Alignment of WGPURenderPassDescriptor"]
        [::std::mem::align_of::<WGPURenderPassDescriptor>() - 8usize];
    ["Offset of field: WGPURenderPassDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPassDescriptor::label"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, label) - 8usize];
    ["Offset of field: WGPURenderPassDescriptor::colorAttachmentCount"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, colorAttachmentCount) - 24usize];
    ["Offset of field: WGPURenderPassDescriptor::colorAttachments"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, colorAttachments) - 32usize];
    ["Offset of field: WGPURenderPassDescriptor::depthStencilAttachment"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, depthStencilAttachment) - 40usize];
    ["Offset of field: WGPURenderPassDescriptor::occlusionQuerySet"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, occlusionQuerySet) - 48usize];
    ["Offset of field: WGPURenderPassDescriptor::timestampWrites"]
        [::std::mem::offset_of!(WGPURenderPassDescriptor, timestampWrites) - 56usize];
};
#[repr(C)]
pub struct WGPUVertexState {
    pub nextInChain: *const WGPUChainedStruct,
    pub module: WGPUShaderModule,
    #[doc = " This is a \\ref NullableInputString."]
    pub entryPoint: WGPUStringView,
    pub constantCount: usize,
    pub constants: *const WGPUConstantEntry,
    pub bufferCount: usize,
    pub buffers: *const WGPUVertexBufferLayout,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUVertexState"][::std::mem::size_of::<WGPUVertexState>() - 64usize];
    ["Alignment of WGPUVertexState"][::std::mem::align_of::<WGPUVertexState>() - 8usize];
    ["Offset of field: WGPUVertexState::nextInChain"]
        [::std::mem::offset_of!(WGPUVertexState, nextInChain) - 0usize];
    ["Offset of field: WGPUVertexState::module"]
        [::std::mem::offset_of!(WGPUVertexState, module) - 8usize];
    ["Offset of field: WGPUVertexState::entryPoint"]
        [::std::mem::offset_of!(WGPUVertexState, entryPoint) - 16usize];
    ["Offset of field: WGPUVertexState::constantCount"]
        [::std::mem::offset_of!(WGPUVertexState, constantCount) - 32usize];
    ["Offset of field: WGPUVertexState::constants"]
        [::std::mem::offset_of!(WGPUVertexState, constants) - 40usize];
    ["Offset of field: WGPUVertexState::bufferCount"]
        [::std::mem::offset_of!(WGPUVertexState, bufferCount) - 48usize];
    ["Offset of field: WGPUVertexState::buffers"]
        [::std::mem::offset_of!(WGPUVertexState, buffers) - 56usize];
};
#[repr(C)]
pub struct WGPUFragmentState {
    pub nextInChain: *const WGPUChainedStruct,
    pub module: WGPUShaderModule,
    #[doc = " This is a \\ref NullableInputString."]
    pub entryPoint: WGPUStringView,
    pub constantCount: usize,
    pub constants: *const WGPUConstantEntry,
    pub targetCount: usize,
    pub targets: *const WGPUColorTargetState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUFragmentState"][::std::mem::size_of::<WGPUFragmentState>() - 64usize];
    ["Alignment of WGPUFragmentState"][::std::mem::align_of::<WGPUFragmentState>() - 8usize];
    ["Offset of field: WGPUFragmentState::nextInChain"]
        [::std::mem::offset_of!(WGPUFragmentState, nextInChain) - 0usize];
    ["Offset of field: WGPUFragmentState::module"]
        [::std::mem::offset_of!(WGPUFragmentState, module) - 8usize];
    ["Offset of field: WGPUFragmentState::entryPoint"]
        [::std::mem::offset_of!(WGPUFragmentState, entryPoint) - 16usize];
    ["Offset of field: WGPUFragmentState::constantCount"]
        [::std::mem::offset_of!(WGPUFragmentState, constantCount) - 32usize];
    ["Offset of field: WGPUFragmentState::constants"]
        [::std::mem::offset_of!(WGPUFragmentState, constants) - 40usize];
    ["Offset of field: WGPUFragmentState::targetCount"]
        [::std::mem::offset_of!(WGPUFragmentState, targetCount) - 48usize];
    ["Offset of field: WGPUFragmentState::targets"]
        [::std::mem::offset_of!(WGPUFragmentState, targets) - 56usize];
};
#[repr(C)]
pub struct WGPURenderPipelineDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    #[doc = " This is a \\ref NonNullInputString."]
    pub label: WGPUStringView,
    pub layout: WGPUPipelineLayout,
    pub vertex: WGPUVertexState,
    pub primitive: WGPUPrimitiveState,
    pub depthStencil: *const WGPUDepthStencilState,
    pub multisample: WGPUMultisampleState,
    pub fragment: *const WGPUFragmentState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURenderPipelineDescriptor"]
        [::std::mem::size_of::<WGPURenderPipelineDescriptor>() - 168usize];
    ["Alignment of WGPURenderPipelineDescriptor"]
        [::std::mem::align_of::<WGPURenderPipelineDescriptor>() - 8usize];
    ["Offset of field: WGPURenderPipelineDescriptor::nextInChain"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, nextInChain) - 0usize];
    ["Offset of field: WGPURenderPipelineDescriptor::label"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, label) - 8usize];
    ["Offset of field: WGPURenderPipelineDescriptor::layout"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, layout) - 24usize];
    ["Offset of field: WGPURenderPipelineDescriptor::vertex"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, vertex) - 32usize];
    ["Offset of field: WGPURenderPipelineDescriptor::primitive"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, primitive) - 96usize];
    ["Offset of field: WGPURenderPipelineDescriptor::depthStencil"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, depthStencil) - 128usize];
    ["Offset of field: WGPURenderPipelineDescriptor::multisample"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, multisample) - 136usize];
    ["Offset of field: WGPURenderPipelineDescriptor::fragment"]
        [::std::mem::offset_of!(WGPURenderPipelineDescriptor, fragment) - 160usize];
};
#[doc = " Proc pointer type for @ref wgpuCreateInstance:\n > @copydoc wgpuCreateInstance"]
pub type WGPUProcCreateInstance = ::std::option::Option<
    unsafe extern "C" fn(descriptor: *const WGPUInstanceDescriptor) -> WGPUInstance,
>;
#[doc = " Proc pointer type for @ref wgpuGetInstanceCapabilities:\n > @copydoc wgpuGetInstanceCapabilities"]
pub type WGPUProcGetInstanceCapabilities = ::std::option::Option<
    unsafe extern "C" fn(capabilities: *mut WGPUInstanceCapabilities) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuGetProcAddress:\n > @copydoc wgpuGetProcAddress"]
pub type WGPUProcGetProcAddress =
    ::std::option::Option<unsafe extern "C" fn(procName: WGPUStringView) -> WGPUProc>;
#[doc = " Proc pointer type for @ref wgpuAdapterGetFeatures:\n > @copydoc wgpuAdapterGetFeatures"]
pub type WGPUProcAdapterGetFeatures = ::std::option::Option<
    unsafe extern "C" fn(adapter: WGPUAdapter, features: *mut WGPUSupportedFeatures),
>;
#[doc = " Proc pointer type for @ref wgpuAdapterGetInfo:\n > @copydoc wgpuAdapterGetInfo"]
pub type WGPUProcAdapterGetInfo = ::std::option::Option<
    unsafe extern "C" fn(adapter: WGPUAdapter, info: *mut WGPUAdapterInfo) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuAdapterGetLimits:\n > @copydoc wgpuAdapterGetLimits"]
pub type WGPUProcAdapterGetLimits = ::std::option::Option<
    unsafe extern "C" fn(adapter: WGPUAdapter, limits: *mut WGPULimits) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuAdapterHasFeature:\n > @copydoc wgpuAdapterHasFeature"]
pub type WGPUProcAdapterHasFeature = ::std::option::Option<
    unsafe extern "C" fn(adapter: WGPUAdapter, feature: WGPUFeatureName) -> WGPUBool,
>;
#[doc = " Proc pointer type for @ref wgpuAdapterRequestDevice:\n > @copydoc wgpuAdapterRequestDevice"]
pub type WGPUProcAdapterRequestDevice = ::std::option::Option<
    unsafe extern "C" fn(
        adapter: WGPUAdapter,
        descriptor: *const WGPUDeviceDescriptor,
        callbackInfo: WGPURequestDeviceCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuAdapterAddRef.\n > @copydoc wgpuAdapterAddRef"]
pub type WGPUProcAdapterAddRef = ::std::option::Option<unsafe extern "C" fn(adapter: WGPUAdapter)>;
#[doc = " Proc pointer type for @ref wgpuAdapterRelease.\n > @copydoc wgpuAdapterRelease"]
pub type WGPUProcAdapterRelease = ::std::option::Option<unsafe extern "C" fn(adapter: WGPUAdapter)>;
#[doc = " Proc pointer type for @ref wgpuAdapterInfoFreeMembers:\n > @copydoc wgpuAdapterInfoFreeMembers"]
pub type WGPUProcAdapterInfoFreeMembers =
    ::std::option::Option<unsafe extern "C" fn(adapterInfo: WGPUAdapterInfo)>;
#[doc = " Proc pointer type for @ref wgpuBindGroupSetLabel:\n > @copydoc wgpuBindGroupSetLabel"]
pub type WGPUProcBindGroupSetLabel =
    ::std::option::Option<unsafe extern "C" fn(bindGroup: WGPUBindGroup, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuBindGroupAddRef.\n > @copydoc wgpuBindGroupAddRef"]
pub type WGPUProcBindGroupAddRef =
    ::std::option::Option<unsafe extern "C" fn(bindGroup: WGPUBindGroup)>;
#[doc = " Proc pointer type for @ref wgpuBindGroupRelease.\n > @copydoc wgpuBindGroupRelease"]
pub type WGPUProcBindGroupRelease =
    ::std::option::Option<unsafe extern "C" fn(bindGroup: WGPUBindGroup)>;
#[doc = " Proc pointer type for @ref wgpuBindGroupLayoutSetLabel:\n > @copydoc wgpuBindGroupLayoutSetLabel"]
pub type WGPUProcBindGroupLayoutSetLabel = ::std::option::Option<
    unsafe extern "C" fn(bindGroupLayout: WGPUBindGroupLayout, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuBindGroupLayoutAddRef.\n > @copydoc wgpuBindGroupLayoutAddRef"]
pub type WGPUProcBindGroupLayoutAddRef =
    ::std::option::Option<unsafe extern "C" fn(bindGroupLayout: WGPUBindGroupLayout)>;
#[doc = " Proc pointer type for @ref wgpuBindGroupLayoutRelease.\n > @copydoc wgpuBindGroupLayoutRelease"]
pub type WGPUProcBindGroupLayoutRelease =
    ::std::option::Option<unsafe extern "C" fn(bindGroupLayout: WGPUBindGroupLayout)>;
#[doc = " Proc pointer type for @ref wgpuBufferDestroy:\n > @copydoc wgpuBufferDestroy"]
pub type WGPUProcBufferDestroy = ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer)>;
#[doc = " Proc pointer type for @ref wgpuBufferGetConstMappedRange:\n > @copydoc wgpuBufferGetConstMappedRange"]
pub type WGPUProcBufferGetConstMappedRange = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: WGPUBuffer,
        offset: usize,
        size: usize,
    ) -> *const ::std::os::raw::c_void,
>;
#[doc = " Proc pointer type for @ref wgpuBufferGetMapState:\n > @copydoc wgpuBufferGetMapState"]
pub type WGPUProcBufferGetMapState =
    ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer) -> WGPUBufferMapState>;
#[doc = " Proc pointer type for @ref wgpuBufferGetMappedRange:\n > @copydoc wgpuBufferGetMappedRange"]
pub type WGPUProcBufferGetMappedRange = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: WGPUBuffer,
        offset: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " Proc pointer type for @ref wgpuBufferGetSize:\n > @copydoc wgpuBufferGetSize"]
pub type WGPUProcBufferGetSize =
    ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer) -> u64>;
#[doc = " Proc pointer type for @ref wgpuBufferGetUsage:\n > @copydoc wgpuBufferGetUsage"]
pub type WGPUProcBufferGetUsage =
    ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer) -> WGPUBufferUsage>;
#[doc = " Proc pointer type for @ref wgpuBufferMapAsync:\n > @copydoc wgpuBufferMapAsync"]
pub type WGPUProcBufferMapAsync = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: WGPUBuffer,
        mode: WGPUMapMode,
        offset: usize,
        size: usize,
        callbackInfo: WGPUBufferMapCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuBufferSetLabel:\n > @copydoc wgpuBufferSetLabel"]
pub type WGPUProcBufferSetLabel =
    ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuBufferUnmap:\n > @copydoc wgpuBufferUnmap"]
pub type WGPUProcBufferUnmap = ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer)>;
#[doc = " Proc pointer type for @ref wgpuBufferAddRef.\n > @copydoc wgpuBufferAddRef"]
pub type WGPUProcBufferAddRef = ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer)>;
#[doc = " Proc pointer type for @ref wgpuBufferRelease.\n > @copydoc wgpuBufferRelease"]
pub type WGPUProcBufferRelease = ::std::option::Option<unsafe extern "C" fn(buffer: WGPUBuffer)>;
#[doc = " Proc pointer type for @ref wgpuCommandBufferSetLabel:\n > @copydoc wgpuCommandBufferSetLabel"]
pub type WGPUProcCommandBufferSetLabel = ::std::option::Option<
    unsafe extern "C" fn(commandBuffer: WGPUCommandBuffer, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuCommandBufferAddRef.\n > @copydoc wgpuCommandBufferAddRef"]
pub type WGPUProcCommandBufferAddRef =
    ::std::option::Option<unsafe extern "C" fn(commandBuffer: WGPUCommandBuffer)>;
#[doc = " Proc pointer type for @ref wgpuCommandBufferRelease.\n > @copydoc wgpuCommandBufferRelease"]
pub type WGPUProcCommandBufferRelease =
    ::std::option::Option<unsafe extern "C" fn(commandBuffer: WGPUCommandBuffer)>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderBeginComputePass:\n > @copydoc wgpuCommandEncoderBeginComputePass"]
pub type WGPUProcCommandEncoderBeginComputePass = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        descriptor: *const WGPUComputePassDescriptor,
    ) -> WGPUComputePassEncoder,
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderBeginRenderPass:\n > @copydoc wgpuCommandEncoderBeginRenderPass"]
pub type WGPUProcCommandEncoderBeginRenderPass = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        descriptor: *const WGPURenderPassDescriptor,
    ) -> WGPURenderPassEncoder,
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderClearBuffer:\n > @copydoc wgpuCommandEncoderClearBuffer"]
pub type WGPUProcCommandEncoderClearBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        buffer: WGPUBuffer,
        offset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderCopyBufferToBuffer:\n > @copydoc wgpuCommandEncoderCopyBufferToBuffer"]
pub type WGPUProcCommandEncoderCopyBufferToBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        source: WGPUBuffer,
        sourceOffset: u64,
        destination: WGPUBuffer,
        destinationOffset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderCopyBufferToTexture:\n > @copydoc wgpuCommandEncoderCopyBufferToTexture"]
pub type WGPUProcCommandEncoderCopyBufferToTexture = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        source: *const WGPUTexelCopyBufferInfo,
        destination: *const WGPUTexelCopyTextureInfo,
        copySize: *const WGPUExtent3D,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderCopyTextureToBuffer:\n > @copydoc wgpuCommandEncoderCopyTextureToBuffer"]
pub type WGPUProcCommandEncoderCopyTextureToBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        source: *const WGPUTexelCopyTextureInfo,
        destination: *const WGPUTexelCopyBufferInfo,
        copySize: *const WGPUExtent3D,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderCopyTextureToTexture:\n > @copydoc wgpuCommandEncoderCopyTextureToTexture"]
pub type WGPUProcCommandEncoderCopyTextureToTexture = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        source: *const WGPUTexelCopyTextureInfo,
        destination: *const WGPUTexelCopyTextureInfo,
        copySize: *const WGPUExtent3D,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderFinish:\n > @copydoc wgpuCommandEncoderFinish"]
pub type WGPUProcCommandEncoderFinish = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        descriptor: *const WGPUCommandBufferDescriptor,
    ) -> WGPUCommandBuffer,
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderInsertDebugMarker:\n > @copydoc wgpuCommandEncoderInsertDebugMarker"]
pub type WGPUProcCommandEncoderInsertDebugMarker = ::std::option::Option<
    unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder, markerLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderPopDebugGroup:\n > @copydoc wgpuCommandEncoderPopDebugGroup"]
pub type WGPUProcCommandEncoderPopDebugGroup =
    ::std::option::Option<unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder)>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderPushDebugGroup:\n > @copydoc wgpuCommandEncoderPushDebugGroup"]
pub type WGPUProcCommandEncoderPushDebugGroup = ::std::option::Option<
    unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder, groupLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderResolveQuerySet:\n > @copydoc wgpuCommandEncoderResolveQuerySet"]
pub type WGPUProcCommandEncoderResolveQuerySet = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        querySet: WGPUQuerySet,
        firstQuery: u32,
        queryCount: u32,
        destination: WGPUBuffer,
        destinationOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderSetLabel:\n > @copydoc wgpuCommandEncoderSetLabel"]
pub type WGPUProcCommandEncoderSetLabel = ::std::option::Option<
    unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderWriteTimestamp:\n > @copydoc wgpuCommandEncoderWriteTimestamp"]
pub type WGPUProcCommandEncoderWriteTimestamp = ::std::option::Option<
    unsafe extern "C" fn(
        commandEncoder: WGPUCommandEncoder,
        querySet: WGPUQuerySet,
        queryIndex: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderAddRef.\n > @copydoc wgpuCommandEncoderAddRef"]
pub type WGPUProcCommandEncoderAddRef =
    ::std::option::Option<unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder)>;
#[doc = " Proc pointer type for @ref wgpuCommandEncoderRelease.\n > @copydoc wgpuCommandEncoderRelease"]
pub type WGPUProcCommandEncoderRelease =
    ::std::option::Option<unsafe extern "C" fn(commandEncoder: WGPUCommandEncoder)>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderDispatchWorkgroups:\n > @copydoc wgpuComputePassEncoderDispatchWorkgroups"]
pub type WGPUProcComputePassEncoderDispatchWorkgroups = ::std::option::Option<
    unsafe extern "C" fn(
        computePassEncoder: WGPUComputePassEncoder,
        workgroupCountX: u32,
        workgroupCountY: u32,
        workgroupCountZ: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderDispatchWorkgroupsIndirect:\n > @copydoc wgpuComputePassEncoderDispatchWorkgroupsIndirect"]
pub type WGPUProcComputePassEncoderDispatchWorkgroupsIndirect = ::std::option::Option<
    unsafe extern "C" fn(
        computePassEncoder: WGPUComputePassEncoder,
        indirectBuffer: WGPUBuffer,
        indirectOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderEnd:\n > @copydoc wgpuComputePassEncoderEnd"]
pub type WGPUProcComputePassEncoderEnd =
    ::std::option::Option<unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderInsertDebugMarker:\n > @copydoc wgpuComputePassEncoderInsertDebugMarker"]
pub type WGPUProcComputePassEncoderInsertDebugMarker = ::std::option::Option<
    unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder, markerLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderPopDebugGroup:\n > @copydoc wgpuComputePassEncoderPopDebugGroup"]
pub type WGPUProcComputePassEncoderPopDebugGroup =
    ::std::option::Option<unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderPushDebugGroup:\n > @copydoc wgpuComputePassEncoderPushDebugGroup"]
pub type WGPUProcComputePassEncoderPushDebugGroup = ::std::option::Option<
    unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder, groupLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderSetBindGroup:\n > @copydoc wgpuComputePassEncoderSetBindGroup"]
pub type WGPUProcComputePassEncoderSetBindGroup = ::std::option::Option<
    unsafe extern "C" fn(
        computePassEncoder: WGPUComputePassEncoder,
        groupIndex: u32,
        group: WGPUBindGroup,
        dynamicOffsetCount: usize,
        dynamicOffsets: *const u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderSetLabel:\n > @copydoc wgpuComputePassEncoderSetLabel"]
pub type WGPUProcComputePassEncoderSetLabel = ::std::option::Option<
    unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderSetPipeline:\n > @copydoc wgpuComputePassEncoderSetPipeline"]
pub type WGPUProcComputePassEncoderSetPipeline = ::std::option::Option<
    unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder, pipeline: WGPUComputePipeline),
>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderAddRef.\n > @copydoc wgpuComputePassEncoderAddRef"]
pub type WGPUProcComputePassEncoderAddRef =
    ::std::option::Option<unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuComputePassEncoderRelease.\n > @copydoc wgpuComputePassEncoderRelease"]
pub type WGPUProcComputePassEncoderRelease =
    ::std::option::Option<unsafe extern "C" fn(computePassEncoder: WGPUComputePassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuComputePipelineGetBindGroupLayout:\n > @copydoc wgpuComputePipelineGetBindGroupLayout"]
pub type WGPUProcComputePipelineGetBindGroupLayout = ::std::option::Option<
    unsafe extern "C" fn(
        computePipeline: WGPUComputePipeline,
        groupIndex: u32,
    ) -> WGPUBindGroupLayout,
>;
#[doc = " Proc pointer type for @ref wgpuComputePipelineSetLabel:\n > @copydoc wgpuComputePipelineSetLabel"]
pub type WGPUProcComputePipelineSetLabel = ::std::option::Option<
    unsafe extern "C" fn(computePipeline: WGPUComputePipeline, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuComputePipelineAddRef.\n > @copydoc wgpuComputePipelineAddRef"]
pub type WGPUProcComputePipelineAddRef =
    ::std::option::Option<unsafe extern "C" fn(computePipeline: WGPUComputePipeline)>;
#[doc = " Proc pointer type for @ref wgpuComputePipelineRelease.\n > @copydoc wgpuComputePipelineRelease"]
pub type WGPUProcComputePipelineRelease =
    ::std::option::Option<unsafe extern "C" fn(computePipeline: WGPUComputePipeline)>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateBindGroup:\n > @copydoc wgpuDeviceCreateBindGroup"]
pub type WGPUProcDeviceCreateBindGroup = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUBindGroupDescriptor,
    ) -> WGPUBindGroup,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateBindGroupLayout:\n > @copydoc wgpuDeviceCreateBindGroupLayout"]
pub type WGPUProcDeviceCreateBindGroupLayout = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUBindGroupLayoutDescriptor,
    ) -> WGPUBindGroupLayout,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateBuffer:\n > @copydoc wgpuDeviceCreateBuffer"]
pub type WGPUProcDeviceCreateBuffer = ::std::option::Option<
    unsafe extern "C" fn(device: WGPUDevice, descriptor: *const WGPUBufferDescriptor) -> WGPUBuffer,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateCommandEncoder:\n > @copydoc wgpuDeviceCreateCommandEncoder"]
pub type WGPUProcDeviceCreateCommandEncoder = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUCommandEncoderDescriptor,
    ) -> WGPUCommandEncoder,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateComputePipeline:\n > @copydoc wgpuDeviceCreateComputePipeline"]
pub type WGPUProcDeviceCreateComputePipeline = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUComputePipelineDescriptor,
    ) -> WGPUComputePipeline,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateComputePipelineAsync:\n > @copydoc wgpuDeviceCreateComputePipelineAsync"]
pub type WGPUProcDeviceCreateComputePipelineAsync = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUComputePipelineDescriptor,
        callbackInfo: WGPUCreateComputePipelineAsyncCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreatePipelineLayout:\n > @copydoc wgpuDeviceCreatePipelineLayout"]
pub type WGPUProcDeviceCreatePipelineLayout = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUPipelineLayoutDescriptor,
    ) -> WGPUPipelineLayout,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateQuerySet:\n > @copydoc wgpuDeviceCreateQuerySet"]
pub type WGPUProcDeviceCreateQuerySet = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUQuerySetDescriptor,
    ) -> WGPUQuerySet,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateRenderBundleEncoder:\n > @copydoc wgpuDeviceCreateRenderBundleEncoder"]
pub type WGPUProcDeviceCreateRenderBundleEncoder = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPURenderBundleEncoderDescriptor,
    ) -> WGPURenderBundleEncoder,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateRenderPipeline:\n > @copydoc wgpuDeviceCreateRenderPipeline"]
pub type WGPUProcDeviceCreateRenderPipeline = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPURenderPipelineDescriptor,
    ) -> WGPURenderPipeline,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateRenderPipelineAsync:\n > @copydoc wgpuDeviceCreateRenderPipelineAsync"]
pub type WGPUProcDeviceCreateRenderPipelineAsync = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPURenderPipelineDescriptor,
        callbackInfo: WGPUCreateRenderPipelineAsyncCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateSampler:\n > @copydoc wgpuDeviceCreateSampler"]
pub type WGPUProcDeviceCreateSampler = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUSamplerDescriptor,
    ) -> WGPUSampler,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateShaderModule:\n > @copydoc wgpuDeviceCreateShaderModule"]
pub type WGPUProcDeviceCreateShaderModule = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUShaderModuleDescriptor,
    ) -> WGPUShaderModule,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceCreateTexture:\n > @copydoc wgpuDeviceCreateTexture"]
pub type WGPUProcDeviceCreateTexture = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        descriptor: *const WGPUTextureDescriptor,
    ) -> WGPUTexture,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceDestroy:\n > @copydoc wgpuDeviceDestroy"]
pub type WGPUProcDeviceDestroy = ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice)>;
#[doc = " Proc pointer type for @ref wgpuDeviceGetAdapterInfo:\n > @copydoc wgpuDeviceGetAdapterInfo"]
pub type WGPUProcDeviceGetAdapterInfo =
    ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice) -> WGPUAdapterInfo>;
#[doc = " Proc pointer type for @ref wgpuDeviceGetFeatures:\n > @copydoc wgpuDeviceGetFeatures"]
pub type WGPUProcDeviceGetFeatures = ::std::option::Option<
    unsafe extern "C" fn(device: WGPUDevice, features: *mut WGPUSupportedFeatures),
>;
#[doc = " Proc pointer type for @ref wgpuDeviceGetLimits:\n > @copydoc wgpuDeviceGetLimits"]
pub type WGPUProcDeviceGetLimits = ::std::option::Option<
    unsafe extern "C" fn(device: WGPUDevice, limits: *mut WGPULimits) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuDeviceGetLostFuture:\n > @copydoc wgpuDeviceGetLostFuture"]
pub type WGPUProcDeviceGetLostFuture =
    ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice) -> WGPUFuture>;
#[doc = " Proc pointer type for @ref wgpuDeviceGetQueue:\n > @copydoc wgpuDeviceGetQueue"]
pub type WGPUProcDeviceGetQueue =
    ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice) -> WGPUQueue>;
#[doc = " Proc pointer type for @ref wgpuDeviceHasFeature:\n > @copydoc wgpuDeviceHasFeature"]
pub type WGPUProcDeviceHasFeature = ::std::option::Option<
    unsafe extern "C" fn(device: WGPUDevice, feature: WGPUFeatureName) -> WGPUBool,
>;
#[doc = " Proc pointer type for @ref wgpuDevicePopErrorScope:\n > @copydoc wgpuDevicePopErrorScope"]
pub type WGPUProcDevicePopErrorScope = ::std::option::Option<
    unsafe extern "C" fn(
        device: WGPUDevice,
        callbackInfo: WGPUPopErrorScopeCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuDevicePushErrorScope:\n > @copydoc wgpuDevicePushErrorScope"]
pub type WGPUProcDevicePushErrorScope =
    ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice, filter: WGPUErrorFilter)>;
#[doc = " Proc pointer type for @ref wgpuDeviceSetLabel:\n > @copydoc wgpuDeviceSetLabel"]
pub type WGPUProcDeviceSetLabel =
    ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuDeviceAddRef.\n > @copydoc wgpuDeviceAddRef"]
pub type WGPUProcDeviceAddRef = ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice)>;
#[doc = " Proc pointer type for @ref wgpuDeviceRelease.\n > @copydoc wgpuDeviceRelease"]
pub type WGPUProcDeviceRelease = ::std::option::Option<unsafe extern "C" fn(device: WGPUDevice)>;
#[doc = " Proc pointer type for @ref wgpuInstanceCreateSurface:\n > @copydoc wgpuInstanceCreateSurface"]
pub type WGPUProcInstanceCreateSurface = ::std::option::Option<
    unsafe extern "C" fn(
        instance: WGPUInstance,
        descriptor: *const WGPUSurfaceDescriptor,
    ) -> WGPUSurface,
>;
#[doc = " Proc pointer type for @ref wgpuInstanceGetWGSLLanguageFeatures:\n > @copydoc wgpuInstanceGetWGSLLanguageFeatures"]
pub type WGPUProcInstanceGetWGSLLanguageFeatures = ::std::option::Option<
    unsafe extern "C" fn(
        instance: WGPUInstance,
        features: *mut WGPUSupportedWGSLLanguageFeatures,
    ) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuInstanceHasWGSLLanguageFeature:\n > @copydoc wgpuInstanceHasWGSLLanguageFeature"]
pub type WGPUProcInstanceHasWGSLLanguageFeature = ::std::option::Option<
    unsafe extern "C" fn(instance: WGPUInstance, feature: WGPUWGSLLanguageFeatureName) -> WGPUBool,
>;
#[doc = " Proc pointer type for @ref wgpuInstanceProcessEvents:\n > @copydoc wgpuInstanceProcessEvents"]
pub type WGPUProcInstanceProcessEvents =
    ::std::option::Option<unsafe extern "C" fn(instance: WGPUInstance)>;
#[doc = " Proc pointer type for @ref wgpuInstanceRequestAdapter:\n > @copydoc wgpuInstanceRequestAdapter"]
pub type WGPUProcInstanceRequestAdapter = ::std::option::Option<
    unsafe extern "C" fn(
        instance: WGPUInstance,
        options: *const WGPURequestAdapterOptions,
        callbackInfo: WGPURequestAdapterCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuInstanceWaitAny:\n > @copydoc wgpuInstanceWaitAny"]
pub type WGPUProcInstanceWaitAny = ::std::option::Option<
    unsafe extern "C" fn(
        instance: WGPUInstance,
        futureCount: usize,
        futures: *mut WGPUFutureWaitInfo,
        timeoutNS: u64,
    ) -> WGPUWaitStatus,
>;
#[doc = " Proc pointer type for @ref wgpuInstanceAddRef.\n > @copydoc wgpuInstanceAddRef"]
pub type WGPUProcInstanceAddRef =
    ::std::option::Option<unsafe extern "C" fn(instance: WGPUInstance)>;
#[doc = " Proc pointer type for @ref wgpuInstanceRelease.\n > @copydoc wgpuInstanceRelease"]
pub type WGPUProcInstanceRelease =
    ::std::option::Option<unsafe extern "C" fn(instance: WGPUInstance)>;
#[doc = " Proc pointer type for @ref wgpuPipelineLayoutSetLabel:\n > @copydoc wgpuPipelineLayoutSetLabel"]
pub type WGPUProcPipelineLayoutSetLabel = ::std::option::Option<
    unsafe extern "C" fn(pipelineLayout: WGPUPipelineLayout, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuPipelineLayoutAddRef.\n > @copydoc wgpuPipelineLayoutAddRef"]
pub type WGPUProcPipelineLayoutAddRef =
    ::std::option::Option<unsafe extern "C" fn(pipelineLayout: WGPUPipelineLayout)>;
#[doc = " Proc pointer type for @ref wgpuPipelineLayoutRelease.\n > @copydoc wgpuPipelineLayoutRelease"]
pub type WGPUProcPipelineLayoutRelease =
    ::std::option::Option<unsafe extern "C" fn(pipelineLayout: WGPUPipelineLayout)>;
#[doc = " Proc pointer type for @ref wgpuQuerySetDestroy:\n > @copydoc wgpuQuerySetDestroy"]
pub type WGPUProcQuerySetDestroy =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet)>;
#[doc = " Proc pointer type for @ref wgpuQuerySetGetCount:\n > @copydoc wgpuQuerySetGetCount"]
pub type WGPUProcQuerySetGetCount =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet) -> u32>;
#[doc = " Proc pointer type for @ref wgpuQuerySetGetType:\n > @copydoc wgpuQuerySetGetType"]
pub type WGPUProcQuerySetGetType =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet) -> WGPUQueryType>;
#[doc = " Proc pointer type for @ref wgpuQuerySetSetLabel:\n > @copydoc wgpuQuerySetSetLabel"]
pub type WGPUProcQuerySetSetLabel =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuQuerySetAddRef.\n > @copydoc wgpuQuerySetAddRef"]
pub type WGPUProcQuerySetAddRef =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet)>;
#[doc = " Proc pointer type for @ref wgpuQuerySetRelease.\n > @copydoc wgpuQuerySetRelease"]
pub type WGPUProcQuerySetRelease =
    ::std::option::Option<unsafe extern "C" fn(querySet: WGPUQuerySet)>;
#[doc = " Proc pointer type for @ref wgpuQueueOnSubmittedWorkDone:\n > @copydoc wgpuQueueOnSubmittedWorkDone"]
pub type WGPUProcQueueOnSubmittedWorkDone = ::std::option::Option<
    unsafe extern "C" fn(
        queue: WGPUQueue,
        callbackInfo: WGPUQueueWorkDoneCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuQueueSetLabel:\n > @copydoc wgpuQueueSetLabel"]
pub type WGPUProcQueueSetLabel =
    ::std::option::Option<unsafe extern "C" fn(queue: WGPUQueue, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuQueueSubmit:\n > @copydoc wgpuQueueSubmit"]
pub type WGPUProcQueueSubmit = ::std::option::Option<
    unsafe extern "C" fn(queue: WGPUQueue, commandCount: usize, commands: *const WGPUCommandBuffer),
>;
#[doc = " Proc pointer type for @ref wgpuQueueWriteBuffer:\n > @copydoc wgpuQueueWriteBuffer"]
pub type WGPUProcQueueWriteBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        queue: WGPUQueue,
        buffer: WGPUBuffer,
        bufferOffset: u64,
        data: *const ::std::os::raw::c_void,
        size: usize,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuQueueWriteTexture:\n > @copydoc wgpuQueueWriteTexture"]
pub type WGPUProcQueueWriteTexture = ::std::option::Option<
    unsafe extern "C" fn(
        queue: WGPUQueue,
        destination: *const WGPUTexelCopyTextureInfo,
        data: *const ::std::os::raw::c_void,
        dataSize: usize,
        dataLayout: *const WGPUTexelCopyBufferLayout,
        writeSize: *const WGPUExtent3D,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuQueueAddRef.\n > @copydoc wgpuQueueAddRef"]
pub type WGPUProcQueueAddRef = ::std::option::Option<unsafe extern "C" fn(queue: WGPUQueue)>;
#[doc = " Proc pointer type for @ref wgpuQueueRelease.\n > @copydoc wgpuQueueRelease"]
pub type WGPUProcQueueRelease = ::std::option::Option<unsafe extern "C" fn(queue: WGPUQueue)>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleSetLabel:\n > @copydoc wgpuRenderBundleSetLabel"]
pub type WGPUProcRenderBundleSetLabel = ::std::option::Option<
    unsafe extern "C" fn(renderBundle: WGPURenderBundle, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleAddRef.\n > @copydoc wgpuRenderBundleAddRef"]
pub type WGPUProcRenderBundleAddRef =
    ::std::option::Option<unsafe extern "C" fn(renderBundle: WGPURenderBundle)>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleRelease.\n > @copydoc wgpuRenderBundleRelease"]
pub type WGPUProcRenderBundleRelease =
    ::std::option::Option<unsafe extern "C" fn(renderBundle: WGPURenderBundle)>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderDraw:\n > @copydoc wgpuRenderBundleEncoderDraw"]
pub type WGPUProcRenderBundleEncoderDraw = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        vertexCount: u32,
        instanceCount: u32,
        firstVertex: u32,
        firstInstance: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderDrawIndexed:\n > @copydoc wgpuRenderBundleEncoderDrawIndexed"]
pub type WGPUProcRenderBundleEncoderDrawIndexed = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        indexCount: u32,
        instanceCount: u32,
        firstIndex: u32,
        baseVertex: i32,
        firstInstance: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderDrawIndexedIndirect:\n > @copydoc wgpuRenderBundleEncoderDrawIndexedIndirect"]
pub type WGPUProcRenderBundleEncoderDrawIndexedIndirect = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        indirectBuffer: WGPUBuffer,
        indirectOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderDrawIndirect:\n > @copydoc wgpuRenderBundleEncoderDrawIndirect"]
pub type WGPUProcRenderBundleEncoderDrawIndirect = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        indirectBuffer: WGPUBuffer,
        indirectOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderFinish:\n > @copydoc wgpuRenderBundleEncoderFinish"]
pub type WGPUProcRenderBundleEncoderFinish = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        descriptor: *const WGPURenderBundleDescriptor,
    ) -> WGPURenderBundle,
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderInsertDebugMarker:\n > @copydoc wgpuRenderBundleEncoderInsertDebugMarker"]
pub type WGPUProcRenderBundleEncoderInsertDebugMarker = ::std::option::Option<
    unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder, markerLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderPopDebugGroup:\n > @copydoc wgpuRenderBundleEncoderPopDebugGroup"]
pub type WGPUProcRenderBundleEncoderPopDebugGroup =
    ::std::option::Option<unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderPushDebugGroup:\n > @copydoc wgpuRenderBundleEncoderPushDebugGroup"]
pub type WGPUProcRenderBundleEncoderPushDebugGroup = ::std::option::Option<
    unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder, groupLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderSetBindGroup:\n > @copydoc wgpuRenderBundleEncoderSetBindGroup"]
pub type WGPUProcRenderBundleEncoderSetBindGroup = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        groupIndex: u32,
        group: WGPUBindGroup,
        dynamicOffsetCount: usize,
        dynamicOffsets: *const u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderSetIndexBuffer:\n > @copydoc wgpuRenderBundleEncoderSetIndexBuffer"]
pub type WGPUProcRenderBundleEncoderSetIndexBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        buffer: WGPUBuffer,
        format: WGPUIndexFormat,
        offset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderSetLabel:\n > @copydoc wgpuRenderBundleEncoderSetLabel"]
pub type WGPUProcRenderBundleEncoderSetLabel = ::std::option::Option<
    unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderSetPipeline:\n > @copydoc wgpuRenderBundleEncoderSetPipeline"]
pub type WGPUProcRenderBundleEncoderSetPipeline = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        pipeline: WGPURenderPipeline,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderSetVertexBuffer:\n > @copydoc wgpuRenderBundleEncoderSetVertexBuffer"]
pub type WGPUProcRenderBundleEncoderSetVertexBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        renderBundleEncoder: WGPURenderBundleEncoder,
        slot: u32,
        buffer: WGPUBuffer,
        offset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderAddRef.\n > @copydoc wgpuRenderBundleEncoderAddRef"]
pub type WGPUProcRenderBundleEncoderAddRef =
    ::std::option::Option<unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderBundleEncoderRelease.\n > @copydoc wgpuRenderBundleEncoderRelease"]
pub type WGPUProcRenderBundleEncoderRelease =
    ::std::option::Option<unsafe extern "C" fn(renderBundleEncoder: WGPURenderBundleEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderBeginOcclusionQuery:\n > @copydoc wgpuRenderPassEncoderBeginOcclusionQuery"]
pub type WGPUProcRenderPassEncoderBeginOcclusionQuery = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, queryIndex: u32),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderDraw:\n > @copydoc wgpuRenderPassEncoderDraw"]
pub type WGPUProcRenderPassEncoderDraw = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        vertexCount: u32,
        instanceCount: u32,
        firstVertex: u32,
        firstInstance: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderDrawIndexed:\n > @copydoc wgpuRenderPassEncoderDrawIndexed"]
pub type WGPUProcRenderPassEncoderDrawIndexed = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        indexCount: u32,
        instanceCount: u32,
        firstIndex: u32,
        baseVertex: i32,
        firstInstance: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderDrawIndexedIndirect:\n > @copydoc wgpuRenderPassEncoderDrawIndexedIndirect"]
pub type WGPUProcRenderPassEncoderDrawIndexedIndirect = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        indirectBuffer: WGPUBuffer,
        indirectOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderDrawIndirect:\n > @copydoc wgpuRenderPassEncoderDrawIndirect"]
pub type WGPUProcRenderPassEncoderDrawIndirect = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        indirectBuffer: WGPUBuffer,
        indirectOffset: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderEnd:\n > @copydoc wgpuRenderPassEncoderEnd"]
pub type WGPUProcRenderPassEncoderEnd =
    ::std::option::Option<unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderEndOcclusionQuery:\n > @copydoc wgpuRenderPassEncoderEndOcclusionQuery"]
pub type WGPUProcRenderPassEncoderEndOcclusionQuery =
    ::std::option::Option<unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderExecuteBundles:\n > @copydoc wgpuRenderPassEncoderExecuteBundles"]
pub type WGPUProcRenderPassEncoderExecuteBundles = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        bundleCount: usize,
        bundles: *const WGPURenderBundle,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderInsertDebugMarker:\n > @copydoc wgpuRenderPassEncoderInsertDebugMarker"]
pub type WGPUProcRenderPassEncoderInsertDebugMarker = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, markerLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderPopDebugGroup:\n > @copydoc wgpuRenderPassEncoderPopDebugGroup"]
pub type WGPUProcRenderPassEncoderPopDebugGroup =
    ::std::option::Option<unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderPushDebugGroup:\n > @copydoc wgpuRenderPassEncoderPushDebugGroup"]
pub type WGPUProcRenderPassEncoderPushDebugGroup = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, groupLabel: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetBindGroup:\n > @copydoc wgpuRenderPassEncoderSetBindGroup"]
pub type WGPUProcRenderPassEncoderSetBindGroup = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        groupIndex: u32,
        group: WGPUBindGroup,
        dynamicOffsetCount: usize,
        dynamicOffsets: *const u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetBlendConstant:\n > @copydoc wgpuRenderPassEncoderSetBlendConstant"]
pub type WGPUProcRenderPassEncoderSetBlendConstant = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, color: *const WGPUColor),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetIndexBuffer:\n > @copydoc wgpuRenderPassEncoderSetIndexBuffer"]
pub type WGPUProcRenderPassEncoderSetIndexBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        buffer: WGPUBuffer,
        format: WGPUIndexFormat,
        offset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetLabel:\n > @copydoc wgpuRenderPassEncoderSetLabel"]
pub type WGPUProcRenderPassEncoderSetLabel = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetPipeline:\n > @copydoc wgpuRenderPassEncoderSetPipeline"]
pub type WGPUProcRenderPassEncoderSetPipeline = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, pipeline: WGPURenderPipeline),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetScissorRect:\n > @copydoc wgpuRenderPassEncoderSetScissorRect"]
pub type WGPUProcRenderPassEncoderSetScissorRect = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        x: u32,
        y: u32,
        width: u32,
        height: u32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetStencilReference:\n > @copydoc wgpuRenderPassEncoderSetStencilReference"]
pub type WGPUProcRenderPassEncoderSetStencilReference = ::std::option::Option<
    unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder, reference: u32),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetVertexBuffer:\n > @copydoc wgpuRenderPassEncoderSetVertexBuffer"]
pub type WGPUProcRenderPassEncoderSetVertexBuffer = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        slot: u32,
        buffer: WGPUBuffer,
        offset: u64,
        size: u64,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderSetViewport:\n > @copydoc wgpuRenderPassEncoderSetViewport"]
pub type WGPUProcRenderPassEncoderSetViewport = ::std::option::Option<
    unsafe extern "C" fn(
        renderPassEncoder: WGPURenderPassEncoder,
        x: f32,
        y: f32,
        width: f32,
        height: f32,
        minDepth: f32,
        maxDepth: f32,
    ),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderAddRef.\n > @copydoc wgpuRenderPassEncoderAddRef"]
pub type WGPUProcRenderPassEncoderAddRef =
    ::std::option::Option<unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPassEncoderRelease.\n > @copydoc wgpuRenderPassEncoderRelease"]
pub type WGPUProcRenderPassEncoderRelease =
    ::std::option::Option<unsafe extern "C" fn(renderPassEncoder: WGPURenderPassEncoder)>;
#[doc = " Proc pointer type for @ref wgpuRenderPipelineGetBindGroupLayout:\n > @copydoc wgpuRenderPipelineGetBindGroupLayout"]
pub type WGPUProcRenderPipelineGetBindGroupLayout = ::std::option::Option<
    unsafe extern "C" fn(
        renderPipeline: WGPURenderPipeline,
        groupIndex: u32,
    ) -> WGPUBindGroupLayout,
>;
#[doc = " Proc pointer type for @ref wgpuRenderPipelineSetLabel:\n > @copydoc wgpuRenderPipelineSetLabel"]
pub type WGPUProcRenderPipelineSetLabel = ::std::option::Option<
    unsafe extern "C" fn(renderPipeline: WGPURenderPipeline, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuRenderPipelineAddRef.\n > @copydoc wgpuRenderPipelineAddRef"]
pub type WGPUProcRenderPipelineAddRef =
    ::std::option::Option<unsafe extern "C" fn(renderPipeline: WGPURenderPipeline)>;
#[doc = " Proc pointer type for @ref wgpuRenderPipelineRelease.\n > @copydoc wgpuRenderPipelineRelease"]
pub type WGPUProcRenderPipelineRelease =
    ::std::option::Option<unsafe extern "C" fn(renderPipeline: WGPURenderPipeline)>;
#[doc = " Proc pointer type for @ref wgpuSamplerSetLabel:\n > @copydoc wgpuSamplerSetLabel"]
pub type WGPUProcSamplerSetLabel =
    ::std::option::Option<unsafe extern "C" fn(sampler: WGPUSampler, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuSamplerAddRef.\n > @copydoc wgpuSamplerAddRef"]
pub type WGPUProcSamplerAddRef = ::std::option::Option<unsafe extern "C" fn(sampler: WGPUSampler)>;
#[doc = " Proc pointer type for @ref wgpuSamplerRelease.\n > @copydoc wgpuSamplerRelease"]
pub type WGPUProcSamplerRelease = ::std::option::Option<unsafe extern "C" fn(sampler: WGPUSampler)>;
#[doc = " Proc pointer type for @ref wgpuShaderModuleGetCompilationInfo:\n > @copydoc wgpuShaderModuleGetCompilationInfo"]
pub type WGPUProcShaderModuleGetCompilationInfo = ::std::option::Option<
    unsafe extern "C" fn(
        shaderModule: WGPUShaderModule,
        callbackInfo: WGPUCompilationInfoCallbackInfo,
    ) -> WGPUFuture,
>;
#[doc = " Proc pointer type for @ref wgpuShaderModuleSetLabel:\n > @copydoc wgpuShaderModuleSetLabel"]
pub type WGPUProcShaderModuleSetLabel = ::std::option::Option<
    unsafe extern "C" fn(shaderModule: WGPUShaderModule, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuShaderModuleAddRef.\n > @copydoc wgpuShaderModuleAddRef"]
pub type WGPUProcShaderModuleAddRef =
    ::std::option::Option<unsafe extern "C" fn(shaderModule: WGPUShaderModule)>;
#[doc = " Proc pointer type for @ref wgpuShaderModuleRelease.\n > @copydoc wgpuShaderModuleRelease"]
pub type WGPUProcShaderModuleRelease =
    ::std::option::Option<unsafe extern "C" fn(shaderModule: WGPUShaderModule)>;
#[doc = " Proc pointer type for @ref wgpuSupportedFeaturesFreeMembers:\n > @copydoc wgpuSupportedFeaturesFreeMembers"]
pub type WGPUProcSupportedFeaturesFreeMembers =
    ::std::option::Option<unsafe extern "C" fn(supportedFeatures: WGPUSupportedFeatures)>;
#[doc = " Proc pointer type for @ref wgpuSupportedWGSLLanguageFeaturesFreeMembers:\n > @copydoc wgpuSupportedWGSLLanguageFeaturesFreeMembers"]
pub type WGPUProcSupportedWGSLLanguageFeaturesFreeMembers = ::std::option::Option<
    unsafe extern "C" fn(supportedWGSLLanguageFeatures: WGPUSupportedWGSLLanguageFeatures),
>;
#[doc = " Proc pointer type for @ref wgpuSurfaceConfigure:\n > @copydoc wgpuSurfaceConfigure"]
pub type WGPUProcSurfaceConfigure = ::std::option::Option<
    unsafe extern "C" fn(surface: WGPUSurface, config: *const WGPUSurfaceConfiguration),
>;
#[doc = " Proc pointer type for @ref wgpuSurfaceGetCapabilities:\n > @copydoc wgpuSurfaceGetCapabilities"]
pub type WGPUProcSurfaceGetCapabilities = ::std::option::Option<
    unsafe extern "C" fn(
        surface: WGPUSurface,
        adapter: WGPUAdapter,
        capabilities: *mut WGPUSurfaceCapabilities,
    ) -> WGPUStatus,
>;
#[doc = " Proc pointer type for @ref wgpuSurfaceGetCurrentTexture:\n > @copydoc wgpuSurfaceGetCurrentTexture"]
pub type WGPUProcSurfaceGetCurrentTexture = ::std::option::Option<
    unsafe extern "C" fn(surface: WGPUSurface, surfaceTexture: *mut WGPUSurfaceTexture),
>;
#[doc = " Proc pointer type for @ref wgpuSurfacePresent:\n > @copydoc wgpuSurfacePresent"]
pub type WGPUProcSurfacePresent =
    ::std::option::Option<unsafe extern "C" fn(surface: WGPUSurface) -> WGPUStatus>;
#[doc = " Proc pointer type for @ref wgpuSurfaceSetLabel:\n > @copydoc wgpuSurfaceSetLabel"]
pub type WGPUProcSurfaceSetLabel =
    ::std::option::Option<unsafe extern "C" fn(surface: WGPUSurface, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuSurfaceUnconfigure:\n > @copydoc wgpuSurfaceUnconfigure"]
pub type WGPUProcSurfaceUnconfigure =
    ::std::option::Option<unsafe extern "C" fn(surface: WGPUSurface)>;
#[doc = " Proc pointer type for @ref wgpuSurfaceAddRef.\n > @copydoc wgpuSurfaceAddRef"]
pub type WGPUProcSurfaceAddRef = ::std::option::Option<unsafe extern "C" fn(surface: WGPUSurface)>;
#[doc = " Proc pointer type for @ref wgpuSurfaceRelease.\n > @copydoc wgpuSurfaceRelease"]
pub type WGPUProcSurfaceRelease = ::std::option::Option<unsafe extern "C" fn(surface: WGPUSurface)>;
#[doc = " Proc pointer type for @ref wgpuSurfaceCapabilitiesFreeMembers:\n > @copydoc wgpuSurfaceCapabilitiesFreeMembers"]
pub type WGPUProcSurfaceCapabilitiesFreeMembers =
    ::std::option::Option<unsafe extern "C" fn(surfaceCapabilities: WGPUSurfaceCapabilities)>;
#[doc = " Proc pointer type for @ref wgpuTextureCreateView:\n > @copydoc wgpuTextureCreateView"]
pub type WGPUProcTextureCreateView = ::std::option::Option<
    unsafe extern "C" fn(
        texture: WGPUTexture,
        descriptor: *const WGPUTextureViewDescriptor,
    ) -> WGPUTextureView,
>;
#[doc = " Proc pointer type for @ref wgpuTextureDestroy:\n > @copydoc wgpuTextureDestroy"]
pub type WGPUProcTextureDestroy = ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture)>;
#[doc = " Proc pointer type for @ref wgpuTextureGetDepthOrArrayLayers:\n > @copydoc wgpuTextureGetDepthOrArrayLayers"]
pub type WGPUProcTextureGetDepthOrArrayLayers =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> u32>;
#[doc = " Proc pointer type for @ref wgpuTextureGetDimension:\n > @copydoc wgpuTextureGetDimension"]
pub type WGPUProcTextureGetDimension =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> WGPUTextureDimension>;
#[doc = " Proc pointer type for @ref wgpuTextureGetFormat:\n > @copydoc wgpuTextureGetFormat"]
pub type WGPUProcTextureGetFormat =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> WGPUTextureFormat>;
#[doc = " Proc pointer type for @ref wgpuTextureGetHeight:\n > @copydoc wgpuTextureGetHeight"]
pub type WGPUProcTextureGetHeight =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> u32>;
#[doc = " Proc pointer type for @ref wgpuTextureGetMipLevelCount:\n > @copydoc wgpuTextureGetMipLevelCount"]
pub type WGPUProcTextureGetMipLevelCount =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> u32>;
#[doc = " Proc pointer type for @ref wgpuTextureGetSampleCount:\n > @copydoc wgpuTextureGetSampleCount"]
pub type WGPUProcTextureGetSampleCount =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> u32>;
#[doc = " Proc pointer type for @ref wgpuTextureGetUsage:\n > @copydoc wgpuTextureGetUsage"]
pub type WGPUProcTextureGetUsage =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> WGPUTextureUsage>;
#[doc = " Proc pointer type for @ref wgpuTextureGetWidth:\n > @copydoc wgpuTextureGetWidth"]
pub type WGPUProcTextureGetWidth =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture) -> u32>;
#[doc = " Proc pointer type for @ref wgpuTextureSetLabel:\n > @copydoc wgpuTextureSetLabel"]
pub type WGPUProcTextureSetLabel =
    ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture, label: WGPUStringView)>;
#[doc = " Proc pointer type for @ref wgpuTextureAddRef.\n > @copydoc wgpuTextureAddRef"]
pub type WGPUProcTextureAddRef = ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture)>;
#[doc = " Proc pointer type for @ref wgpuTextureRelease.\n > @copydoc wgpuTextureRelease"]
pub type WGPUProcTextureRelease = ::std::option::Option<unsafe extern "C" fn(texture: WGPUTexture)>;
#[doc = " Proc pointer type for @ref wgpuTextureViewSetLabel:\n > @copydoc wgpuTextureViewSetLabel"]
pub type WGPUProcTextureViewSetLabel = ::std::option::Option<
    unsafe extern "C" fn(textureView: WGPUTextureView, label: WGPUStringView),
>;
#[doc = " Proc pointer type for @ref wgpuTextureViewAddRef.\n > @copydoc wgpuTextureViewAddRef"]
pub type WGPUProcTextureViewAddRef =
    ::std::option::Option<unsafe extern "C" fn(textureView: WGPUTextureView)>;
#[doc = " Proc pointer type for @ref wgpuTextureViewRelease.\n > @copydoc wgpuTextureViewRelease"]
pub type WGPUProcTextureViewRelease =
    ::std::option::Option<unsafe extern "C" fn(textureView: WGPUTextureView)>;
pub const WGPUSType_DeviceExtras: WGPUNativeSType = 196609;
pub const WGPUSType_NativeLimits: WGPUNativeSType = 196610;
pub const WGPUSType_PipelineLayoutExtras: WGPUNativeSType = 196611;
pub const WGPUSType_ShaderModuleGLSLDescriptor: WGPUNativeSType = 196612;
pub const WGPUSType_InstanceExtras: WGPUNativeSType = 196614;
pub const WGPUSType_BindGroupEntryExtras: WGPUNativeSType = 196615;
pub const WGPUSType_BindGroupLayoutEntryExtras: WGPUNativeSType = 196616;
pub const WGPUSType_QuerySetDescriptorExtras: WGPUNativeSType = 196617;
pub const WGPUSType_SurfaceConfigurationExtras: WGPUNativeSType = 196618;
pub const WGPUNativeSType_Force32: WGPUNativeSType = 2147483647;
pub type WGPUNativeSType = ::std::os::raw::c_uint;
pub const WGPUNativeFeature_PushConstants: WGPUNativeFeature = 196609;
pub const WGPUNativeFeature_TextureAdapterSpecificFormatFeatures: WGPUNativeFeature = 196610;
pub const WGPUNativeFeature_MultiDrawIndirect: WGPUNativeFeature = 196611;
pub const WGPUNativeFeature_MultiDrawIndirectCount: WGPUNativeFeature = 196612;
pub const WGPUNativeFeature_VertexWritableStorage: WGPUNativeFeature = 196613;
pub const WGPUNativeFeature_TextureBindingArray: WGPUNativeFeature = 196614;
pub const WGPUNativeFeature_SampledTextureAndStorageBufferArrayNonUniformIndexing:
    WGPUNativeFeature = 196615;
pub const WGPUNativeFeature_PipelineStatisticsQuery: WGPUNativeFeature = 196616;
pub const WGPUNativeFeature_StorageResourceBindingArray: WGPUNativeFeature = 196617;
pub const WGPUNativeFeature_PartiallyBoundBindingArray: WGPUNativeFeature = 196618;
pub const WGPUNativeFeature_TextureFormat16bitNorm: WGPUNativeFeature = 196619;
pub const WGPUNativeFeature_TextureCompressionAstcHdr: WGPUNativeFeature = 196620;
pub const WGPUNativeFeature_MappablePrimaryBuffers: WGPUNativeFeature = 196622;
pub const WGPUNativeFeature_BufferBindingArray: WGPUNativeFeature = 196623;
pub const WGPUNativeFeature_UniformBufferAndStorageTextureArrayNonUniformIndexing:
    WGPUNativeFeature = 196624;
pub const WGPUNativeFeature_SpirvShaderPassthrough: WGPUNativeFeature = 196631;
pub const WGPUNativeFeature_VertexAttribute64bit: WGPUNativeFeature = 196633;
pub const WGPUNativeFeature_TextureFormatNv12: WGPUNativeFeature = 196634;
pub const WGPUNativeFeature_RayTracingAccelerationStructure: WGPUNativeFeature = 196635;
pub const WGPUNativeFeature_RayQuery: WGPUNativeFeature = 196636;
pub const WGPUNativeFeature_ShaderF64: WGPUNativeFeature = 196637;
pub const WGPUNativeFeature_ShaderI16: WGPUNativeFeature = 196638;
pub const WGPUNativeFeature_ShaderPrimitiveIndex: WGPUNativeFeature = 196639;
pub const WGPUNativeFeature_ShaderEarlyDepthTest: WGPUNativeFeature = 196640;
pub const WGPUNativeFeature_Subgroup: WGPUNativeFeature = 196641;
pub const WGPUNativeFeature_SubgroupVertex: WGPUNativeFeature = 196642;
pub const WGPUNativeFeature_SubgroupBarrier: WGPUNativeFeature = 196643;
pub const WGPUNativeFeature_TimestampQueryInsideEncoders: WGPUNativeFeature = 196644;
pub const WGPUNativeFeature_TimestampQueryInsidePasses: WGPUNativeFeature = 196645;
pub const WGPUNativeFeature_Force32: WGPUNativeFeature = 2147483647;
pub type WGPUNativeFeature = ::std::os::raw::c_uint;
pub const WGPULogLevel_Off: WGPULogLevel = 0;
pub const WGPULogLevel_Error: WGPULogLevel = 1;
pub const WGPULogLevel_Warn: WGPULogLevel = 2;
pub const WGPULogLevel_Info: WGPULogLevel = 3;
pub const WGPULogLevel_Debug: WGPULogLevel = 4;
pub const WGPULogLevel_Trace: WGPULogLevel = 5;
pub const WGPULogLevel_Force32: WGPULogLevel = 2147483647;
pub type WGPULogLevel = ::std::os::raw::c_uint;
pub type WGPUInstanceBackend = WGPUFlags;
pub const WGPUInstanceBackend_All: WGPUInstanceBackend = 0;
pub const WGPUInstanceBackend_Vulkan: WGPUInstanceBackend = 1;
pub const WGPUInstanceBackend_GL: WGPUInstanceBackend = 2;
pub const WGPUInstanceBackend_Metal: WGPUInstanceBackend = 4;
pub const WGPUInstanceBackend_DX12: WGPUInstanceBackend = 8;
pub const WGPUInstanceBackend_DX11: WGPUInstanceBackend = 16;
pub const WGPUInstanceBackend_BrowserWebGPU: WGPUInstanceBackend = 32;
pub const WGPUInstanceBackend_Primary: WGPUInstanceBackend = 45;
pub const WGPUInstanceBackend_Secondary: WGPUInstanceBackend = 18;
pub const WGPUInstanceBackend_Force32: WGPUInstanceBackend = 2147483647;
pub type WGPUInstanceFlag = WGPUFlags;
pub const WGPUInstanceFlag_Default: WGPUInstanceFlag = 0;
pub const WGPUInstanceFlag_Debug: WGPUInstanceFlag = 1;
pub const WGPUInstanceFlag_Validation: WGPUInstanceFlag = 2;
pub const WGPUInstanceFlag_DiscardHalLabels: WGPUInstanceFlag = 4;
pub const WGPUInstanceFlag_Force32: WGPUInstanceFlag = 2147483647;
pub const WGPUDx12Compiler_Undefined: WGPUDx12Compiler = 0;
pub const WGPUDx12Compiler_Fxc: WGPUDx12Compiler = 1;
pub const WGPUDx12Compiler_Dxc: WGPUDx12Compiler = 2;
pub const WGPUDx12Compiler_Force32: WGPUDx12Compiler = 2147483647;
pub type WGPUDx12Compiler = ::std::os::raw::c_uint;
pub const WGPUGles3MinorVersion_Automatic: WGPUGles3MinorVersion = 0;
pub const WGPUGles3MinorVersion_Version0: WGPUGles3MinorVersion = 1;
pub const WGPUGles3MinorVersion_Version1: WGPUGles3MinorVersion = 2;
pub const WGPUGles3MinorVersion_Version2: WGPUGles3MinorVersion = 3;
pub const WGPUGles3MinorVersion_Force32: WGPUGles3MinorVersion = 2147483647;
pub type WGPUGles3MinorVersion = ::std::os::raw::c_uint;
pub const WGPUPipelineStatisticName_VertexShaderInvocations: WGPUPipelineStatisticName = 0;
pub const WGPUPipelineStatisticName_ClipperInvocations: WGPUPipelineStatisticName = 1;
pub const WGPUPipelineStatisticName_ClipperPrimitivesOut: WGPUPipelineStatisticName = 2;
pub const WGPUPipelineStatisticName_FragmentShaderInvocations: WGPUPipelineStatisticName = 3;
pub const WGPUPipelineStatisticName_ComputeShaderInvocations: WGPUPipelineStatisticName = 4;
pub const WGPUPipelineStatisticName_Force32: WGPUPipelineStatisticName = 2147483647;
pub type WGPUPipelineStatisticName = ::std::os::raw::c_uint;
pub const WGPUNativeQueryType_PipelineStatistics: WGPUNativeQueryType = 196608;
pub const WGPUNativeQueryType_Force32: WGPUNativeQueryType = 2147483647;
pub type WGPUNativeQueryType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceExtras {
    pub chain: WGPUChainedStruct,
    pub backends: WGPUInstanceBackend,
    pub flags: WGPUInstanceFlag,
    pub dx12ShaderCompiler: WGPUDx12Compiler,
    pub gles3MinorVersion: WGPUGles3MinorVersion,
    pub dxilPath: WGPUStringView,
    pub dxcPath: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceExtras"][::std::mem::size_of::<WGPUInstanceExtras>() - 72usize];
    ["Alignment of WGPUInstanceExtras"][::std::mem::align_of::<WGPUInstanceExtras>() - 8usize];
    ["Offset of field: WGPUInstanceExtras::chain"]
        [::std::mem::offset_of!(WGPUInstanceExtras, chain) - 0usize];
    ["Offset of field: WGPUInstanceExtras::backends"]
        [::std::mem::offset_of!(WGPUInstanceExtras, backends) - 16usize];
    ["Offset of field: WGPUInstanceExtras::flags"]
        [::std::mem::offset_of!(WGPUInstanceExtras, flags) - 24usize];
    ["Offset of field: WGPUInstanceExtras::dx12ShaderCompiler"]
        [::std::mem::offset_of!(WGPUInstanceExtras, dx12ShaderCompiler) - 32usize];
    ["Offset of field: WGPUInstanceExtras::gles3MinorVersion"]
        [::std::mem::offset_of!(WGPUInstanceExtras, gles3MinorVersion) - 36usize];
    ["Offset of field: WGPUInstanceExtras::dxilPath"]
        [::std::mem::offset_of!(WGPUInstanceExtras, dxilPath) - 40usize];
    ["Offset of field: WGPUInstanceExtras::dxcPath"]
        [::std::mem::offset_of!(WGPUInstanceExtras, dxcPath) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceExtras {
    pub chain: WGPUChainedStruct,
    pub tracePath: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUDeviceExtras"][::std::mem::size_of::<WGPUDeviceExtras>() - 32usize];
    ["Alignment of WGPUDeviceExtras"][::std::mem::align_of::<WGPUDeviceExtras>() - 8usize];
    ["Offset of field: WGPUDeviceExtras::chain"]
        [::std::mem::offset_of!(WGPUDeviceExtras, chain) - 0usize];
    ["Offset of field: WGPUDeviceExtras::tracePath"]
        [::std::mem::offset_of!(WGPUDeviceExtras, tracePath) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUNativeLimits {
    #[doc = " This struct chain is used as mutable in some places and immutable in others."]
    pub chain: WGPUChainedStructOut,
    pub maxPushConstantSize: u32,
    pub maxNonSamplerBindings: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUNativeLimits"][::std::mem::size_of::<WGPUNativeLimits>() - 24usize];
    ["Alignment of WGPUNativeLimits"][::std::mem::align_of::<WGPUNativeLimits>() - 8usize];
    ["Offset of field: WGPUNativeLimits::chain"]
        [::std::mem::offset_of!(WGPUNativeLimits, chain) - 0usize];
    ["Offset of field: WGPUNativeLimits::maxPushConstantSize"]
        [::std::mem::offset_of!(WGPUNativeLimits, maxPushConstantSize) - 16usize];
    ["Offset of field: WGPUNativeLimits::maxNonSamplerBindings"]
        [::std::mem::offset_of!(WGPUNativeLimits, maxNonSamplerBindings) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPushConstantRange {
    pub stages: WGPUShaderStage,
    pub start: u32,
    pub end: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPushConstantRange"][::std::mem::size_of::<WGPUPushConstantRange>() - 16usize];
    ["Alignment of WGPUPushConstantRange"]
        [::std::mem::align_of::<WGPUPushConstantRange>() - 8usize];
    ["Offset of field: WGPUPushConstantRange::stages"]
        [::std::mem::offset_of!(WGPUPushConstantRange, stages) - 0usize];
    ["Offset of field: WGPUPushConstantRange::start"]
        [::std::mem::offset_of!(WGPUPushConstantRange, start) - 8usize];
    ["Offset of field: WGPUPushConstantRange::end"]
        [::std::mem::offset_of!(WGPUPushConstantRange, end) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutExtras {
    pub chain: WGPUChainedStruct,
    pub pushConstantRangeCount: usize,
    pub pushConstantRanges: *const WGPUPushConstantRange,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUPipelineLayoutExtras"]
        [::std::mem::size_of::<WGPUPipelineLayoutExtras>() - 32usize];
    ["Alignment of WGPUPipelineLayoutExtras"]
        [::std::mem::align_of::<WGPUPipelineLayoutExtras>() - 8usize];
    ["Offset of field: WGPUPipelineLayoutExtras::chain"]
        [::std::mem::offset_of!(WGPUPipelineLayoutExtras, chain) - 0usize];
    ["Offset of field: WGPUPipelineLayoutExtras::pushConstantRangeCount"]
        [::std::mem::offset_of!(WGPUPipelineLayoutExtras, pushConstantRangeCount) - 16usize];
    ["Offset of field: WGPUPipelineLayoutExtras::pushConstantRanges"]
        [::std::mem::offset_of!(WGPUPipelineLayoutExtras, pushConstantRanges) - 24usize];
};
pub type WGPUSubmissionIndex = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderDefine {
    pub name: WGPUStringView,
    pub value: WGPUStringView,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderDefine"][::std::mem::size_of::<WGPUShaderDefine>() - 32usize];
    ["Alignment of WGPUShaderDefine"][::std::mem::align_of::<WGPUShaderDefine>() - 8usize];
    ["Offset of field: WGPUShaderDefine::name"]
        [::std::mem::offset_of!(WGPUShaderDefine, name) - 0usize];
    ["Offset of field: WGPUShaderDefine::value"]
        [::std::mem::offset_of!(WGPUShaderDefine, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleGLSLDescriptor {
    pub chain: WGPUChainedStruct,
    pub stage: WGPUShaderStage,
    pub code: WGPUStringView,
    pub defineCount: u32,
    pub defines: *mut WGPUShaderDefine,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderModuleGLSLDescriptor"]
        [::std::mem::size_of::<WGPUShaderModuleGLSLDescriptor>() - 56usize];
    ["Alignment of WGPUShaderModuleGLSLDescriptor"]
        [::std::mem::align_of::<WGPUShaderModuleGLSLDescriptor>() - 8usize];
    ["Offset of field: WGPUShaderModuleGLSLDescriptor::chain"]
        [::std::mem::offset_of!(WGPUShaderModuleGLSLDescriptor, chain) - 0usize];
    ["Offset of field: WGPUShaderModuleGLSLDescriptor::stage"]
        [::std::mem::offset_of!(WGPUShaderModuleGLSLDescriptor, stage) - 16usize];
    ["Offset of field: WGPUShaderModuleGLSLDescriptor::code"]
        [::std::mem::offset_of!(WGPUShaderModuleGLSLDescriptor, code) - 24usize];
    ["Offset of field: WGPUShaderModuleGLSLDescriptor::defineCount"]
        [::std::mem::offset_of!(WGPUShaderModuleGLSLDescriptor, defineCount) - 40usize];
    ["Offset of field: WGPUShaderModuleGLSLDescriptor::defines"]
        [::std::mem::offset_of!(WGPUShaderModuleGLSLDescriptor, defines) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleDescriptorSpirV {
    pub label: WGPUStringView,
    pub sourceSize: u32,
    pub source: *const u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUShaderModuleDescriptorSpirV"]
        [::std::mem::size_of::<WGPUShaderModuleDescriptorSpirV>() - 32usize];
    ["Alignment of WGPUShaderModuleDescriptorSpirV"]
        [::std::mem::align_of::<WGPUShaderModuleDescriptorSpirV>() - 8usize];
    ["Offset of field: WGPUShaderModuleDescriptorSpirV::label"]
        [::std::mem::offset_of!(WGPUShaderModuleDescriptorSpirV, label) - 0usize];
    ["Offset of field: WGPUShaderModuleDescriptorSpirV::sourceSize"]
        [::std::mem::offset_of!(WGPUShaderModuleDescriptorSpirV, sourceSize) - 16usize];
    ["Offset of field: WGPUShaderModuleDescriptorSpirV::source"]
        [::std::mem::offset_of!(WGPUShaderModuleDescriptorSpirV, source) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURegistryReport {
    pub numAllocated: usize,
    pub numKeptFromUser: usize,
    pub numReleasedFromUser: usize,
    pub elementSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPURegistryReport"][::std::mem::size_of::<WGPURegistryReport>() - 32usize];
    ["Alignment of WGPURegistryReport"][::std::mem::align_of::<WGPURegistryReport>() - 8usize];
    ["Offset of field: WGPURegistryReport::numAllocated"]
        [::std::mem::offset_of!(WGPURegistryReport, numAllocated) - 0usize];
    ["Offset of field: WGPURegistryReport::numKeptFromUser"]
        [::std::mem::offset_of!(WGPURegistryReport, numKeptFromUser) - 8usize];
    ["Offset of field: WGPURegistryReport::numReleasedFromUser"]
        [::std::mem::offset_of!(WGPURegistryReport, numReleasedFromUser) - 16usize];
    ["Offset of field: WGPURegistryReport::elementSize"]
        [::std::mem::offset_of!(WGPURegistryReport, elementSize) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUHubReport {
    pub adapters: WGPURegistryReport,
    pub devices: WGPURegistryReport,
    pub queues: WGPURegistryReport,
    pub pipelineLayouts: WGPURegistryReport,
    pub shaderModules: WGPURegistryReport,
    pub bindGroupLayouts: WGPURegistryReport,
    pub bindGroups: WGPURegistryReport,
    pub commandBuffers: WGPURegistryReport,
    pub renderBundles: WGPURegistryReport,
    pub renderPipelines: WGPURegistryReport,
    pub computePipelines: WGPURegistryReport,
    pub pipelineCaches: WGPURegistryReport,
    pub querySets: WGPURegistryReport,
    pub buffers: WGPURegistryReport,
    pub textures: WGPURegistryReport,
    pub textureViews: WGPURegistryReport,
    pub samplers: WGPURegistryReport,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUHubReport"][::std::mem::size_of::<WGPUHubReport>() - 544usize];
    ["Alignment of WGPUHubReport"][::std::mem::align_of::<WGPUHubReport>() - 8usize];
    ["Offset of field: WGPUHubReport::adapters"]
        [::std::mem::offset_of!(WGPUHubReport, adapters) - 0usize];
    ["Offset of field: WGPUHubReport::devices"]
        [::std::mem::offset_of!(WGPUHubReport, devices) - 32usize];
    ["Offset of field: WGPUHubReport::queues"]
        [::std::mem::offset_of!(WGPUHubReport, queues) - 64usize];
    ["Offset of field: WGPUHubReport::pipelineLayouts"]
        [::std::mem::offset_of!(WGPUHubReport, pipelineLayouts) - 96usize];
    ["Offset of field: WGPUHubReport::shaderModules"]
        [::std::mem::offset_of!(WGPUHubReport, shaderModules) - 128usize];
    ["Offset of field: WGPUHubReport::bindGroupLayouts"]
        [::std::mem::offset_of!(WGPUHubReport, bindGroupLayouts) - 160usize];
    ["Offset of field: WGPUHubReport::bindGroups"]
        [::std::mem::offset_of!(WGPUHubReport, bindGroups) - 192usize];
    ["Offset of field: WGPUHubReport::commandBuffers"]
        [::std::mem::offset_of!(WGPUHubReport, commandBuffers) - 224usize];
    ["Offset of field: WGPUHubReport::renderBundles"]
        [::std::mem::offset_of!(WGPUHubReport, renderBundles) - 256usize];
    ["Offset of field: WGPUHubReport::renderPipelines"]
        [::std::mem::offset_of!(WGPUHubReport, renderPipelines) - 288usize];
    ["Offset of field: WGPUHubReport::computePipelines"]
        [::std::mem::offset_of!(WGPUHubReport, computePipelines) - 320usize];
    ["Offset of field: WGPUHubReport::pipelineCaches"]
        [::std::mem::offset_of!(WGPUHubReport, pipelineCaches) - 352usize];
    ["Offset of field: WGPUHubReport::querySets"]
        [::std::mem::offset_of!(WGPUHubReport, querySets) - 384usize];
    ["Offset of field: WGPUHubReport::buffers"]
        [::std::mem::offset_of!(WGPUHubReport, buffers) - 416usize];
    ["Offset of field: WGPUHubReport::textures"]
        [::std::mem::offset_of!(WGPUHubReport, textures) - 448usize];
    ["Offset of field: WGPUHubReport::textureViews"]
        [::std::mem::offset_of!(WGPUHubReport, textureViews) - 480usize];
    ["Offset of field: WGPUHubReport::samplers"]
        [::std::mem::offset_of!(WGPUHubReport, samplers) - 512usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUGlobalReport {
    pub surfaces: WGPURegistryReport,
    pub hub: WGPUHubReport,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUGlobalReport"][::std::mem::size_of::<WGPUGlobalReport>() - 576usize];
    ["Alignment of WGPUGlobalReport"][::std::mem::align_of::<WGPUGlobalReport>() - 8usize];
    ["Offset of field: WGPUGlobalReport::surfaces"]
        [::std::mem::offset_of!(WGPUGlobalReport, surfaces) - 0usize];
    ["Offset of field: WGPUGlobalReport::hub"]
        [::std::mem::offset_of!(WGPUGlobalReport, hub) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceEnumerateAdapterOptions {
    pub nextInChain: *const WGPUChainedStruct,
    pub backends: WGPUInstanceBackend,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUInstanceEnumerateAdapterOptions"]
        [::std::mem::size_of::<WGPUInstanceEnumerateAdapterOptions>() - 16usize];
    ["Alignment of WGPUInstanceEnumerateAdapterOptions"]
        [::std::mem::align_of::<WGPUInstanceEnumerateAdapterOptions>() - 8usize];
    ["Offset of field: WGPUInstanceEnumerateAdapterOptions::nextInChain"]
        [::std::mem::offset_of!(WGPUInstanceEnumerateAdapterOptions, nextInChain) - 0usize];
    ["Offset of field: WGPUInstanceEnumerateAdapterOptions::backends"]
        [::std::mem::offset_of!(WGPUInstanceEnumerateAdapterOptions, backends) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupEntryExtras {
    pub chain: WGPUChainedStruct,
    pub buffers: *const WGPUBuffer,
    pub bufferCount: usize,
    pub samplers: *const WGPUSampler,
    pub samplerCount: usize,
    pub textureViews: *const WGPUTextureView,
    pub textureViewCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupEntryExtras"]
        [::std::mem::size_of::<WGPUBindGroupEntryExtras>() - 64usize];
    ["Alignment of WGPUBindGroupEntryExtras"]
        [::std::mem::align_of::<WGPUBindGroupEntryExtras>() - 8usize];
    ["Offset of field: WGPUBindGroupEntryExtras::chain"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, chain) - 0usize];
    ["Offset of field: WGPUBindGroupEntryExtras::buffers"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, buffers) - 16usize];
    ["Offset of field: WGPUBindGroupEntryExtras::bufferCount"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, bufferCount) - 24usize];
    ["Offset of field: WGPUBindGroupEntryExtras::samplers"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, samplers) - 32usize];
    ["Offset of field: WGPUBindGroupEntryExtras::samplerCount"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, samplerCount) - 40usize];
    ["Offset of field: WGPUBindGroupEntryExtras::textureViews"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, textureViews) - 48usize];
    ["Offset of field: WGPUBindGroupEntryExtras::textureViewCount"]
        [::std::mem::offset_of!(WGPUBindGroupEntryExtras, textureViewCount) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutEntryExtras {
    pub chain: WGPUChainedStruct,
    pub count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUBindGroupLayoutEntryExtras"]
        [::std::mem::size_of::<WGPUBindGroupLayoutEntryExtras>() - 24usize];
    ["Alignment of WGPUBindGroupLayoutEntryExtras"]
        [::std::mem::align_of::<WGPUBindGroupLayoutEntryExtras>() - 8usize];
    ["Offset of field: WGPUBindGroupLayoutEntryExtras::chain"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntryExtras, chain) - 0usize];
    ["Offset of field: WGPUBindGroupLayoutEntryExtras::count"]
        [::std::mem::offset_of!(WGPUBindGroupLayoutEntryExtras, count) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUQuerySetDescriptorExtras {
    pub chain: WGPUChainedStruct,
    pub pipelineStatistics: *const WGPUPipelineStatisticName,
    pub pipelineStatisticCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUQuerySetDescriptorExtras"]
        [::std::mem::size_of::<WGPUQuerySetDescriptorExtras>() - 32usize];
    ["Alignment of WGPUQuerySetDescriptorExtras"]
        [::std::mem::align_of::<WGPUQuerySetDescriptorExtras>() - 8usize];
    ["Offset of field: WGPUQuerySetDescriptorExtras::chain"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptorExtras, chain) - 0usize];
    ["Offset of field: WGPUQuerySetDescriptorExtras::pipelineStatistics"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptorExtras, pipelineStatistics) - 16usize];
    ["Offset of field: WGPUQuerySetDescriptorExtras::pipelineStatisticCount"]
        [::std::mem::offset_of!(WGPUQuerySetDescriptorExtras, pipelineStatisticCount) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceConfigurationExtras {
    pub chain: WGPUChainedStruct,
    pub desiredMaximumFrameLatency: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUSurfaceConfigurationExtras"]
        [::std::mem::size_of::<WGPUSurfaceConfigurationExtras>() - 24usize];
    ["Alignment of WGPUSurfaceConfigurationExtras"]
        [::std::mem::align_of::<WGPUSurfaceConfigurationExtras>() - 8usize];
    ["Offset of field: WGPUSurfaceConfigurationExtras::chain"]
        [::std::mem::offset_of!(WGPUSurfaceConfigurationExtras, chain) - 0usize];
    ["Offset of field: WGPUSurfaceConfigurationExtras::desiredMaximumFrameLatency"][::std::mem::offset_of!(
        WGPUSurfaceConfigurationExtras,
        desiredMaximumFrameLatency
    ) - 16usize];
};
pub type WGPULogCallback = ::std::option::Option<
    unsafe extern "C" fn(
        level: WGPULogLevel,
        message: WGPUStringView,
        userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub const WGPUNativeTextureFormat_R16Unorm: WGPUNativeTextureFormat = 196609;
pub const WGPUNativeTextureFormat_R16Snorm: WGPUNativeTextureFormat = 196610;
pub const WGPUNativeTextureFormat_Rg16Unorm: WGPUNativeTextureFormat = 196611;
pub const WGPUNativeTextureFormat_Rg16Snorm: WGPUNativeTextureFormat = 196612;
pub const WGPUNativeTextureFormat_Rgba16Unorm: WGPUNativeTextureFormat = 196613;
pub const WGPUNativeTextureFormat_Rgba16Snorm: WGPUNativeTextureFormat = 196614;
pub const WGPUNativeTextureFormat_NV12: WGPUNativeTextureFormat = 196615;
pub type WGPUNativeTextureFormat = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureIOSurfaceDescriptor {
    pub width: u32,
    pub height: u32,
    pub usage: u32,
    pub format: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WGPUTextureIOSurfaceDescriptor"]
        [::std::mem::size_of::<WGPUTextureIOSurfaceDescriptor>() - 16usize];
    ["Alignment of WGPUTextureIOSurfaceDescriptor"]
        [::std::mem::align_of::<WGPUTextureIOSurfaceDescriptor>() - 4usize];
    ["Offset of field: WGPUTextureIOSurfaceDescriptor::width"]
        [::std::mem::offset_of!(WGPUTextureIOSurfaceDescriptor, width) - 0usize];
    ["Offset of field: WGPUTextureIOSurfaceDescriptor::height"]
        [::std::mem::offset_of!(WGPUTextureIOSurfaceDescriptor, height) - 4usize];
    ["Offset of field: WGPUTextureIOSurfaceDescriptor::usage"]
        [::std::mem::offset_of!(WGPUTextureIOSurfaceDescriptor, usage) - 8usize];
    ["Offset of field: WGPUTextureIOSurfaceDescriptor::format"]
        [::std::mem::offset_of!(WGPUTextureIOSurfaceDescriptor, format) - 12usize];
};
